{"jobs":[{"data":{"slug":"3650","language":"en-us","languages":["en-us"],"req_id":"3650","title":"Software Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview As a software engineer at GitHub, you will enhance the collaboration experience at GitHub by working closely with a community of engineers and designers with a distributed, diverse and passionate team delivering the services that millions of developers depend on. In this role you will design, prototype, implement, ship and support highly performant and inspiring user experiences with your team. We are looking for creative problem solvers and diverse thinkers, people who care about culture as well as customers and features. We believe that how we do things is as important as what we do. Big vision, a common purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what lead to great results. Great products reflect the teams that build them. Responsibilities Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Receive technical mentorship, collaborate and pair with others, provide code reviews, and communicate clearly to your leadership about progress, blockers, and gaps. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code. Qualifications Required Qualifications 1+ year(s) experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, or related field OR equivalent experience. Preferred Qualifications Experience with Git and GitHub Experience using Azure technologies is a bonus Experience using front-end frameworks like React.js Understanding of REST principles and experience with backend APIs Strong written and verbal communication skill Passionate about healthy team culture and collaboration Comfortable working transparently in an agile environment and soliciting feedback from peers Compensation Range The base salary range for this job is USD $66,900.00 - USD $177,600.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications 1+ year(s) experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, or related field OR equivalent experience. Preferred Qualifications Experience with Git and GitHub Experience using Azure technologies is a bonus Experience using front-end frameworks like React.js Understanding of REST principles and experience with backend APIs Strong written and verbal communication skill Passionate about healthy team culture and collaboration Comfortable working transparently in an agile environment and soliciting feedback from peers","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Receive technical mentorship, collaborate and pair with others, provide code reviews, and communicate clearly to your leadership about progress, blockers, and gaps. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","posted_date":"2024-10-28T20:31:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/3650/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/90968746054558406","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"891075a5bfb8f0c59f3de2764de2602d","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Receive technical mentorship, collaborate and pair with others, provide code reviews, and communicate clearly to your leadership about progress, blockers, and gaps. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-11-20T14:16:34Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-10-28T20:31:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9"},"revision_int":14,"uuid":"4f25647c-49c0-4a73-bb00-de60ba92bc3c"},"import_id":"91d363b6-2f20-4c6a-ba86-ff4036712eae","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3650?lang=en-us","last_mod":"2024-11-20T14:16:38+0000","gdpr":false},"update_date":"2024-11-20T14:16:38+0000","create_date":"2024-10-28T20:36:34+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"3088","language":"en-us","languages":["en-us"],"req_id":"3088","title":"Staff Software Engineer - Search","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview GitHub is changing the way the world builds software, and we want you to help! We’re looking for a Staff level Software Engineer to join the Code Search team. More of the world’s development data lives on GitHub than anywhere else. Helping developers navigate and understand that data is a core part of GitHub’s mission, and an area with significant potential we’ve only begun to realize. We have high aspirations for how we can help developers understand and navigate code, and for making collaboration more seamless. The foundation for these efforts is our highly scalable code search engine, which we are now expanding to help power semantic/vector search to better support many of GitHub’s AI experiences. In this role, you will have the opportunity to be part of the team that’s reinventing the platform and infrastructure that millions of developers depend on for -- re-thinking everything from the experience to the system architecture supporting it. You will be involved in the design, rollout, and support of a highly performant, highly scalable and highly available search platform with your team. Code search, semantic search and AI are a complex, cutting edge problem space and you will help your senior team navigate uncertainty and make effective implementation tradeoff decisions, relying on careful reasoning and decision making around a significant infrastructure budget. Together we are creating the tools and products that are integral to how people build software. We pride ourselves on being thoughtful, intentional, and productive. We value learning, introspection and reflection, and we’re always looking for ways to improve as a team and as individuals. Responsibilities Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support a highly available service used by millions of users on a daily basis Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Help ensure that individuals on the team are learning, growing and advancing in their respective careers Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you Qualifications Required Qualifications: Several years of proficiency in Rust, C or C++ Several years of proficiency in systems programming, search index internals and information retrieval Experience designing, building, scaling and maintaining large-scale distributed systems Experience designing and implementing data structures and algorithms Preferred Qualifications: Experience effectively contributing to technical strategy and roadmaps Passionate about fostering good engineering practices and processes Solid understanding of testing principles and high quality software Understanding of production system monitoring and observability Troubleshooting skills across network, application, caching, queuing, load-balancing, storage and distributed services layers. Excellent analytical skills as well as communication skills both verbal and written. We’re a distributed team so we’re extra mindful about communication. Strong customer focus and data driven approach GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. Equal Employment Opportunity GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"United Kingdom Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: Several years of proficiency in Rust, C or C++ Several years of proficiency in systems programming, search index internals and information retrieval Experience designing, building, scaling and maintaining large-scale distributed systems Experience designing and implementing data structures and algorithms Preferred Qualifications: Experience effectively contributing to technical strategy and roadmaps Passionate about fostering good engineering practices and processes Solid understanding of testing principles and high quality software Understanding of production system monitoring and observability Troubleshooting skills across network, application, caching, queuing, load-balancing, storage and distributed services layers. Excellent analytical skills as well as communication skills both verbal and written. We’re a distributed team so we’re extra mindful about communication. Strong customer focus and data driven approach","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support a highly available service used by millions of users on a daily basis Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Help ensure that individuals on the team are learning, growing and advancing in their respective careers Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you","posted_date":"2024-07-12T19:06:00+0000","apply_url":"https://globalcareers-githubinc.icims.com/jobs/3088/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-08-28T21:04:05Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-07-12T19:06:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":5,"uuid":"75b7c161-9b1f-4da3-a334-741ebef47f8c"},"import_id":"a873e6c6-9a4e-4740-96d3-ba9132912b49","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/jobs/106970651067065030","jobHash":"8b27bc0aa3474b4de02bd1dee181a225","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support a highly available service used by millions of users on a daily basis Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Help ensure that individuals on the team are learning, growing and advancing in their respective careers Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/3088?lang=en-us","last_mod":"2024-11-06T09:37:28+0000","gdpr":true},"update_date":"2024-11-06T09:37:28+0000","create_date":"2024-11-06T09:37:28+0000","category":[" Engineering"],"full_location":"United Kingdom","short_location":"United Kingdom","multipleLocations":false}},{"data":{"slug":"3568","language":"en-us","languages":["en-us"],"req_id":"3568","title":"Software Engineer II","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, Denmark Overview In the GitHub code scanning team, we are passionate about ensuring the security and quality of the world’s software - from open source to the enterprise. We believe that the best way to secure and improve the quality of software is to detect actionable issues early in the development process, and actively facilitate their remediation. This ensures that found alerts are fixed, and provides a great user experience that integrates naturally into developer workflows. Our team develops CodeQL and Copilot Autofix, two key components powering the code scanning product that’s part of GitHub’s Advanced Security offering, used by hundreds of thousands of developers and projects every day. CodeQL is GitHub's own semantic code analysis engine that uses world-class static analysis research and technology to deeply analyze code, enabling the early detection of security vulnerabilities and correctness errors in software. CodeQL currently supports a wide range of programming languages, including C/C++, C#, Go, Java, JavaScript/TypeScript, Kotlin, Python, Ruby, Rust, and Swift. Copilot Autofix is our LLM-powered remediation system that produces high-quality fix suggestions for code scanning alerts, empowering developers to fix alerts as soon as they are found or that already exist in their codebase. Responsibilities In this role, you will join one of the distributed engineering teams responsible for building and expanding the core capabilities of code scanning with CodeQL and Copilot Autofix, in one of the following tracks: Code Analysis In this track, you will be part of a CodeQL language analysis team that maintains CodeQL support for multiple programming languages. You will help build source code extractors that parse and compile code written in each language, translating the source code into data that CodeQL can understand, and keeping up with the latest version of each supported language. You will write and maintain queries in the CodeQL query language that accurately detect security vulnerabilities and incorrect coding patterns, and ensure the quality of LLM-powered Copilot Autofix suggestions for fixing the alerts found. You will help build and maintain analysis libraries in the CodeQL query language that reason precisely about the semantics of programming languages, supporting the development of queries across all languages. CodeQL Foundations In this track, you will be part of the CodeQL Foundations team, and work primarily on QL, the query language powering CodeQL analysis, and its underlying query compiler and evaluator within the CodeQL CLI. You will expand the expressive power of the CodeQL query language and speed up the performance of the underlying query engine, empowering the other CodeQL teams to write high-quality analysis, and ensuring that CodeQL scales to the largest codebases in the world. CodeQL Experiences In this track, you will be part of the CodeQL Experiences team, and work primarily on the CodeQL CLI, the CodeQL Action, and LLM-powered Copilot Autofix capabilities. You will work on integrating CodeQL as a code scanning tool running in production in GitHub Actions, third-party CI systems, the command line, and the IDE. You will work on building, expanding, and robustly evaluating the Copilot Autofix engine, which uses LLMs and contextual information from code scanning alerts to produce AI-powered fix suggestions for those alerts. In any of the above tracks, you will work closely with various engineering teams, product managers, designers, and technical writers that build different aspects of the code scanning product, to influence product direction and deliver features to users, with clear focus on quality, reliability, and user experience. You will engage with internal users and external users (both from enterprise customers and the open-source community) to help them succeed with the product. You’ll influence and provide feedback on the organisational culture and processes, always looking for opportunities to improve in a continuous pursuit of excellence. Qualifications Required Qualifications: Experience in software engineering, with a high level of familiarity with C, C++, or Rust, and the interest and ability to learn additional programming languages as required. In addition, applicants should have a good level of familiarity with one or more of the following areas: Software security, including static analysis, dynamic analysis, software supply chain security, and best practices in creating high-quality, secure code Experience building developer tools that operate on source code, such as compilers, parsers, linters, static analysers, debuggers, CLI tools, or IDE extensions Machine learning applied to understanding source code, specifically using prompt engineering with large language models (LLMs) and systematic data collection and result evaluation Preferred Qualifications: Additionally, we would highly encourage applying if you have one or more of the following skills: Experience operating user-facing software at scale, including availability and observability Experience working in a distributed team, operating effectively across multiple time zones (our teams span a wide time zone range from Pacific time to Central European time) and of working with multiple stakeholders and teams across engineering, product, and design Knowledge of compilers, program analysis, programming language design and implementation Knowledge of logic programming or database query languages (e.g. SQL, Prolog, Datalog, Kusto Query Language) and building integrations with CI/CD systems, such as GitHub Actions or Jenkins GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. Equal Employment Opportunity GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"Denmark Remote","country":"Denmark","country_code":"DK","location_type":"ANY","latitude":56.26392,"longitude":9.501785,"categories":[{"name":"Engineering"}],"tags2":["DK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: Experience in software engineering, with a high level of familiarity with C, C++, or Rust, and the interest and ability to learn additional programming languages as required. In addition, applicants should have a good level of familiarity with one or more of the following areas: Software security, including static analysis, dynamic analysis, software supply chain security, and best practices in creating high-quality, secure code Experience building developer tools that operate on source code, such as compilers, parsers, linters, static analysers, debuggers, CLI tools, or IDE extensions Machine learning applied to understanding source code, specifically using prompt engineering with large language models (LLMs) and systematic data collection and result evaluation Preferred Qualifications: Additionally, we would highly encourage applying if you have one or more of the following skills: Experience operating user-facing software at scale, including availability and observability Experience working in a distributed team, operating effectively across multiple time zones (our teams span a wide time zone range from Pacific time to Central European time) and of working with multiple stakeholders and teams across engineering, product, and design Knowledge of compilers, program analysis, programming language design and implementation Knowledge of logic programming or database query languages (e.g. SQL, Prolog, Datalog, Kusto Query Language) and building integrations with CI/CD systems, such as GitHub Actions or Jenkins","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"In this role, you will join one of the distributed engineering teams responsible for building and expanding the core capabilities of code scanning with CodeQL and Copilot Autofix, in one of the following tracks: Code Analysis In this track, you will be part of a CodeQL language analysis team that maintains CodeQL support for multiple programming languages. You will help build source code extractors that parse and compile code written in each language, translating the source code into data that CodeQL can understand, and keeping up with the latest version of each supported language. You will write and maintain queries in the CodeQL query language that accurately detect security vulnerabilities and incorrect coding patterns, and ensure the quality of LLM-powered Copilot Autofix suggestions for fixing the alerts found. You will help build and maintain analysis libraries in the CodeQL query language that reason precisely about the semantics of programming languages, supporting the development of queries across all languages. CodeQL Foundations In this track, you will be part of the CodeQL Foundations team, and work primarily on QL, the query language powering CodeQL analysis, and its underlying query compiler and evaluator within the CodeQL CLI. You will expand the expressive power of the CodeQL query language and speed up the performance of the underlying query engine, empowering the other CodeQL teams to write high-quality analysis, and ensuring that CodeQL scales to the largest codebases in the world. CodeQL Experiences In this track, you will be part of the CodeQL Experiences team, and work primarily on the CodeQL CLI, the CodeQL Action, and LLM-powered Copilot Autofix capabilities. You will work on integrating CodeQL as a code scanning tool running in production in GitHub Actions, third-party CI systems, the command line, and the IDE. You will work on building, expanding, and robustly evaluating the Copilot Autofix engine, which uses LLMs and contextual information from code scanning alerts to produce AI-powered fix suggestions for those alerts. In any of the above tracks, you will work closely with various engineering teams, product managers, designers, and technical writers that build different aspects of the code scanning product, to influence product direction and deliver features to users, with clear focus on quality, reliability, and user experience. You will engage with internal users and external users (both from enterprise customers and the open-source community) to help them succeed with the product. You’ll influence and provide feedback on the organisational culture and processes, always looking for opportunities to improve in a continuous pursuit of excellence.","posted_date":"2024-11-05T08:16:00+0000","apply_url":"https://globalcareers-githubinc.icims.com/jobs/3568/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-11-05T08:22:05Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-11-05T08:16:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":3,"uuid":"c49fc643-c32e-491e-88f6-f21d69284214"},"import_id":"b51bda67-e553-4021-990f-4bae67ed1ec0","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/jobs/107230024142070470","jobHash":"5689a8170db912832e10444e7188b876","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":56.26392,"longitude":9.501785},"locationType":"COUNTRY","postalAddress":{"addressLines":["Denmark"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"DK","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.15325112935815313}]},"jobSummary":"In this role, you will join one of the distributed engineering teams responsible for building and expanding the core capabilities of code scanning with CodeQL and Copilot Autofix, in one of the following tracks: Code Analysis In this track, you will be part of a CodeQL language analysis team that maintains CodeQL support for multiple programming languages. You will help build source code extractors that parse and compile code written in each language, translating the source code into data that CodeQL can understand, and keeping up with the latest version of each supported language. You will write and maintain queries in the CodeQL query language that accurately detect security vulnerabilities and incorrect coding patterns, and ensure the quality of LLM-powered Copilot Autofix suggestions for fixing the alerts found. You will help build and maintain analysis libraries in the CodeQL query language that reason precisely about the semantics of programming languages, supporting the development of queries across all languages. CodeQL Foundations In this track, you will be part of the CodeQL Foundations team, and work primarily on QL, the query language powering CodeQL analysis, and its underlying query compiler and evaluator within the CodeQL CLI. You will expand the expressive power of the CodeQL query language and speed up the performance of the underlying query engine, empowering the other CodeQL teams to write high-quality analysis, and ensuring that CodeQL scales to the largest codebases in the world. CodeQL Experiences In this track, you will be part of the CodeQL Experiences team, and work primarily on the CodeQL CLI, the CodeQL Action, and LLM-powered Copilot Autofix capabilities. You will work on integrating CodeQL as a code scanning tool running in production in GitHub Actions, third-party CI systems, the command line, and the IDE. You will work on building, expanding, and robustly evaluating the Copilot Autofix engine, which uses LLMs and contextual information from code scanning alerts to produce AI-powered fix suggestions for those alerts. In any of the above tracks, you will work closely with various engineering teams, product managers, designers, and technical writers that build different aspects of the code scanning product, to influence product direction and deliver features to users, with clear focus on quality, reliability, and user experience. You will engage with internal users and external users (both from enterprise customers and the open-source community) to help them succeed with the product. You’ll influence and provide feedback on the organisational culture and processes, always looking for opportunities to improve in a continuous pursuit of excellence.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/3568?lang=en-us","last_mod":"2024-11-06T09:37:40+0000","gdpr":true},"update_date":"2024-11-06T09:37:40+0000","create_date":"2024-11-06T09:37:40+0000","category":[" Engineering"],"full_location":"Denmark","short_location":"Denmark","multipleLocations":false}},{"data":{"slug":"3372","language":"en-us","languages":["en-us"],"req_id":"3372","title":"Staff Networking Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview We’re looking for a Staff Network Engineer to join GitHub’s Network Engineering team. Our mission is to design, build, maintain, and scale GitHub’s peering, transport, exchange, and data center network infrastructure in a multi-site, on-premises data center environment, while also supporting our hybrid cloud efforts. As GitHub grows, our network engineers must work cross-functionally to support our ever-expanding compute footprint and rapid user growth. This critical infrastructure supports all GitHub products, teams, and users, making your role pivotal in ensuring its ongoing scalability and reliability. In this role, you will be responsible for providing technical leadership within our network engineering team and driving capabilities that serve our unique and complex platform. You will lead the team in building and enhancing the architecture, configuration, and software frameworks and tools that are used to manage and maintain our network infrastructure. You will assess capacity needs, predict growth trends, and plan for scalability. You will also handle internal/external support within your area of responsibility, drive network security and compliance, and lead efforts to monitor infrastructure proactively to identify and address potential issues. Furthermore, you will drive optimization efforts and lead initiatives aimed at enhancing system performance, reliability, and scalability. You must maintain advanced knowledge of the latest technologies and best practices in network engineering and be adept at diagnosing common and uncommon errors to develop or direct solutions. You will collaborate with software engineers and other infrastructure teams to troubleshoot issues and optimize network performance. Responsibilities Network Development and Management Lead the team in designing, building, maintaining, and scaling components of a large-scale, multi-site, heavily peered network. Assess network capacity needs, predict growth trends, and plan for scalability. Ensure sufficient resources are allocated, and that network equipment and services are properly scaled to handle increasing demands. Expand network platform offerings to meet business and developer needs. Availability and Performance Handle internal/external support for network engineering escalations. Participate in a 24x7 on-call rotation, respond to incidents, and collaborate with other teams to resolve reliability issues. Lead efforts to monitor infrastructure proactively to identify and address issues, including through instructional playbooks. Research and understand performance gaps or outages, using this knowledge to resolve issues. Identify and execute disaster recovery/failure test scenarios. Fundamentals Drive the security and compliance of the infrastructure. Collaborate with security teams to implement and maintain robust security measures, conduct vulnerability assessments, and adhere to relevant regulatory standards. Ensure timely upgrades to software and firmware used for infrastructure operation, as well as to software components in our management and automation toolchains. Drive incident management processes, provide incident reports, identify root causes, and implement preventive measures to avoid future incidents. Behavior Embody our values: better together, growth mindset, ship to learn, customer-obsessed, diverse \u0026 inclusive, and own the outcome. Embody our principles: create clarity, generate energy, and deliver success. Qualifications Required Qualifications: 9+ years of technical experience in network engineering, including architecture, network design, and product selection/hardware specifications. OR Bachelor's Degree in Computer Science, Information Technology, or a related field AND 7+ years of technical experience in network engineering OR equivalent experience 2+ years of technical leadership experience (Staff, Principal, or equivalent level) 2+ years of scripting experience in mainstream languages (Python, Bash, etc.) or frameworks (Ansible, Chef, Puppet, etc.) Preferred Qualifications: 4+ years of experience in one or more scripting languages (e.g., Bash, Python, or similar). 4+ years of experience using general-purpose programming languages (e.g., Go, Ruby, or similar). 5+ years of experience managing compute hardware in the context of datacenter deployments. 5+ years of experience with compute platforms and frameworks (Kubernetes, Virtualization platforms like VMware, libvirt/KVM), including service mesh and service discovery technologies (Istio, Consul, etc.). Compensation Range The base salary range for this job is USD $127,600.00 - USD $338,500.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 9+ years of technical experience in network engineering, including architecture, network design, and product selection/hardware specifications. OR Bachelor's Degree in Computer Science, Information Technology, or a related field AND 7+ years of technical experience in network engineering OR equivalent experience 2+ years of technical leadership experience (Staff, Principal, or equivalent level) 2+ years of scripting experience in mainstream languages (Python, Bash, etc.) or frameworks (Ansible, Chef, Puppet, etc.) Preferred Qualifications: 4+ years of experience in one or more scripting languages (e.g., Bash, Python, or similar). 4+ years of experience using general-purpose programming languages (e.g., Go, Ruby, or similar). 5+ years of experience managing compute hardware in the context of datacenter deployments. 5+ years of experience with compute platforms and frameworks (Kubernetes, Virtualization platforms like VMware, libvirt/KVM), including service mesh and service discovery technologies (Istio, Consul, etc.).","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Network Development and Management Lead the team in designing, building, maintaining, and scaling components of a large-scale, multi-site, heavily peered network. Assess network capacity needs, predict growth trends, and plan for scalability. Ensure sufficient resources are allocated, and that network equipment and services are properly scaled to handle increasing demands. Expand network platform offerings to meet business and developer needs. Availability and Performance Handle internal/external support for network engineering escalations. Participate in a 24x7 on-call rotation, respond to incidents, and collaborate with other teams to resolve reliability issues. Lead efforts to monitor infrastructure proactively to identify and address issues, including through instructional playbooks. Research and understand performance gaps or outages, using this knowledge to resolve issues. Identify and execute disaster recovery/failure test scenarios. Fundamentals Drive the security and compliance of the infrastructure. Collaborate with security teams to implement and maintain robust security measures, conduct vulnerability assessments, and adhere to relevant regulatory standards. Ensure timely upgrades to software and firmware used for infrastructure operation, as well as to software components in our management and automation toolchains. Drive incident management processes, provide incident reports, identify root causes, and implement preventive measures to avoid future incidents. Behavior Embody our values: better together, growth mindset, ship to learn, customer-obsessed, diverse \u0026 inclusive, and own the outcome. Embody our principles: create clarity, generate energy, and deliver success.","posted_date":"2024-10-07T19:33:00+0000","posting_expiry_date":"2024-11-30T06:00:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/3372/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/127026632350147270","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"84595524f454430193a3e809eba7afa9","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"Network Development and Management Lead the team in designing, building, maintaining, and scaling components of a large-scale, multi-site, heavily peered network. Assess network capacity needs, predict growth trends, and plan for scalability. Ensure sufficient resources are allocated, and that network equipment and services are properly scaled to handle increasing demands. Expand network platform offerings to meet business and developer needs. Availability and Performance Handle internal/external support for network engineering escalations. Participate in a 24x7 on-call rotation, respond to incidents, and collaborate with other teams to resolve reliability issues. Lead efforts to monitor infrastructure proactively to identify and address issues, including through instructional playbooks. Research and understand performance gaps or outages, using this knowledge to resolve issues. Identify and execute disaster recovery/failure test scenarios. Fundamentals Drive the security and compliance of the infrastructure. Collaborate with security teams to implement and maintain robust security measures, conduct vulnerability assessments, and adhere to relevant regulatory standards. Ensure timely upgrades to software and firmware used for infrastructure operation, as well as to software components in our management and automation toolchains. Drive incident management processes, provide incident reports, identify root causes, and implement preventive measures to avoid future incidents. Behavior Embody our values: better together, growth mindset, ship to learn, customer-obsessed, diverse \u0026 inclusive, and own the outcome. Embody our principles: create clarity, generate energy, and deliver success.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-10-30T14:04:04Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-10-07T19:33:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9","validThrough":"2024-11-30T06:00:00+0000"},"revision_int":6,"uuid":"b2b1c9c9-0e6a-4674-b45b-6cda7c1f756a"},"import_id":"48877814-32c3-4bcd-a1b6-5e8e04bcad04","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3372?lang=en-us","last_mod":"2024-10-30T14:04:33+0000","gdpr":false},"update_date":"2024-10-30T14:04:33+0000","create_date":"2024-10-16T20:53:51+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"3513","language":"en-us","languages":["en-us"],"req_id":"3513","title":"Staff Research Engineer, GitHub Next","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub has changed the way software is built, and we have a unique opportunity to look further ahead to identify how software development can be faster, safer, easier, and more accessible. We’re looking for talented, experienced polymaths to join us in this mission! This is the rare role that affords both startup-level agency and a larger company’s resources. GitHub Next has incubated genre-defining products like Copilot, Copilot Workspace, and more. You’ll work closely with a small group of experienced and talented researchers to explore the future of software development. Our team’s prototypes inform GitHub’s leadership and roadmap. Each exploration represents a risky bet that GitHub might want to make, and we have to support those bets with working prototypes. Please note that this is not an academic research role. Our job is to dream big about the future of software development — and then build it. Our team feels like a permanent startup: every time we succeed, we hand off our prototypes and return to the drawing board to do it all over again. You can see many of our projects at githubnext.com. Responsibilities Research Engineers build prototypes. Sometimes, we have an interesting technological idea but need to figure out how to turn it into a reliable product. Other times, we dream of an experience, but we’re not sure how to make that experience a reality. With few constraints on our solution space, our hardest task is figuring out how to scope our bets and deliver value. We will have more ideas than we can possibly pursue; choosing wisely is part of the job. The exploration domains are varied and will require an ability to understand, investigate, and implement prototypes across a wide range of technologies. Our team has a lot of different skills under one roof, and we work together in squads to identify and debate ideas, then execute everything needed for a working prototype. For this role, we are seeking an individual with exceptional frontend and design skills. Next’s prototypes grapple with difficult UX challenges in domains with little prior art to guide us. You may be a good fit if: You are a generalist with some areas of deeper knowledge. Hybrids will feel at home on this team. We will also consider candidates who have specialized in a relevant field. You are an effective and inclusive communicator, comfortable with remote communication practices. Next’s currency is ideas; the health of our team, our execution, and our results rests on our ability to communicate well. You are comfortable collaborating with teammates to figure out what work needs doing, then splitting up that work and doing it. Ideating alone is natural and common, but projects staffed by one individual don’t tend to survive. Your teammates are the first ones you must persuade with your ideas. You are comfortable reading source code. You are comfortable picking up new technology stacks in the normal course of work. This is a senior engineering role! While we do have some technologies that we generally like to use, we are not indexing on a specific stack. Experience is more than your ability to write code in language X or framework Y. Qualifications Required Qualifications: 9+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 8+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science or related field AND 7+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR equivalent experience. Experience creating rapid prototypes that demonstrate a concept to stakeholders and enable decision making Experience identifying and justifying research goals in situations of ambiguity and executing towards those goals without explicit direction Preferred Qualifications: These are more specific abilities we’re looking for, but it is the rare human who possesses them all. Think of this as a descriptive sketch, not a checklist of requirements. Be comfortable applying even if you don’t have all of them. A deep understanding of GitHub’s industry and business context and the ability to articulate topics related to our product and audience Has held roles that deal with topics at the boundary of human knowledge regarding software development and developers Have significant experience with one or more frontend technologies. We currently default to Typescript and React for the web, but we also have some efforts underway with Svelte and SvelteKit. “Whatever enables us to ship” is the top concern Have significant experience with machine learning, LLMs, and the rapidly-evolving landscape of techniques and tools used to build intelligence into products Have significant experience with one or more backend technologies: server-side environments, compute, datastores, networking, infrastructure, devops, security, and programming languages Have significant experience with open-source software, communities, and the systems these communities use to self-organize and ship software for others Have significant experience operating production systems at a nontrivial scale and are familiar with the common patterns and pitfalls of that work Have significant experience in another area of computing that is relevant to our mission. Human-computer interaction, distributed systems, $YOURTHING Compensation Range The base salary range for this job is USD $118,100.00 - USD $313,300.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 9+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 8+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science or related field AND 7+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR equivalent experience. Experience creating rapid prototypes that demonstrate a concept to stakeholders and enable decision making Experience identifying and justifying research goals in situations of ambiguity and executing towards those goals without explicit direction Preferred Qualifications: These are more specific abilities we’re looking for, but it is the rare human who possesses them all. Think of this as a descriptive sketch, not a checklist of requirements. Be comfortable applying even if you don’t have all of them. A deep understanding of GitHub’s industry and business context and the ability to articulate topics related to our product and audience Has held roles that deal with topics at the boundary of human knowledge regarding software development and developers Have significant experience with one or more frontend technologies. We currently default to Typescript and React for the web, but we also have some efforts underway with Svelte and SvelteKit. “Whatever enables us to ship” is the top concern Have significant experience with machine learning, LLMs, and the rapidly-evolving landscape of techniques and tools used to build intelligence into products Have significant experience with one or more backend technologies: server-side environments, compute, datastores, networking, infrastructure, devops, security, and programming languages Have significant experience with open-source software, communities, and the systems these communities use to self-organize and ship software for others Have significant experience operating production systems at a nontrivial scale and are familiar with the common patterns and pitfalls of that work Have significant experience in another area of computing that is relevant to our mission. Human-computer interaction, distributed systems, $YOURTHING","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Research Engineers build prototypes. Sometimes, we have an interesting technological idea but need to figure out how to turn it into a reliable product. Other times, we dream of an experience, but we’re not sure how to make that experience a reality. With few constraints on our solution space, our hardest task is figuring out how to scope our bets and deliver value. We will have more ideas than we can possibly pursue; choosing wisely is part of the job. The exploration domains are varied and will require an ability to understand, investigate, and implement prototypes across a wide range of technologies. Our team has a lot of different skills under one roof, and we work together in squads to identify and debate ideas, then execute everything needed for a working prototype. For this role, we are seeking an individual with exceptional frontend and design skills. Next’s prototypes grapple with difficult UX challenges in domains with little prior art to guide us. You may be a good fit if: You are a generalist with some areas of deeper knowledge. Hybrids will feel at home on this team. We will also consider candidates who have specialized in a relevant field. You are an effective and inclusive communicator, comfortable with remote communication practices. Next’s currency is ideas; the health of our team, our execution, and our results rests on our ability to communicate well. You are comfortable collaborating with teammates to figure out what work needs doing, then splitting up that work and doing it. Ideating alone is natural and common, but projects staffed by one individual don’t tend to survive. Your teammates are the first ones you must persuade with your ideas. You are comfortable reading source code. You are comfortable picking up new technology stacks in the normal course of work. This is a senior engineering role! While we do have some technologies that we generally like to use, we are not indexing on a specific stack. Experience is more than your ability to write code in language X or framework Y.","posted_date":"2024-09-27T21:14:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/3513/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/142007571425698502","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"f047e035e3cde70b2e90cbf195aa6dce","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"Research Engineers build prototypes. Sometimes, we have an interesting technological idea but need to figure out how to turn it into a reliable product. Other times, we dream of an experience, but we’re not sure how to make that experience a reality. With few constraints on our solution space, our hardest task is figuring out how to scope our bets and deliver value. We will have more ideas than we can possibly pursue; choosing wisely is part of the job. The exploration domains are varied and will require an ability to understand, investigate, and implement prototypes across a wide range of technologies. Our team has a lot of different skills under one roof, and we work together in squads to identify and debate ideas, then execute everything needed for a working prototype. For this role, we are seeking an individual with exceptional frontend and design skills. Next’s prototypes grapple with difficult UX challenges in domains with little prior art to guide us. You may be a good fit if: You are a generalist with some areas of deeper knowledge. Hybrids will feel at home on this team. We will also consider candidates who have specialized in a relevant field. You are an effective and inclusive communicator, comfortable with remote communication practices. Next’s currency is ideas; the health of our team, our execution, and our results rests on our ability to communicate well. You are comfortable collaborating with teammates to figure out what work needs doing, then splitting up that work and doing it. Ideating alone is natural and common, but projects staffed by one individual don’t tend to survive. Your teammates are the first ones you must persuade with your ideas. You are comfortable reading source code. You are comfortable picking up new technology stacks in the normal course of work. This is a senior engineering role! While we do have some technologies that we generally like to use, we are not indexing on a specific stack. Experience is more than your ability to write code in language X or framework Y.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-10-14T14:36:44Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-09-27T21:14:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9"},"revision_int":6,"uuid":"6cb1a55f-cb25-4320-86bb-26632f0a5afe"},"import_id":"365bad9c-a918-44ea-a2e7-caebfc9f0470","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3513?lang=en-us","last_mod":"2024-10-14T14:36:51+0000","gdpr":false},"update_date":"2024-10-14T14:36:51+0000","create_date":"2024-09-27T21:21:31+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"3319","language":"en-us","languages":["en-us"],"req_id":"3319","title":"Software Engineer II","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview As a software engineer at GitHub, you will enhance the collaboration experience at GitHub by working closely with a community of engineers and designers with a distributed, diverse and passionate team delivering the services that millions of developers depend on. In this role you will design, prototype, implement, ship and support highly performant and inspiring user experiences with your team. We are looking for creative problem solvers and diverse thinkers, people who care about culture as well as customers and features. We believe that how we do things is as important as what we do. Big vision, a common purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what lead to great results. Great products reflect the teams that build them. Responsibilities Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code. Qualifications Required Qualifications Experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, or related field OR equivalent experience. Preferred Qualifications Experience with Git and GitHub Experience using Azure technologies is a bonus Experience using front-end frameworks like React.js Understanding of REST principles and experience with backend APIs Strong written and verbal communication skill Passionate about healthy team culture and collaboration Comfortable working transparently in an agile environment and soliciting feedback from peers. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. Equal Employment Opportunity GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"United Kingdom Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications Experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, or related field OR equivalent experience. Preferred Qualifications Experience with Git and GitHub Experience using Azure technologies is a bonus Experience using front-end frameworks like React.js Understanding of REST principles and experience with backend APIs Strong written and verbal communication skill Passionate about healthy team culture and collaboration Comfortable working transparently in an agile environment and soliciting feedback from peers.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","posted_date":"2024-08-22T20:09:00+0000","apply_url":"https://globalcareers-githubinc.icims.com/jobs/3319/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/95830287585288902","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"62c1d0b6ff9786904f76655f4073d163","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-11-14T18:46:16Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-08-22T20:09:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":26,"uuid":"9262338a-1233-47f2-bed4-cc7f529e0e9c"},"import_id":"a8bb6c27-ca39-4a82-8e58-1607016c1151","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3319?lang=en-us","last_mod":"2024-11-14T18:46:53+0000","gdpr":true},"update_date":"2024-11-14T18:46:53+0000","create_date":"2024-11-06T09:37:32+0000","category":[" Engineering"],"full_location":"United Kingdom","short_location":"United Kingdom","multipleLocations":false}},{"data":{"slug":"3584","language":"en-us","languages":["en-us"],"req_id":"3584","title":"Senior Engineering Manager Mobile","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, Germany Overview GitHub is changing the way the world builds software, and we want you to help build GitHub. We're looking for an experienced software engineering manager to join a passionate, collaborative, distributed group of engineers on our team. The GitHub Mobile team is changing the way that developers across the world collaborate on GitHub through native Android and iOS apps. Launched in March 2020, GitHub Mobile is one of our fastest growing products. The mobile team is part of the Client Apps organization, working alongside the GitHub Desktop and GitHub CLI teams. This role will oversee one of our GitHub Mobile squads with Android, iOS, and server engineers located across Europe. You will partner closely with our other GitHub Mobile squad located in the United States. Stack: Our apps are built natively with Kotlin for Android and Swift for iOS. Our apps communicate with GitHub via GraphQL and REST APIs. Our team is distributed worldwide which means we work asynchronously most of the time. You will work with design, data, engineering and product management to understand the problems we want to solve, then work with engineers to solve them via GitHub, Slack and Zoom Responsibilities Cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and ensuring that individuals on the team are learning, growing, and advancing in their careers Meet with management and team members 1:1 on a regular basis Help the team ships products, features, and bug-fixes regularly and guide them toward building high quality software across multiple platforms Effectively communicate directions and decisions with the team and company Build alignment with engineering, design, and product leadership Guide the team toward building high quality software across multiple platforms Qualifications Required: Extensive experience of designing, developing, and shipping high-quality software at scale Current direct and/or indirect people management or leadership skills and experience of developing a strategic roadmap for your team Experience working asynchronously on a remote, distributed team Experience communicating with high-level stakeholders and executing large initiatives in an iterative fashion Preferred: Experience with Android and/or iOS Experience with Ruby on Rails Knowledge of testing, profiling, and debugging practices GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. Equal Employment Opportunity GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"Germany Remote","country":"Germany","country_code":"DE","location_type":"ANY","latitude":51.165691,"longitude":10.451526,"categories":[{"name":"Engineering"}],"tags2":["DE-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Senior Manager"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required: Extensive experience of designing, developing, and shipping high-quality software at scale Current direct and/or indirect people management or leadership skills and experience of developing a strategic roadmap for your team Experience working asynchronously on a remote, distributed team Experience communicating with high-level stakeholders and executing large initiatives in an iterative fashion Preferred: Experience with Android and/or iOS Experience with Ruby on Rails Knowledge of testing, profiling, and debugging practices","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and ensuring that individuals on the team are learning, growing, and advancing in their careers Meet with management and team members 1:1 on a regular basis Help the team ships products, features, and bug-fixes regularly and guide them toward building high quality software across multiple platforms Effectively communicate directions and decisions with the team and company Build alignment with engineering, design, and product leadership Guide the team toward building high quality software across multiple platforms","posted_date":"2024-10-29T13:45:00+0000","apply_url":"https://globalcareers-githubinc.icims.com/jobs/3584/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-10-29T13:51:49Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-10-29T13:45:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":3,"uuid":"d8243a3b-c5ea-4329-a9b8-13b97da65744"},"import_id":"b51bda67-e553-4021-990f-4bae67ed1ec0","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/jobs/79174997116887750","jobHash":"c768f82a1f3a32ecf37836b6903e7f5c","derivedInfo":{"jobCategories":["MANAGEMENT","COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":51.165691,"longitude":10.451526},"locationType":"COUNTRY","postalAddress":{"addressLines":["Germany"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"DE","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.21074204644792707}]},"jobSummary":"Cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and ensuring that individuals on the team are learning, growing, and advancing in their careers Meet with management and team members 1:1 on a regular basis Help the team ships products, features, and bug-fixes regularly and guide them toward building high quality software across multiple platforms Effectively communicate directions and decisions with the team and company Build alignment with engineering, design, and product leadership Guide the team toward building high quality software across multiple platforms","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/3584?lang=en-us","last_mod":"2024-11-06T09:37:40+0000","gdpr":true},"update_date":"2024-11-06T09:37:40+0000","create_date":"2024-11-06T09:37:40+0000","category":[" Engineering"],"full_location":"Germany","short_location":"Germany","multipleLocations":false}},{"data":{"slug":"3582","language":"en-us","languages":["en-us"],"req_id":"3582","title":"Staff Manager, Machine Learning (Copilot)","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview We are looking for a manager to lead our Model Development and Evaluation team within GitHub Copilot Applied Science, where you'll make a high-impact contribution to the capabilities and quality of GitHub Copilot. In this role, you'll manage a team of machine learning researchers and engineers to advance and produce state-of-the-art LLMs for code, working closely with engineering, product management, and leadership to drive innovation. You'll play a key role in shaping GitHub Copilot's future by improving AI-driven developer tools used by millions globally, directly influencing the product's features, performance, and user experience. This role requires a deep understanding of LLM model training and evaluation and a solid ability to lead cross-functional teams on complex technical projects. As part of GitHub, a company committed to empowering developers and fostering open-source innovation, you'll contribute to a culture of diversity, inclusion, and collaboration. Your work will help developers worldwide be more productive and creative, aligned with GitHub's mission to advance the software development community. You will report to the Director of Applied Science and collaborate across teams to ensure that research aligns with GitHub Copilot's broader product and company goals, with opportunities for career growth and leadership development in a flexible, distributed work environment. Responsibilities A day in the life: Our team and partners are distributed worldwide, working asynchronously and in real-time. Your typical week would include: Collaborate with engineering, product, stakeholders, and leadership to define and prioritize critical problems for GitHub Copilot, ensuring alignment on high-impact goals. Remove blockers for the team through real-time and asynchronous communication via Slack, Zoom, GitHub Issues, PRs, and Discussions. Guide the team's technical direction, selecting the best research opportunities, data curation approaches, and model evaluation strategies to drive innovation. Communicate progress, risks, and successes to stakeholders, ensuring consistent progress toward goals and managing high-impact outcomes. Lead cross-functional collaboration to improve workflows, foster alignment across teams, and ensure that advanced technologies are applied practically to meet business objectives. Conduct 1:1s with team members, providing regular feedback, identifying development opportunities, and supporting career growth through impactful projects and continuous learning. Drive informed, strategic decision-making, ensuring that the team's work contributes to the success of GitHub Copilot and aligns with broader organizational goals. Anticipate and address model challenges, providing proactive solutions to ensure machine learning models perform according to critical metrics and expected outcomes. Leverage and integrate existing research approaches to solve immediate product challenges and bring long-term AI innovations into production. Qualifications Required Qualifications 8+ years experience in software development, applied science, machine learning, or related field OR Bachelor's Degree in Computer Science, Software Development, Electrical or Computer Engineering, Mathematical Sciences, or related field AND 6+ years experience in software development, applied science, machine learning, or related field OR Master's Degree in Machine Learning, Computer Science, Software Development, Electrical or Computer Engineering, Mathematical Sciences, or related field AND 4+ years experience in software development, applied science, machine learning, or related field OR Doctorate in Machine Learning, Computer Science, Software Development, Electrical or Computer Engineering, Mathematical Sciences, or related field AND 2+ years experience in software development, applied science, machine learning, or related field OR equivalent experience. 1+ years people management experience 5+ years experience with machine learning models and experimentation 2+ years experience with cross-team project leadership Preferred Qualifications Master's Degree in Machine Learning, Computer Science, Software Development, Electrical or Computer Engineering, Mathematical Sciences, or related field AND 7+ years experience in software development, applied science, machine learning, or related field Experience recruiting and retaining healthy teams, managing performance, and calibrating expectations Experience working remotely and leading distributed teams Experience working with LLMs for code generation Compensation Range The base salary range for this job is USD $127,600.00 - USD $338,500.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Director"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications 8+ years experience in software development, applied science, machine learning, or related field OR Bachelor's Degree in Computer Science, Software Development, Electrical or Computer Engineering, Mathematical Sciences, or related field AND 6+ years experience in software development, applied science, machine learning, or related field OR Master's Degree in Machine Learning, Computer Science, Software Development, Electrical or Computer Engineering, Mathematical Sciences, or related field AND 4+ years experience in software development, applied science, machine learning, or related field OR Doctorate in Machine Learning, Computer Science, Software Development, Electrical or Computer Engineering, Mathematical Sciences, or related field AND 2+ years experience in software development, applied science, machine learning, or related field OR equivalent experience. 1+ years people management experience 5+ years experience with machine learning models and experimentation 2+ years experience with cross-team project leadership Preferred Qualifications Master's Degree in Machine Learning, Computer Science, Software Development, Electrical or Computer Engineering, Mathematical Sciences, or related field AND 7+ years experience in software development, applied science, machine learning, or related field Experience recruiting and retaining healthy teams, managing performance, and calibrating expectations Experience working remotely and leading distributed teams Experience working with LLMs for code generation","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"A day in the life: Our team and partners are distributed worldwide, working asynchronously and in real-time. Your typical week would include: Collaborate with engineering, product, stakeholders, and leadership to define and prioritize critical problems for GitHub Copilot, ensuring alignment on high-impact goals. Remove blockers for the team through real-time and asynchronous communication via Slack, Zoom, GitHub Issues, PRs, and Discussions. Guide the team's technical direction, selecting the best research opportunities, data curation approaches, and model evaluation strategies to drive innovation. Communicate progress, risks, and successes to stakeholders, ensuring consistent progress toward goals and managing high-impact outcomes. Lead cross-functional collaboration to improve workflows, foster alignment across teams, and ensure that advanced technologies are applied practically to meet business objectives. Conduct 1:1s with team members, providing regular feedback, identifying development opportunities, and supporting career growth through impactful projects and continuous learning. Drive informed, strategic decision-making, ensuring that the team's work contributes to the success of GitHub Copilot and aligns with broader organizational goals. Anticipate and address model challenges, providing proactive solutions to ensure machine learning models perform according to critical metrics and expected outcomes. Leverage and integrate existing research approaches to solve immediate product challenges and bring long-term AI innovations into production.","posted_date":"2024-10-22T14:43:00+0000","posting_expiry_date":"2024-11-30T06:00:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/3582/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/135195386342974150","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"893b9c1c62544981755b1eb6588c1ae5","derivedInfo":{"jobCategories":["MANAGEMENT","HUMAN_RESOURCES","EDUCATION"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"A day in the life: Our team and partners are distributed worldwide, working asynchronously and in real-time. Your typical week would include: Collaborate with engineering, product, stakeholders, and leadership to define and prioritize critical problems for GitHub Copilot, ensuring alignment on high-impact goals. Remove blockers for the team through real-time and asynchronous communication via Slack, Zoom, GitHub Issues, PRs, and Discussions. Guide the team's technical direction, selecting the best research opportunities, data curation approaches, and model evaluation strategies to drive innovation. Communicate progress, risks, and successes to stakeholders, ensuring consistent progress toward goals and managing high-impact outcomes. Lead cross-functional collaboration to improve workflows, foster alignment across teams, and ensure that advanced technologies are applied practically to meet business objectives. Conduct 1:1s with team members, providing regular feedback, identifying development opportunities, and supporting career growth through impactful projects and continuous learning. Drive informed, strategic decision-making, ensuring that the team's work contributes to the success of GitHub Copilot and aligns with broader organizational goals. Anticipate and address model challenges, providing proactive solutions to ensure machine learning models perform according to critical metrics and expected outcomes. Leverage and integrate existing research approaches to solve immediate product challenges and bring long-term AI innovations into production.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-11-20T22:01:13Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-10-22T14:43:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9","validThrough":"2024-11-30T06:00:00+0000"},"revision_int":4,"uuid":"42aa65bf-9d89-4ecd-97b6-d8995a7f39f9"},"import_id":"cb0b0894-83f8-4e41-9ed3-6f2c72d07d13","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3582?lang=en-us","last_mod":"2024-11-20T22:01:38+0000","gdpr":false},"update_date":"2024-11-20T22:01:38+0000","create_date":"2024-10-22T14:49:31+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"3244","language":"en-us","languages":["en-us"],"req_id":"3244","title":"Software Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview As a software engineer at GitHub, you will enhance the collaboration experience at GitHub by working closely with a community of engineers and designers with a distributed, diverse and passionate team delivering the services that millions of developers depend on. In this role you will design, prototype, implement, ship and support highly performant and inspiring user experiences with your team. We are looking for creative problem solvers and diverse thinkers, people who care about culture as well as customers and features. We believe that how we do things is as important as what we do. Big vision, a common purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what lead to great results. Great products reflect the teams that build them. Responsibilities Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Receive technical mentorship, collaborate and pair with others, provide code reviews, and communicate clearly to your leadership about progress, blockers, and gaps. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code. Qualifications Required Qualifications Experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, or related field OR equivalent experience. Preferred Qualifications Experience with Git and GitHub Experience using Azure technologies is a bonus Experience using front-end frameworks like React.js Understanding of REST principles and experience with backend APIs Strong written and verbal communication skill Passionate about healthy team culture and collaboration Comfortable working transparently in an agile environment and soliciting feedback from peers. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. Equal Employment Opportunity GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"United Kingdom Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications Experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, or related field OR equivalent experience. Preferred Qualifications Experience with Git and GitHub Experience using Azure technologies is a bonus Experience using front-end frameworks like React.js Understanding of REST principles and experience with backend APIs Strong written and verbal communication skill Passionate about healthy team culture and collaboration Comfortable working transparently in an agile environment and soliciting feedback from peers.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Receive technical mentorship, collaborate and pair with others, provide code reviews, and communicate clearly to your leadership about progress, blockers, and gaps. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","posted_date":"2024-08-07T21:15:00+0000","apply_url":"https://globalcareers-githubinc.icims.com/jobs/3244/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/104083221863375558","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"feeb4f60582b7c0b4816eb5eabd9a390","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Receive technical mentorship, collaborate and pair with others, provide code reviews, and communicate clearly to your leadership about progress, blockers, and gaps. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-11-20T19:37:26Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-08-07T21:15:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":39,"uuid":"de65e6d3-f918-423c-bcf8-f72761bd6815"},"import_id":"d600c7f2-2d19-422a-979e-658aee5c24e7","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3244?lang=en-us","last_mod":"2024-11-20T19:37:38+0000","gdpr":true},"update_date":"2024-11-20T19:37:38+0000","create_date":"2024-11-06T09:37:30+0000","category":[" Engineering"],"full_location":"United Kingdom","short_location":"United Kingdom","multipleLocations":false}},{"data":{"slug":"3569","language":"en-us","languages":["en-us"],"req_id":"3569","title":"Software Engineering Intern","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview As a software engineer intern at GitHub, you will enhance the collaboration experience at GitHub by working closely with a community of engineers and designers with a distributed, diverse and passionate team delivering the services that millions of developers depend on. Internships at GitHub aim to provide students with hands-on experience in developing fundamental skills while exploring potential career paths. We are looking for talented individuals to join us for an internship in 2025. In this role, you will design, develop and ship high-quality technical solutions that scale across multiple GitHub services. The GitHub culture promotes many opportunities for collaboration with peers as we all work “better together”. You’ll be assigned to one of our many fast-paced engineering teams to work on meaningful projects which support our business goals and mission. This is a remote summer internship for 12 consecutive weeks with start dates between May - June 2025 with an onsite week during the internship. Responsibilities Develop high-performance, reliable, testable and maintainable code. Participate in all aspects of software development activities, including design, coding, code review, testing, bug fixing, and code/API documentation. Collaborate with engineers and participate in daily or weekly stand ups and meetings. Work both independently and collaboratively within a fast-paced development team, with clear, positive, and constructive communication. Qualifications Required Qualifications: Currently in the process of obtaining a Bachelor’s degree or Master's Degree in Computer Science, Computer Engineering, Data Science, or similar field with an expected conferral date between December 2025 and August 2026. Available to work full time for a minimum of 12 weeks while not concurrently enrolled in coursework. Track record of working both independently and collaboratively Experience with two or more of the following skill sets: Ruby/Rails Go and related tooling Database Management Systems, preferably MySQL REST APIs React, Python or NodeJS Preferred Qualifications: Excellent communication skills, both written and verbal Experience with Git CLI, GitHub client or other version control platform for collaborative development Attention to detail with good organizational and planning skills Compensation Range The base salary range for this job is USD $32.16 - USD $85.38 /Hr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Intern"],"tags5":["Intern"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications: Currently in the process of obtaining a Bachelor’s degree or Master's Degree in Computer Science, Computer Engineering, Data Science, or similar field with an expected conferral date between December 2025 and August 2026. Available to work full time for a minimum of 12 weeks while not concurrently enrolled in coursework. Track record of working both independently and collaboratively Experience with two or more of the following skill sets: Ruby/Rails Go and related tooling Database Management Systems, preferably MySQL REST APIs React, Python or NodeJS Preferred Qualifications: Excellent communication skills, both written and verbal Experience with Git CLI, GitHub client or other version control platform for collaborative development Attention to detail with good organizational and planning skills","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Develop high-performance, reliable, testable and maintainable code. Participate in all aspects of software development activities, including design, coding, code review, testing, bug fixing, and code/API documentation. Collaborate with engineers and participate in daily or weekly stand ups and meetings. Work both independently and collaboratively within a fast-paced development team, with clear, positive, and constructive communication.","posted_date":"2024-11-06T19:40:00+0000","posting_expiry_date":"2025-01-04T04:55:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/3569/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-11-06T17:13:27Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-11-06T19:40:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9","validThrough":"2025-01-04T04:55:00+0000"},"revision_int":1,"uuid":"e227058e-0dee-48b4-974d-52fa30843288"},"import_id":"b69d7529-3f69-45b4-885a-ac954037fa07","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/jobs/93462334676050630","jobHash":"bacd68b9d2535558943564987629033d","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"Develop high-performance, reliable, testable and maintainable code. Participate in all aspects of software development activities, including design, coding, code review, testing, bug fixing, and code/API documentation. Collaborate with engineers and participate in daily or weekly stand ups and meetings. Work both independently and collaboratively within a fast-paced development team, with clear, positive, and constructive communication.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/3569?lang=en-us","last_mod":"2024-11-06T19:40:29+0000","gdpr":false},"update_date":"2024-11-06T19:40:29+0000","create_date":"2024-11-06T19:40:29+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}}],"locations":[],"totalCount":20,"request_id":false,"count":20,"languageCounts":{"en-us":{"displayName":"English","count":20}},"filter":{"facetList":{"tags4":[{"term":"Experienced Professional","count":19},{"term":"Intern","count":1}],"tags5":[{"term":"Individual Contributor","count":15},{"term":"Director","count":2},{"term":"Senior Manager","count":2},{"term":"Intern","count":1}],"tags6":[{"term":"Yes","count":20}]},"displayLimit":10,"brands":{"all":[],"shortlist":[]},"categories":{"all":[{"category":"Engineering","numJobs":20}],"shortlist":[{"category":"Engineering","numJobs":20}]},"locations":{"all":[{"city":null,"state":null,"country":"Denmark","count":1},{"city":null,"state":null,"country":"Germany","count":1},{"city":null,"state":null,"country":"Japan","count":1},{"city":null,"state":null,"country":"United Kingdom","count":6},{"city":null,"state":null,"country":"United States","count":11}],"shortlist":[{"city":null,"state":null,"country":"Denmark","count":1},{"city":null,"state":null,"country":"Germany","count":1},{"city":null,"state":null,"country":"Japan","count":1},{"city":null,"state":null,"country":"United Kingdom","count":6},{"city":null,"state":null,"country":"United States","count":11}]},"experienceLevels":{"all":[],"shortlist":[]}}}