{"jobs":[{"data":{"slug":"3827","language":"en-us","languages":["en-us"],"req_id":"3827","title":"Principal Software Engineer, Copilot Experiences","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview We’re looking for an experienced Principal Software Engineer to lead cross-functional AI innovation and deliver high-impact contributions to the capabilities and quality of Copilot experiences. In this role, you'll be responsible for driving AI innovation, working closely with engineering, product management, design, and leadership to drive innovation. You'll play a key role in shaping the future of Copilot experiences by improving AI-driven developer tools used by millions globally, directly influencing the product's features, performance, and user experience. This role requires a deep understanding of LLM retrieval augmented generation (RAG), prompt engineering and evaluation, development of end-to-end AI features using cutting-edge technologies, and a solid ability to lead cross-functional teams on complex technical projects. If you have a foundation in AI and machine learning, a deep skillset in shipping software at scale, and an empathetic approach to mentoring and collaborating with a diverse team then this might be the role for you. Responsibilities Guide organizational AI technical direction (~80 engineers) for Copilot experiences, driving innovation through engineering mentorship. Leverage and integrate existing AI research approaches to solve immediate product challenges and bring long-term AI innovations into production. Lead cross-functional collaboration to ensure that advanced technologies are applied practically to meet business objectives. Collaborate with engineering, product, stakeholders, and leadership to drive informed, strategic decision-making, ensuring that the org's work contributes to the success of Copilot experiences and aligns with broader organizational goals. Communicate progress, risks, and successes to stakeholders, ensuring consistent progress toward goals and managing high-impact outcomes. May include technical leadership in scaling software and cloud architecture. Communicate effectively with a wide range of stakeholders including executives, cross-functional partners, and early in career engineers. Qualifications Required Qualifications: 11+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, JavaScript, C#, Rust, Python, Java, C or C++ OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 10+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science or related field AND 9+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 7+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR equivalent experience. 4+ years experience delivering highly available enterprise grade services, including monitoring, observability and diagnosing problems. 2+ years building and maintaining AI applications in production. Preferred Qualifications: Experience with building Ruby, Go, and JavaScript applications in production at scale. Experience in LLM retrieval augmented generation (RAG), prompt engineering, online and offline evaluation. Experience in search at scale, search index internals, and information retrieval. Experience in cloud-native development, including designing, building, and deploying scalable applications using microservices architecture, containers (e.g., Docker), and orchestration tools like Kubernetes. Proficiency in leveraging cloud platforms (e.g., AWS, Azure, or GCP) for optimizing application performance and scalability. Experience with Azure. A passion for fostering good engineering practices, tools, and processes and experience with and passion for mentoring engineers. Excellent analytical skills as well as communication skills both verbal and written. We’re a distributed team so we’re extra mindful about communication. Other Qualifications: Ability to meet GitHub, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft, GitHub’s parent company, Cloud Screen upon hire/transfer and every two years thereafter. Compensation Range The base salary range for this job is USD $145,600.00 - USD $386,400.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 11+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, JavaScript, C#, Rust, Python, Java, C or C++ OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 10+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science or related field AND 9+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 7+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR equivalent experience. 4+ years experience delivering highly available enterprise grade services, including monitoring, observability and diagnosing problems. 2+ years building and maintaining AI applications in production. Preferred Qualifications: Experience with building Ruby, Go, and JavaScript applications in production at scale. Experience in LLM retrieval augmented generation (RAG), prompt engineering, online and offline evaluation. Experience in search at scale, search index internals, and information retrieval. Experience in cloud-native development, including designing, building, and deploying scalable applications using microservices architecture, containers (e.g., Docker), and orchestration tools like Kubernetes. Proficiency in leveraging cloud platforms (e.g., AWS, Azure, or GCP) for optimizing application performance and scalability. Experience with Azure. A passion for fostering good engineering practices, tools, and processes and experience with and passion for mentoring engineers. Excellent analytical skills as well as communication skills both verbal and written. We’re a distributed team so we’re extra mindful about communication. Other Qualifications: Ability to meet GitHub, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft, GitHub’s parent company, Cloud Screen upon hire/transfer and every two years thereafter.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Guide organizational AI technical direction (~80 engineers) for Copilot experiences, driving innovation through engineering mentorship. Leverage and integrate existing AI research approaches to solve immediate product challenges and bring long-term AI innovations into production. Lead cross-functional collaboration to ensure that advanced technologies are applied practically to meet business objectives. Collaborate with engineering, product, stakeholders, and leadership to drive informed, strategic decision-making, ensuring that the org's work contributes to the success of Copilot experiences and aligns with broader organizational goals. Communicate progress, risks, and successes to stakeholders, ensuring consistent progress toward goals and managing high-impact outcomes. May include technical leadership in scaling software and cloud architecture. Communicate effectively with a wide range of stakeholders including executives, cross-functional partners, and early in career engineers.","posted_date":"2024-12-06T18:14:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/3827/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/115347039197242054","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"889da6fff462adaaf4bb74360a08a183","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"Guide organizational AI technical direction (~80 engineers) for Copilot experiences, driving innovation through engineering mentorship. Leverage and integrate existing AI research approaches to solve immediate product challenges and bring long-term AI innovations into production. Lead cross-functional collaboration to ensure that advanced technologies are applied practically to meet business objectives. Collaborate with engineering, product, stakeholders, and leadership to drive informed, strategic decision-making, ensuring that the org's work contributes to the success of Copilot experiences and aligns with broader organizational goals. Communicate progress, risks, and successes to stakeholders, ensuring consistent progress toward goals and managing high-impact outcomes. May include technical leadership in scaling software and cloud architecture. Communicate effectively with a wide range of stakeholders including executives, cross-functional partners, and early in career engineers.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2025-03-28T17:22:25Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-12-06T18:14:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9"},"revision_int":14,"uuid":"bf6fdb9e-6cf1-49c2-9dc4-52392d64a7ce"},"import_id":"2be227b5-0a12-4118-8fbe-7353bd50ce5a","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3827?lang=en-us","last_mod":"2025-03-28T17:23:27+0000","gdpr":false},"update_date":"2025-03-28T17:23:27+0000","create_date":"2025-03-17T20:19:56+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"4084","language":"en-us","languages":["en-us"],"req_id":"4084","title":"Staff Engineering Manager, Edge Traffic","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is seeking a Staff Software Engineering Manager to join our Platform organization to lead our Edge Traffic engineering team! GitHub is a company at the center of software, where projects are developed, orchestrated, and deployed. GitHub’s platform is critical to our customers in the way the power grid is critical to the manufacturing industry. Our customers depend on GitHub as a central workspace where they develop solutions for their own customers. The reward for this important role is a unique impact on creativity within the software development universe. With it comes the responsibility to view ourselves as the world’s production environment. One that needs to be as reliable as the power grid. GitHub’s Traffic team is responsible for every packet into and out of GitHub’s edge, and delivers a foundational load balancing platform for all of its services. As Staff Engineering Manager, you will lead a team of engineers to deliver highly-available, highly-scalable core infrastructure that we use to build GitHub itself. You will work across Engineering, Product, and Customer functions to ensure our Traffic platform meets the needs of GitHub’s customers and developers, ensuring our continued success as a global product. Our group is highly distributed and the right candidate will thrive in an environment of asynchronous communication. We expect you to have excellent written communication skills and be able to create working relationships with coworkers in locations around the globe. Responsibilities Evolve GitHub’s global load balancing platform across our presence in Microsoft Azure and our physical data centers. Oversee and guide a distributed team, taking accountability for the team’s vision, best practices, and priorities. Provide clarity and a shared understanding of decision making, direction, and progress for the team and the company. Provide career development plans, coaching, and guided performance feedback to your team’s engineers. Drive incident response, operational excellence, and facilitate blameless postmortems. Plan and execute complex technical projects, coordinating work with engineering teams across the stack. Qualifications Required Qualifications 9+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 8+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science or related field AND 7+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR equivalent experience. 4+ years experience building, scaling and maintaining global edge technologies, such as load balancers, API gateways, and/or CDNs. 3+ years people management experience Preferred Qualifications Passionate about resilient, reliable, and high performance infrastructure. Energized by creating and growing exceptional teams through strong engineering practices and processes. Consistent focus on customer needs and data-informed decision making. Pragmatic focus on delivering incremental, continuous value toward long-running objectives. Experience with cloud platforms, such as Microsoft Azure or Amazon Web Services Excellent analytical skills when proactively identifying risks and balancing priorities. Compensation Range The base salary range for this job is USD $127,600.00 - USD $338,500.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Director"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications 9+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 8+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science or related field AND 7+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR equivalent experience. 4+ years experience building, scaling and maintaining global edge technologies, such as load balancers, API gateways, and/or CDNs. 3+ years people management experience Preferred Qualifications Passionate about resilient, reliable, and high performance infrastructure. Energized by creating and growing exceptional teams through strong engineering practices and processes. Consistent focus on customer needs and data-informed decision making. Pragmatic focus on delivering incremental, continuous value toward long-running objectives. Experience with cloud platforms, such as Microsoft Azure or Amazon Web Services Excellent analytical skills when proactively identifying risks and balancing priorities.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Evolve GitHub’s global load balancing platform across our presence in Microsoft Azure and our physical data centers. Oversee and guide a distributed team, taking accountability for the team’s vision, best practices, and priorities. Provide clarity and a shared understanding of decision making, direction, and progress for the team and the company. Provide career development plans, coaching, and guided performance feedback to your team’s engineers. Drive incident response, operational excellence, and facilitate blameless postmortems. Plan and execute complex technical projects, coordinating work with engineering teams across the stack.","posted_date":"2025-03-27T16:38:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/4084/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/96951797079253702","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"ccc727595262916de8edce31e24afbf3","derivedInfo":{"jobCategories":["SCIENCE_AND_ENGINEERING","MANAGEMENT","COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"Evolve GitHub’s global load balancing platform across our presence in Microsoft Azure and our physical data centers. Oversee and guide a distributed team, taking accountability for the team’s vision, best practices, and priorities. Provide clarity and a shared understanding of decision making, direction, and progress for the team and the company. Provide career development plans, coaching, and guided performance feedback to your team’s engineers. Drive incident response, operational excellence, and facilitate blameless postmortems. Plan and execute complex technical projects, coordinating work with engineering teams across the stack.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2025-04-24T15:00:00Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2025-03-27T16:38:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9"},"revision_int":9,"uuid":"9ad008ed-8207-4f04-bbf6-8c69ecc981cd"},"import_id":"ecc17169-429d-4e3f-814c-ae8cf7b15e7a","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/4084?lang=en-us","last_mod":"2025-04-24T15:00:37+0000","gdpr":false},"update_date":"2025-04-24T15:00:37+0000","create_date":"2025-03-27T16:40:22+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"4137","language":"en-us","languages":["en-us"],"req_id":"4137","title":"Software Engineer II","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, Canada Overview GitHub is the home for software development, where we collaborate to build the world's leading AI-powered developer platform. In the GitHub code scanning team, we are passionate about ensuring the security and quality of the world’s software - from open source to the enterprise. We believe that the best way to secure and improve the quality of software is to detect actionable issues early in the development process, and actively facilitate their remediation as part of the developer workflow. Our team develops CodeQL and Copilot Autofix, detection and remediation capabilities that power the GitHub code scanning product, used by hundreds of thousands of developers and projects every day as part of GitHub's Advanced Security and Code Security offerings. CodeQL is GitHub's own semantic code analysis engine that uses world-class static analysis research and technology to deeply analyze code, enabling the early detection of security vulnerabilities and correctness errors in software. CodeQL supports a wide range of programming languages, including C/C++, C#, Go, Java, JavaScript/TypeScript, Kotlin, Python, Ruby, and Swift. Copilot Autofix is our LLM-powered remediation system that produces high-quality fix suggestions for code scanning alerts, empowering developers to fix alerts as soon as they are found or that already exist in their codebase. Responsibilities In this role, you will join one of the distributed engineering teams responsible for building and expanding the core capabilities of code scanning with CodeQL and Copilot Autofix, in one of the following tracks: Code analysis: Maintaining support for multiple programming languages, including: building source code extractors that translate code written in each language into data that CodeQL can understand, keeping up with the latest version of each supported language writing and maintaining queries in the CodeQL query language that accurately detect security vulnerabilities and undesirable coding patterns ensuring the quality of LLM-powered Copilot Autofix suggestions for fixing the alerts found building analysis libraries in the CodeQL query language that reason precisely about the semantics of programming languages, supporting the development of queries across all languages experimenting with and robustly evaluating LLM-powered detection engines and integration between LLMs and traditional static analysis. AI engines: Building, expanding, and robustly evaluating LLM-based engines for remediation and detection. These power Copilot code review, which produces comment suggestions for quality issues in a codebase, and Copilot Autofix, which produces fix suggestions for code scanning alerts and Copilot code review findings. Engine quality: Developing and integrating CodeQL as a code scanning tool running in production in GitHub Actions, third-party CI systems, the command line, and the IDE; and building systems that evaluate the quality of CodeQL and LLM-based engines at large scale over thousands of codebases. In any of the above tracks, you will work closely with various engineering teams, product managers, designers, and technical writers that build different aspects of the code scanning product, to influence product direction and deliver features to users, with clear focus on quality, reliability, and user experience. You will engage with internal users and external users (both from enterprise customers and the open-source community) to help them succeed with the product. You’ll influence and provide feedback on the organizational culture and processes, always looking for opportunities to improve in a continuous pursuit of excellence. Qualifications Required Qualifications: For this role, we’re looking for a software engineer with: 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 1+ year(s) experience OR Bachelor's Degree in Computer Science or related field OR equivalent experience. 1+ years of experience with one or more of the following areas: Software security, including static analysis, dynamic analysis, software supply chain security, and best practices in creating high-quality, secure code Experience building developer tools that operate on source code, such as compilers, parsers, linters, static analyzers, debuggers, CLI tools, or IDE extensions Machine learning applied to understanding source code, specifically using prompt engineering with large language models (LLMs) and systematic data collection and result evaluation Preferred Qualifications: Additionally, we would highly encourage applying if you have one or more of the following skills: The interest and ability to learn additional programming languages as required Ability to work with multiple stakeholders and teams across engineering, product, and design Excellent verbal and written communication skills Experience working in a distributed team, operating effectively across multiple time zones (our teams span a wide time zone range from Pacific time to Central European time) Passion for fostering good engineering practices, tools, and processes Knowledge of compilers, program analysis, programming language design and implementation Knowledge of logic programming or database query languages (e.g. SQL, Prolog, Datalog, Kusto Query Language) Building integrations with CI/CD systems, such as GitHub Actions or Jenkins GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. Equal Employment Opportunity GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"Canada Remote","country":"Canada","country_code":"CA","location_type":"ANY","latitude":56.130366,"longitude":-106.346771,"categories":[{"name":"Engineering"}],"tags2":["CA-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: For this role, we’re looking for a software engineer with: 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 1+ year(s) experience OR Bachelor's Degree in Computer Science or related field OR equivalent experience. 1+ years of experience with one or more of the following areas: Software security, including static analysis, dynamic analysis, software supply chain security, and best practices in creating high-quality, secure code Experience building developer tools that operate on source code, such as compilers, parsers, linters, static analyzers, debuggers, CLI tools, or IDE extensions Machine learning applied to understanding source code, specifically using prompt engineering with large language models (LLMs) and systematic data collection and result evaluation Preferred Qualifications: Additionally, we would highly encourage applying if you have one or more of the following skills: The interest and ability to learn additional programming languages as required Ability to work with multiple stakeholders and teams across engineering, product, and design Excellent verbal and written communication skills Experience working in a distributed team, operating effectively across multiple time zones (our teams span a wide time zone range from Pacific time to Central European time) Passion for fostering good engineering practices, tools, and processes Knowledge of compilers, program analysis, programming language design and implementation Knowledge of logic programming or database query languages (e.g. SQL, Prolog, Datalog, Kusto Query Language) Building integrations with CI/CD systems, such as GitHub Actions or Jenkins","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"In this role, you will join one of the distributed engineering teams responsible for building and expanding the core capabilities of code scanning with CodeQL and Copilot Autofix, in one of the following tracks: Code analysis: Maintaining support for multiple programming languages, including: building source code extractors that translate code written in each language into data that CodeQL can understand, keeping up with the latest version of each supported language writing and maintaining queries in the CodeQL query language that accurately detect security vulnerabilities and undesirable coding patterns ensuring the quality of LLM-powered Copilot Autofix suggestions for fixing the alerts found building analysis libraries in the CodeQL query language that reason precisely about the semantics of programming languages, supporting the development of queries across all languages experimenting with and robustly evaluating LLM-powered detection engines and integration between LLMs and traditional static analysis. AI engines: Building, expanding, and robustly evaluating LLM-based engines for remediation and detection. These power Copilot code review, which produces comment suggestions for quality issues in a codebase, and Copilot Autofix, which produces fix suggestions for code scanning alerts and Copilot code review findings. Engine quality: Developing and integrating CodeQL as a code scanning tool running in production in GitHub Actions, third-party CI systems, the command line, and the IDE; and building systems that evaluate the quality of CodeQL and LLM-based engines at large scale over thousands of codebases. In any of the above tracks, you will work closely with various engineering teams, product managers, designers, and technical writers that build different aspects of the code scanning product, to influence product direction and deliver features to users, with clear focus on quality, reliability, and user experience. You will engage with internal users and external users (both from enterprise customers and the open-source community) to help them succeed with the product. You’ll influence and provide feedback on the organizational culture and processes, always looking for opportunities to improve in a continuous pursuit of excellence.","posted_date":"2025-04-11T18:01:00+0000","apply_url":"https://globalcareers-githubinc.icims.com/jobs/4137/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2025-04-11T18:01:26Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2025-04-11T18:01:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":1,"uuid":"302a5f39-302d-4247-885b-11348ef5192c"},"import_id":"ac5ca3dd-123d-4938-a0fb-a506005a5ff2","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/jobs/111502730605798086","jobHash":"484a90ba629f90e9f345b4798495d405","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":56.130366,"longitude":-106.346771},"locationType":"COUNTRY","postalAddress":{"addressLines":["Canada"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"CA","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":1.1860032897866954}]},"jobSummary":"In this role, you will join one of the distributed engineering teams responsible for building and expanding the core capabilities of code scanning with CodeQL and Copilot Autofix, in one of the following tracks: Code analysis: Maintaining support for multiple programming languages, including: building source code extractors that translate code written in each language into data that CodeQL can understand, keeping up with the latest version of each supported language writing and maintaining queries in the CodeQL query language that accurately detect security vulnerabilities and undesirable coding patterns ensuring the quality of LLM-powered Copilot Autofix suggestions for fixing the alerts found building analysis libraries in the CodeQL query language that reason precisely about the semantics of programming languages, supporting the development of queries across all languages experimenting with and robustly evaluating LLM-powered detection engines and integration between LLMs and traditional static analysis. AI engines: Building, expanding, and robustly evaluating LLM-based engines for remediation and detection. These power Copilot code review, which produces comment suggestions for quality issues in a codebase, and Copilot Autofix, which produces fix suggestions for code scanning alerts and Copilot code review findings. Engine quality: Developing and integrating CodeQL as a code scanning tool running in production in GitHub Actions, third-party CI systems, the command line, and the IDE; and building systems that evaluate the quality of CodeQL and LLM-based engines at large scale over thousands of codebases. In any of the above tracks, you will work closely with various engineering teams, product managers, designers, and technical writers that build different aspects of the code scanning product, to influence product direction and deliver features to users, with clear focus on quality, reliability, and user experience. You will engage with internal users and external users (both from enterprise customers and the open-source community) to help them succeed with the product. You’ll influence and provide feedback on the organizational culture and processes, always looking for opportunities to improve in a continuous pursuit of excellence.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/4137?lang=en-us","last_mod":"2025-04-11T18:02:01+0000","gdpr":false},"update_date":"2025-04-11T18:02:01+0000","create_date":"2025-04-11T18:02:01+0000","category":[" Engineering"],"full_location":"Canada","short_location":"Canada","multipleLocations":false}},{"data":{"slug":"4145","language":"en-us","languages":["en-us"],"req_id":"4145","title":"Sr. Mgr, Software Engineering","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview We’re looking for a Senior Software Engineering Manager to help build foundational components of the Copilot Platform. This is an exciting role in a fast paced environment with high impact. A manager working on this team needs to have a strong balance of people, technical, and project management skills - flexing their skill sets to empower the team to create innovative solutions in the AI space. Responsibilities A day in the life: Our team is distributed worldwide which means we work both asynchronously and real-time. Your typical week would include: Collaborating with internal and external engineering teams, product management, platform customers, and engineering leadership to align on and understand the problems we want to solve Unblocking obstacles for your team members as they solve GitHub’s most critical problems, often via real-time conversations in Slack or Zoom, and with asynchronous communication in GitHub Issues, PRs, Discussions, and Projects to efficiently collaborate with teams in disparate timezones Communicating effectively to support internal users, and inform stakeholders of progress as well as system status and team health Conducting 1:1s with direct reports to provide regular feedback and ensure career growth and progression, coordinating work within the team and stakeholders, building relationships, and identifying opportunities and areas of improvement Ensuring the team produces good architectural design outcomes, resilient systems, and high quality code Ensuring the team iteratively ships features and bug fixes; balancing speed to market with future velocity Leveraging state of the art AI tooling to maximize productivity for yourself and your direct reports Qualifications Required qualifications 6+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field. OR equivalent experience. 1+ year(s) direct and/or indirect people management or leadership experience. 1+ year(s) experience developing a strategy and roadmap in partnership with your team and stakeholders. 1+ year)s) experience communicating with high-level stakeholders and executing large initiatives in an iterative fashion Preferred qualifications Excellent written and verbal communication skills Passionate about fostering good engineering practices and processes Experience managing platform teams Experience with delivering products in the artificial intelligence space Experience working with research or applied scientists GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. Equal Employment Opportunity GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"United Kingdom Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Senior Manager"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required qualifications 6+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field. OR equivalent experience. 1+ year(s) direct and/or indirect people management or leadership experience. 1+ year(s) experience developing a strategy and roadmap in partnership with your team and stakeholders. 1+ year)s) experience communicating with high-level stakeholders and executing large initiatives in an iterative fashion Preferred qualifications Excellent written and verbal communication skills Passionate about fostering good engineering practices and processes Experience managing platform teams Experience with delivering products in the artificial intelligence space Experience working with research or applied scientists","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"A day in the life: Our team is distributed worldwide which means we work both asynchronously and real-time. Your typical week would include: Collaborating with internal and external engineering teams, product management, platform customers, and engineering leadership to align on and understand the problems we want to solve Unblocking obstacles for your team members as they solve GitHub’s most critical problems, often via real-time conversations in Slack or Zoom, and with asynchronous communication in GitHub Issues, PRs, Discussions, and Projects to efficiently collaborate with teams in disparate timezones Communicating effectively to support internal users, and inform stakeholders of progress as well as system status and team health Conducting 1:1s with direct reports to provide regular feedback and ensure career growth and progression, coordinating work within the team and stakeholders, building relationships, and identifying opportunities and areas of improvement Ensuring the team produces good architectural design outcomes, resilient systems, and high quality code Ensuring the team iteratively ships features and bug fixes; balancing speed to market with future velocity Leveraging state of the art AI tooling to maximize productivity for yourself and your direct reports","posted_date":"2025-04-21T17:28:00+0000","apply_url":"https://globalcareers-githubinc.icims.com/jobs/4145/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2025-04-21T20:24:06Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2025-04-21T17:28:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":1,"uuid":"2c7c9a01-9b49-49a3-acc7-ec365df600d2"},"import_id":"47e05a4b-3815-457b-adbf-51951c00ec37","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/jobs/128549097710723782","jobHash":"4668836c98a8d58d176de1a0c5f021bd","derivedInfo":{"jobCategories":["COMPUTER_AND_IT","MANAGEMENT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"A day in the life: Our team is distributed worldwide which means we work both asynchronously and real-time. Your typical week would include: Collaborating with internal and external engineering teams, product management, platform customers, and engineering leadership to align on and understand the problems we want to solve Unblocking obstacles for your team members as they solve GitHub’s most critical problems, often via real-time conversations in Slack or Zoom, and with asynchronous communication in GitHub Issues, PRs, Discussions, and Projects to efficiently collaborate with teams in disparate timezones Communicating effectively to support internal users, and inform stakeholders of progress as well as system status and team health Conducting 1:1s with direct reports to provide regular feedback and ensure career growth and progression, coordinating work within the team and stakeholders, building relationships, and identifying opportunities and areas of improvement Ensuring the team produces good architectural design outcomes, resilient systems, and high quality code Ensuring the team iteratively ships features and bug fixes; balancing speed to market with future velocity Leveraging state of the art AI tooling to maximize productivity for yourself and your direct reports","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/4145?lang=en-us","last_mod":"2025-04-21T20:24:37+0000","gdpr":true},"update_date":"2025-04-21T20:24:37+0000","create_date":"2025-04-21T20:24:37+0000","category":[" Engineering"],"full_location":"United Kingdom","short_location":"United Kingdom","multipleLocations":false}},{"data":{"slug":"3856","language":"en-us","languages":["en-us"],"req_id":"3856","title":"Software Engineer III, Codespaces \u0026 Copilot Workspace","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, Germany Overview We’re building the future of cloud development with Codespaces: instant-on, container-based cloud environments tailored to specific projects, enabling developers to focus on writing code rather than managing setups. As a Software Engineer III on the compute team, you’ll design and implement a secure, reliable, and efficient platform that powers Codespaces, Copilot Workspace, and our LLM-based tooling. Your work will directly impact developers worldwide, ensuring these tools are always available, performant, cost-effective, and delightful to use. At GitHub, you’ll collaborate with a distributed, diverse, and passionate team of engineers and designers, delivering services that millions of developers depend on daily. In this role, you’ll design, prototype, implement, ship, and support highly performant, inspiring experiences that enhance collaboration and productivity for developers everywhere. We’re looking for creative problem solvers and diverse thinkers who value culture as much as customers and features. We believe how we work is just as important as what we deliver. Big vision, shared purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what drive great results. Great products reflect the teams that build them—come join us! Responsibilities Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary. Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code. Qualifications Required Qualifications: Experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR equivalent experience. Experience in cloud-native development, including designing, building, and deploying scalable applications using microservices architecture, containers (e.g., Docker), and orchestration tools like Kubernetes. Proficiency in leveraging cloud platforms (e.g., AWS, Azure, or GCP) for optimizing application performance and scalability. Experience with on-call rotations, incident response and site reliability, including diagnosing and resolving complex production issues under pressure. Experience implementing and maintaining compliance and security practices in software development, including secure coding, vulnerability management, data privacy, and regulatory standards (e.g., GDPR, SOC 2, HIPAA). Proficiency in designing systems with robust security measures and ensuring adherence to organizational and industry compliance requirements. Preferred Qualifications: Proficiency in modern programming languages such as C#, TypeScript, Go, and Rust. Excellent written and verbal communication via async collaboration, documentation, and visibility of work. Experience working with a remote, distributed team. Passionate about fostering effective Engineering practices and processes. Proficiency in Git and GitHub for version control and collaborative development and branching strategies. Experience with CI/CD Tools: Strong knowledge of CI/CD concepts and best practices. Experience with GitHub actions and workflows platform, familiar with other tools like Jenkins Contribute to open source software, engage with maintainers, and actively participate in community curation. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. Equal Employment Opportunity GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"Germany Remote","country":"Germany","country_code":"DE","location_type":"ANY","latitude":51.165691,"longitude":10.451526,"categories":[{"name":"Engineering"}],"tags2":["DE-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: Experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR equivalent experience. Experience in cloud-native development, including designing, building, and deploying scalable applications using microservices architecture, containers (e.g., Docker), and orchestration tools like Kubernetes. Proficiency in leveraging cloud platforms (e.g., AWS, Azure, or GCP) for optimizing application performance and scalability. Experience with on-call rotations, incident response and site reliability, including diagnosing and resolving complex production issues under pressure. Experience implementing and maintaining compliance and security practices in software development, including secure coding, vulnerability management, data privacy, and regulatory standards (e.g., GDPR, SOC 2, HIPAA). Proficiency in designing systems with robust security measures and ensuring adherence to organizational and industry compliance requirements. Preferred Qualifications: Proficiency in modern programming languages such as C#, TypeScript, Go, and Rust. Excellent written and verbal communication via async collaboration, documentation, and visibility of work. Experience working with a remote, distributed team. Passionate about fostering effective Engineering practices and processes. Proficiency in Git and GitHub for version control and collaborative development and branching strategies. Experience with CI/CD Tools: Strong knowledge of CI/CD concepts and best practices. Experience with GitHub actions and workflows platform, familiar with other tools like Jenkins Contribute to open source software, engage with maintainers, and actively participate in community curation.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary. Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","posted_date":"2024-12-20T21:43:00+0000","apply_url":"https://globalcareers-githubinc.icims.com/jobs/3856/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/116157877483119302","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"f2f4735ad9ef07536af29eda2532d918","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":51.165691,"longitude":10.451526},"locationType":"COUNTRY","postalAddress":{"addressLines":["Germany"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"DE","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.21074204644792707}]},"jobSummary":"Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary. Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2025-04-18T12:56:05Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-12-20T21:43:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":19,"uuid":"da36c9fc-28b1-48b6-adf5-e38f6b5b0ba3"},"import_id":"1ca93321-0030-4ee0-8f03-ed5d45c65af1","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3856?lang=en-us","last_mod":"2025-04-18T12:56:29+0000","gdpr":true},"update_date":"2025-04-18T12:56:29+0000","create_date":"2025-03-17T20:20:02+0000","category":[" Engineering"],"full_location":"Germany","short_location":"Germany","multipleLocations":false}},{"data":{"slug":"4160","language":"en-us","languages":["en-us"],"req_id":"4160","title":"Senior Software Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview Do you want to make software development a delight for the entire world? Join us at GitHub! We want you to help build and deliver the best end to end software development experience across GitHub. We’re looking for a highly motivated engineer to work with the GitHub Enterprise Server team. GitHub Enterprise Server (GHES) is a self-hosted version of GitHub that provides all the features and functionalities of GitHub.com but allows organizations to host it on their own infrastructure. It is designed for companies that require enhanced security, compliance, and control over their software development processes. GHES can be deployed on various environments, including on-premises data centers and cloud services. If you are passionate about software and systems engineering, enterprise grade infrastructure, are excited by constantly learning in an ever-changing environment and market and above all, love to focus on customers and deliver products they love – we want to hear from you! Responsibilities Design, develop and ship high-quality technical solutions to solve major customer needs Collaborate with cross-functional teams to define and implement innovative solutions. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can build an enterprise grade developer tool Maintain and diagnose the software as it runs in production on our customers’ on-premises data center or cloud. Document the systems you help build, provide feedback and code reviews to your peers in a constructive way. Focus on the customers and last mile delivery of our products. Work within a shared ownership model, working collaboratively with peer teams on all facets of our product. Qualifications Required Qualifications 6+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field. o OR equivalent experience. 3+ years of experience with hands-on Linux and distributed system debugging. 3+ years of experience supporting or designing solutions for complex technical problems. 3+ years of experience writing and debugging code in Bash, Ruby, Go, or a similar programming language. Preferred Qualifications Experience with GitHub's underlying technology stack (resque, nomad, redis, MySQL, unicorn, etc.). Strong customer engagement experience Knowledge of containerization and container orchestration An understanding of systems monitoring, alerting and troubleshooting. Comfortable working asynchronously with a distributed team. Experience building infrastructure and automation Compensation Range The base salary range for this job is USD $112,800.00 - USD $299,300.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications 6+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field. o OR equivalent experience. 3+ years of experience with hands-on Linux and distributed system debugging. 3+ years of experience supporting or designing solutions for complex technical problems. 3+ years of experience writing and debugging code in Bash, Ruby, Go, or a similar programming language. Preferred Qualifications Experience with GitHub's underlying technology stack (resque, nomad, redis, MySQL, unicorn, etc.). Strong customer engagement experience Knowledge of containerization and container orchestration An understanding of systems monitoring, alerting and troubleshooting. Comfortable working asynchronously with a distributed team. Experience building infrastructure and automation","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Design, develop and ship high-quality technical solutions to solve major customer needs Collaborate with cross-functional teams to define and implement innovative solutions. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can build an enterprise grade developer tool Maintain and diagnose the software as it runs in production on our customers’ on-premises data center or cloud. Document the systems you help build, provide feedback and code reviews to your peers in a constructive way. Focus on the customers and last mile delivery of our products. Work within a shared ownership model, working collaboratively with peer teams on all facets of our product.","posted_date":"2025-04-11T19:58:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/4160/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2025-04-11T19:58:37Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2025-04-11T19:58:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9"},"revision_int":1,"uuid":"ec69a1d3-6c75-4442-9156-9a897273fe9f"},"import_id":"cdd43541-44ab-4f99-afb7-bdf88cfdd846","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/jobs/98906519239566022","jobHash":"a6d50fc01a5b7f08c3b51092d0cdf37b","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"Design, develop and ship high-quality technical solutions to solve major customer needs Collaborate with cross-functional teams to define and implement innovative solutions. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can build an enterprise grade developer tool Maintain and diagnose the software as it runs in production on our customers’ on-premises data center or cloud. Document the systems you help build, provide feedback and code reviews to your peers in a constructive way. Focus on the customers and last mile delivery of our products. Work within a shared ownership model, working collaboratively with peer teams on all facets of our product.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/4160?lang=en-us","last_mod":"2025-04-11T19:59:00+0000","gdpr":false},"update_date":"2025-04-11T19:59:00+0000","create_date":"2025-04-11T19:59:00+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"3926","language":"en-us","languages":["en-us"],"req_id":"3926","title":"Staff Engineering Manager","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview Staff Software Engineer Manager - DX The Developer Experience (DX) department is seeking a Staff Engineering Manager to lead the Deploy team and be part of the organization that develops foundational components powering GitHub products. The DX team is responsible for enhancing the internal developer experience at GitHub, covering all stages of application development. Our scope includes, but is not limited to, optimizing the development experience, providing robust DevOps solutions, managing virtual infrastructure, and more. The Deploy team provides the tools and services that enable GitHub employees to deliver applications to production in a safe and delightful way. The team’s mission is to enable GitHub developers to work efficiently and enjoy their day-to-day activities while ensuring our platforms remain stable, secure, and reliable. This role is critical in a fast-paced environment where you can make a high-impact contribution to our product offerings. GitHub is growing fast and needs to deliver more quickly than before, which brings new and interesting challenges. In this role, you will have the opportunity to work as an engineer with a distributed, diverse, and passionate team delivering features and improvements to the stack. You’ll collaborate with our team of engineers, designers, writers, and product managers to build and maintain customer-facing experiences and backend solutions, enabling high-quality services running at a global scale and delivering those experiences into the hands of millions of developers across the world. Responsibilities A day in the life: Our team is distributed worldwide which means we work both asynchronously and real-time. Your typical week would include: Collaborating with engineering teams, product management, customers, and engineering leadership to align on and understand the problems we want to solve Unblocking obstacles for your team members as they solve GitHub’s most critical problems, often via real-time conversations in Slack or Zoom and with asynchronous communication in GitHub Issues, PRs, Discussions, and Projects Communicating effectively to stakeholders and leadership of progress and risks Coordinating work within the team and stakeholders, building relationships, and identifying opportunities and areas of improvement Ensuring the team produces good architectural design outcomes, secure and resilient systems, and quality code Ensuring the team iteratively ships features and bug fixes, balancing speed to market with future velocity Conducting 1:1s with direct reports to provide regular feedback and ensure career growth and progression Qualifications Required Qualifications: 9+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 8+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science or related field AND 7+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR equivalent experience. 3+ years people management experience Preferred qualifications Experience with Devops best practices and Kubernettes Excellent written and verbal communication skills Passionate about fostering good engineering practices and processes Experience recruiting and retaining healthy teams, managing performance, and calibrating expectations Experience working remotely and leading distributed teams Compensation Range The base salary range for this job is USD $127,600.00 - USD $338,500.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Director"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 9+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 8+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science or related field AND 7+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR equivalent experience. 3+ years people management experience Preferred qualifications Experience with Devops best practices and Kubernettes Excellent written and verbal communication skills Passionate about fostering good engineering practices and processes Experience recruiting and retaining healthy teams, managing performance, and calibrating expectations Experience working remotely and leading distributed teams","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"A day in the life: Our team is distributed worldwide which means we work both asynchronously and real-time. Your typical week would include: Collaborating with engineering teams, product management, customers, and engineering leadership to align on and understand the problems we want to solve Unblocking obstacles for your team members as they solve GitHub’s most critical problems, often via real-time conversations in Slack or Zoom and with asynchronous communication in GitHub Issues, PRs, Discussions, and Projects Communicating effectively to stakeholders and leadership of progress and risks Coordinating work within the team and stakeholders, building relationships, and identifying opportunities and areas of improvement Ensuring the team produces good architectural design outcomes, secure and resilient systems, and quality code Ensuring the team iteratively ships features and bug fixes, balancing speed to market with future velocity Conducting 1:1s with direct reports to provide regular feedback and ensure career growth and progression","posted_date":"2025-04-17T18:09:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/3926/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/100054212884210374","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"b776540db8c0f7a3171ff6364044cc08","derivedInfo":{"jobCategories":["COMPUTER_AND_IT","MANAGEMENT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"A day in the life: Our team is distributed worldwide which means we work both asynchronously and real-time. Your typical week would include: Collaborating with engineering teams, product management, customers, and engineering leadership to align on and understand the problems we want to solve Unblocking obstacles for your team members as they solve GitHub’s most critical problems, often via real-time conversations in Slack or Zoom and with asynchronous communication in GitHub Issues, PRs, Discussions, and Projects Communicating effectively to stakeholders and leadership of progress and risks Coordinating work within the team and stakeholders, building relationships, and identifying opportunities and areas of improvement Ensuring the team produces good architectural design outcomes, secure and resilient systems, and quality code Ensuring the team iteratively ships features and bug fixes, balancing speed to market with future velocity Conducting 1:1s with direct reports to provide regular feedback and ensure career growth and progression","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2025-04-24T17:50:10Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2025-04-17T18:09:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9"},"revision_int":4,"uuid":"9e951a08-a10c-41de-80b2-2bcf9171bd97"},"import_id":"d33e4c2a-031c-470b-86f5-72df0935af92","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3926?lang=en-us","last_mod":"2025-04-24T17:50:37+0000","gdpr":false},"update_date":"2025-04-24T17:50:37+0000","create_date":"2025-04-17T18:09:29+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"4149","language":"en-us","languages":["en-us"],"req_id":"4149","title":"Applied Researcher II Intern","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is the home for software development, where we collaborate to build the world's leading AI-powered developer platform. In the GitHub code scanning team, we are passionate about ensuring the security and quality of the world’s software - from open source to the enterprise. We believe that the best way to secure and improve the quality of software is to detect actionable issues early in the development process, and actively facilitate their remediation as part of the developer workflow. Our team develops the GitHub code scanning product, used by hundreds of thousands of developers and projects every day as part of GitHub's Advanced Security offering to find and fix vulnerabilities in their code, and powered by two detection and remediation engines: CodeQL is GitHub's own semantic code analysis engine that uses world-class static analysis research and technology to deeply analyze code, enabling the early detection of security vulnerabilities and correctness errors in software. CodeQL supports a wide range of programming languages, including C/C++, C#, Go, Java, JavaScript/TypeScript, Kotlin, Python, Ruby, and Swift. Copilot Autofix is our LLM-powered remediation system that produces high-quality fix suggestions for code scanning alerts, empowering developers to fix alerts as soon as they are found or that already exist in their codebase. Responsibilities Internships at GitHub aim to provide students with hands-on experience in developing fundamental skills while exploring potential career paths. We are looking for talented individuals to join us for a research internship in 2025. In this role, you will work with one of the distributed engineering teams in the code scanning group at GitHub on a specialized project at the intersection of AI and static program analysis. You will carry out research, run experiments, and build prototypes in the area of using LLMs to detect and fix code security vulnerabilities and code quality concerns. Your work will integrate with existing GitHub systems like Copilot Autofix, and explore the boundaries of what is possible by combining AI systems with existing programming language tools and the GitHub platform. This is a remote summer internship for 12 consecutive weeks with start dates in June 2025 with an onsite week during the internship. Qualifications Required Qualifications: Currently in the process of obtaining a PhD in Computer Science, or similar with at least one quarter/semester to complete after the internship. Available to work full time for a minimum of 12 weeks while not concurrently enrolled in coursework, starting June 2025. 2+ years of experience with software engineering or prototype development in Python, JavaScript/TypeScript, Go, or a similar programming language. Research or development experience in the following areas: Software security, including static analysis, dynamic analysis, software supply chain security, and best practices in creating high-quality, secure code. Machine learning applied to understanding source code, specifically using prompt engineering with large language models (LLMs) and systematic data collection and result evaluation. Preferred Qualifications: Excellent communication skills, both written and verbal. Track record of working both independently and collaboratively. Published research on machine learning applied to source code and programming languages. Knowledge of compilers, program analysis, programming language design and implementation. Experience building developer tools that operate on source code, such as compilers, parsers, linters, static analyzers, debuggers, CLI tools, or IDE extensions. Compensation Range The base salary range for this job is USD $50.06 - USD $71.52 /Hr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Intern"],"tags5":["Intern"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications: Currently in the process of obtaining a PhD in Computer Science, or similar with at least one quarter/semester to complete after the internship. Available to work full time for a minimum of 12 weeks while not concurrently enrolled in coursework, starting June 2025. 2+ years of experience with software engineering or prototype development in Python, JavaScript/TypeScript, Go, or a similar programming language. Research or development experience in the following areas: Software security, including static analysis, dynamic analysis, software supply chain security, and best practices in creating high-quality, secure code. Machine learning applied to understanding source code, specifically using prompt engineering with large language models (LLMs) and systematic data collection and result evaluation. Preferred Qualifications: Excellent communication skills, both written and verbal. Track record of working both independently and collaboratively. Published research on machine learning applied to source code and programming languages. Knowledge of compilers, program analysis, programming language design and implementation. Experience building developer tools that operate on source code, such as compilers, parsers, linters, static analyzers, debuggers, CLI tools, or IDE extensions.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Internships at GitHub aim to provide students with hands-on experience in developing fundamental skills while exploring potential career paths. We are looking for talented individuals to join us for a research internship in 2025. In this role, you will work with one of the distributed engineering teams in the code scanning group at GitHub on a specialized project at the intersection of AI and static program analysis. You will carry out research, run experiments, and build prototypes in the area of using LLMs to detect and fix code security vulnerabilities and code quality concerns. Your work will integrate with existing GitHub systems like Copilot Autofix, and explore the boundaries of what is possible by combining AI systems with existing programming language tools and the GitHub platform. This is a remote summer internship for 12 consecutive weeks with start dates in June 2025 with an onsite week during the internship.","posted_date":"2025-04-01T21:38:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/4149/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/143313578353402566","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"66ffd95bdf201dd1966a106607277653","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"Internships at GitHub aim to provide students with hands-on experience in developing fundamental skills while exploring potential career paths. We are looking for talented individuals to join us for a research internship in 2025. In this role, you will work with one of the distributed engineering teams in the code scanning group at GitHub on a specialized project at the intersection of AI and static program analysis. You will carry out research, run experiments, and build prototypes in the area of using LLMs to detect and fix code security vulnerabilities and code quality concerns. Your work will integrate with existing GitHub systems like Copilot Autofix, and explore the boundaries of what is possible by combining AI systems with existing programming language tools and the GitHub platform. This is a remote summer internship for 12 consecutive weeks with start dates in June 2025 with an onsite week during the internship.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2025-04-16T17:27:20Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2025-04-01T21:38:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9"},"revision_int":5,"uuid":"759f095e-c026-4e9f-a403-754489a074fc"},"import_id":"23427dbb-aaf3-4caf-8ef5-1a8fa43532e1","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/4149?lang=en-us","last_mod":"2025-04-16T17:27:29+0000","gdpr":false},"update_date":"2025-04-16T17:27:29+0000","create_date":"2025-04-01T21:38:37+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"4168","language":"en-us","languages":["en-us"],"req_id":"4168","title":"Staff Software Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview The Developer Experience (DX) and Migration department is seeking for a Staff Software Engineer to help lead the development of foundational components that power GitHub products and its migration tooling. This team is dedicated to improving the internal developer experience at GitHub, encompassing all phases of application development. Our responsibilities include optimizing the development process, delivering robust DevOps solutions, managing virtual infrastructure, and more. Additionally, we are tasked with creating the tools that facilitate customer migrations to GitHub and between different products. Our mission is enabling GitHub developers to work efficiently, ensure our platforms remain stable, secure, and reliable and provide a seamless migration experience to our customers. This role is critical in a fast-paced environment where you can make a high-impact contribution to our product offerings. As a Staff Software Engineer, you will collaborate with a globally distributed team of managers and engineers to enhance and scale our products, ensuring an exceptional experience that meets the unique needs of our diverse customer base. This role requires extensive experience in both platform and application development, a passion for using AI tools, and the ability to leverage them in our daily operations. You should be able to flex your skill sets to create innovative solutions and drive long-term positive strategic outcomes for GitHub. Responsibilities Lead and mentor team members in producing extensible and maintainable code, ensuring integration with downstream dependencies and adherence to quality standards. Partner with stakeholders to determine user requirements and lead discussions for technical solutions, including design and cost considerations, while ensuring system architecture meets security and compliance standards. Independently create and guide others in developing clear testing plans to assure solution quality, defining success metrics, and integrating customer feedback for continuous improvement. Drive project plans and release schedules by leveraging cross-product expertise, identifying dependencies, and coordinating with other teams to ensure timely delivery and alignment with business objectives. Lead efforts in applying debugging tools and telemetry to verify assumptions, proactively resolve issues, and optimize code performance and maintainability. Collect, classify, and analyze complex data to refine products, make informed engineering decisions, and ensure solutions are scalable and financially responsible. Maintain live service operations, implement solutions to complex issues, and develop playbooks for incident resolution, ensuring system health and reliability. Lead the development and enhancement of internal tools and processes to improve team performance and efficiency, encouraging the adoption of AI, new technologies and methodologies. Develop and maintain a technical roadmap that aligns with product goals, ensuring that engineering efforts are strategically prioritized, and resources are effectively allocated. Qualifications Required Qualifications: 9+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR associate’s degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 8+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR bachelor's degree in Computer Science or related field AND 7+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR master's degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR equivalent experience. Preferred Qualifications: Demonstrated experience with large-scale system architecture and design, particularly in cloud-based environments, with a strong understanding of distributed systems and microservices. Experience working closely with product management, design, and other engineering teams to drive cross-functional projects and deliver high-quality products Excellent analytical skills when proactively identifying risks and balancing priorities. Compensation Range The base salary range for this job is USD $127,600.00 - USD $338,500.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 9+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR associate’s degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 8+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR bachelor's degree in Computer Science or related field AND 7+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR master's degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR equivalent experience. Preferred Qualifications: Demonstrated experience with large-scale system architecture and design, particularly in cloud-based environments, with a strong understanding of distributed systems and microservices. Experience working closely with product management, design, and other engineering teams to drive cross-functional projects and deliver high-quality products Excellent analytical skills when proactively identifying risks and balancing priorities.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Lead and mentor team members in producing extensible and maintainable code, ensuring integration with downstream dependencies and adherence to quality standards. Partner with stakeholders to determine user requirements and lead discussions for technical solutions, including design and cost considerations, while ensuring system architecture meets security and compliance standards. Independently create and guide others in developing clear testing plans to assure solution quality, defining success metrics, and integrating customer feedback for continuous improvement. Drive project plans and release schedules by leveraging cross-product expertise, identifying dependencies, and coordinating with other teams to ensure timely delivery and alignment with business objectives. Lead efforts in applying debugging tools and telemetry to verify assumptions, proactively resolve issues, and optimize code performance and maintainability. Collect, classify, and analyze complex data to refine products, make informed engineering decisions, and ensure solutions are scalable and financially responsible. Maintain live service operations, implement solutions to complex issues, and develop playbooks for incident resolution, ensuring system health and reliability. Lead the development and enhancement of internal tools and processes to improve team performance and efficiency, encouraging the adoption of AI, new technologies and methodologies. Develop and maintain a technical roadmap that aligns with product goals, ensuring that engineering efforts are strategically prioritized, and resources are effectively allocated.","posted_date":"2025-04-16T14:48:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/4168/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/123657362425684678","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"4b168d0aeb80a328d745f45a81381e8a","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"Lead and mentor team members in producing extensible and maintainable code, ensuring integration with downstream dependencies and adherence to quality standards. Partner with stakeholders to determine user requirements and lead discussions for technical solutions, including design and cost considerations, while ensuring system architecture meets security and compliance standards. Independently create and guide others in developing clear testing plans to assure solution quality, defining success metrics, and integrating customer feedback for continuous improvement. Drive project plans and release schedules by leveraging cross-product expertise, identifying dependencies, and coordinating with other teams to ensure timely delivery and alignment with business objectives. Lead efforts in applying debugging tools and telemetry to verify assumptions, proactively resolve issues, and optimize code performance and maintainability. Collect, classify, and analyze complex data to refine products, make informed engineering decisions, and ensure solutions are scalable and financially responsible. Maintain live service operations, implement solutions to complex issues, and develop playbooks for incident resolution, ensuring system health and reliability. Lead the development and enhancement of internal tools and processes to improve team performance and efficiency, encouraging the adoption of AI, new technologies and methodologies. Develop and maintain a technical roadmap that aligns with product goals, ensuring that engineering efforts are strategically prioritized, and resources are effectively allocated.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2025-04-24T14:46:54Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2025-04-16T14:48:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9"},"revision_int":2,"uuid":"9a7e2f91-4b56-409f-9412-920a239f51d4"},"import_id":"930161e8-3081-4345-adb8-05a8e3c9849b","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/4168?lang=en-us","last_mod":"2025-04-24T14:47:37+0000","gdpr":false},"update_date":"2025-04-24T14:47:37+0000","create_date":"2025-04-16T14:48:28+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"4173","language":"en-us","languages":["en-us"],"req_id":"4173","title":"Software Engineer II, Copilot Client Platform","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub helps companies, organizations, and groups of individuals succeed by allowing them to build better software, together. The successful launch of GitHub Copilot in June 2022 has demonstrated the possibilities of AI-assisted software development. The Copilot Client Platform Team focuses on building the platform for delivering seamless, high-performance integrations of GitHub Copilot across a range of development environments. Currently, the team supports extensions for popular editors like Visual Studio Code, Visual Studio, the JetBrains suite (e.g., IntelliJ IDEA, PyCharm), Xcode, Eclipse and Vim/Neovim. By optimizing these integrations, the team ensures that developers worldwide can harness the power of Copilot within their preferred tools. This role involves close collaboration with Microsoft’s Developer Division (responsible for Visual Studio and Visual Studio Code) and GitHub Next, a research group pioneering the future of software development, where Copilot originated. Operating within a highly distributed and asynchronous communication model, the ideal candidate will thrive in a globally connected team and possess exceptional written communication skills to foster collaboration and build strong working relationships. Responsibilities Learn and contribute to the development of new features for the various different Copilot IDE extensions with a focus on the Copilot VS Code/JetBrains extension. Assist in contributing to new IDE plugins that deliver the GitHub Copilot functionality. Collaborate with other parts of the wider Copilot team. Explore new ways of presenting Copilot’s output, collaborating with external IDE teams as needed. Contribute in partnership with appropriate stakeholders (e.g., project manager, technical lead) to determine requirements for a feature/scenario. Learn and contribute to processes for the technical solutions of a product/feature within the team's area of responsibility and learn to create proposals by testing design hypotheses and helping to refine code plans under the technical leadership of others. Collaborate with others to create a clear and articulated plan for testing and assuring quality of solutions. Support identification of dependencies during the design for a product feature with oversight. With guidance, learn to create and implement code for a product, service, or feature reusing code as applicable. Learn about and apply knowledge of debugging tools, logs, telemetry, and other methods to proactively flag issues before they occur and reactively flag issues as they occur for product features. Learn to review code and help to review code of others to ensure it meets the team's and GitHub's quality standards Qualifications Required Qualifications: 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 1+ year(s) experience OR Bachelor's Degree in Computer Science or related field OR equivalent experience. Preferred Qualifications: Development experience with TypeScript, Java or Kotlin. Interest in modern AI/machine learning technologies and program synthesis in particular. Interest in developing Integrated Development Environment (IDE) extensions. Interest in developer tooling or program/static analysis, or compilers and compiler construction. Compensation Range The base salary range for this job is USD $81,000.00 - USD $214,900.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 1+ year(s) experience OR Bachelor's Degree in Computer Science or related field OR equivalent experience. Preferred Qualifications: Development experience with TypeScript, Java or Kotlin. Interest in modern AI/machine learning technologies and program synthesis in particular. Interest in developing Integrated Development Environment (IDE) extensions. Interest in developer tooling or program/static analysis, or compilers and compiler construction.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Learn and contribute to the development of new features for the various different Copilot IDE extensions with a focus on the Copilot VS Code/JetBrains extension. Assist in contributing to new IDE plugins that deliver the GitHub Copilot functionality. Collaborate with other parts of the wider Copilot team. Explore new ways of presenting Copilot’s output, collaborating with external IDE teams as needed. Contribute in partnership with appropriate stakeholders (e.g., project manager, technical lead) to determine requirements for a feature/scenario. Learn and contribute to processes for the technical solutions of a product/feature within the team's area of responsibility and learn to create proposals by testing design hypotheses and helping to refine code plans under the technical leadership of others. Collaborate with others to create a clear and articulated plan for testing and assuring quality of solutions. Support identification of dependencies during the design for a product feature with oversight. With guidance, learn to create and implement code for a product, service, or feature reusing code as applicable. Learn about and apply knowledge of debugging tools, logs, telemetry, and other methods to proactively flag issues before they occur and reactively flag issues as they occur for product features. Learn to review code and help to review code of others to ensure it meets the team's and GitHub's quality standards","posted_date":"2025-04-24T17:45:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/4173/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/79608656189891270","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"41df2a54fb4a338d3f59de54b6ca0712","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"Learn and contribute to the development of new features for the various different Copilot IDE extensions with a focus on the Copilot VS Code/JetBrains extension. Assist in contributing to new IDE plugins that deliver the GitHub Copilot functionality. Collaborate with other parts of the wider Copilot team. Explore new ways of presenting Copilot’s output, collaborating with external IDE teams as needed. Contribute in partnership with appropriate stakeholders (e.g., project manager, technical lead) to determine requirements for a feature/scenario. Learn and contribute to processes for the technical solutions of a product/feature within the team's area of responsibility and learn to create proposals by testing design hypotheses and helping to refine code plans under the technical leadership of others. Collaborate with others to create a clear and articulated plan for testing and assuring quality of solutions. Support identification of dependencies during the design for a product feature with oversight. With guidance, learn to create and implement code for a product, service, or feature reusing code as applicable. Learn about and apply knowledge of debugging tools, logs, telemetry, and other methods to proactively flag issues before they occur and reactively flag issues as they occur for product features. Learn to review code and help to review code of others to ensure it meets the team's and GitHub's quality standards","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2025-04-24T17:48:11Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2025-04-24T17:45:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9"},"revision_int":2,"uuid":"2e342eea-7376-465a-93f4-d2528ef531c2"},"import_id":"ac8c6293-87d0-47fb-84ed-7bc7740008b8","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/4173?lang=en-us","last_mod":"2025-04-24T17:48:38+0000","gdpr":false},"update_date":"2025-04-24T17:48:38+0000","create_date":"2025-04-24T17:46:37+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}}],"locations":[],"totalCount":12,"request_id":false,"count":12,"languageCounts":{"en-us":{"displayName":"English","count":12}},"filter":{"facetList":{"tags4":[{"term":"Experienced Professional","count":11},{"term":"Intern","count":1}],"tags5":[{"term":"Individual Contributor","count":8},{"term":"Director","count":2},{"term":"Intern","count":1},{"term":"Senior Manager","count":1}],"tags6":[{"term":"Yes","count":12}]},"displayLimit":10,"brands":{"all":[],"shortlist":[]},"categories":{"all":[{"category":"Engineering","numJobs":12}],"shortlist":[{"category":"Engineering","numJobs":12}]},"locations":{"all":[{"city":null,"state":null,"country":"Canada","count":1},{"city":null,"state":null,"country":"Germany","count":1},{"city":null,"state":null,"country":"United Kingdom","count":1},{"city":null,"state":null,"country":"United States","count":9}],"shortlist":[{"city":null,"state":null,"country":"Canada","count":1},{"city":null,"state":null,"country":"Germany","count":1},{"city":null,"state":null,"country":"United Kingdom","count":1},{"city":null,"state":null,"country":"United States","count":9}]},"experienceLevels":{"all":[],"shortlist":[]}}}