{"jobs":[{"data":{"slug":"3650","language":"en-us","languages":["en-us"],"req_id":"3650","title":"Software Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview As a software engineer at GitHub, you will enhance the collaboration experience at GitHub by working closely with a community of engineers and designers with a distributed, diverse and passionate team delivering the services that millions of developers depend on. In this role you will design, prototype, implement, ship and support highly performant and inspiring user experiences with your team. We are looking for creative problem solvers and diverse thinkers, people who care about culture as well as customers and features. We believe that how we do things is as important as what we do. Big vision, a common purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what lead to great results. Great products reflect the teams that build them. Responsibilities Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Receive technical mentorship, collaborate and pair with others, provide code reviews, and communicate clearly to your leadership about progress, blockers, and gaps. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code. Qualifications Required Qualifications 1+ year(s) experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, or related field OR equivalent experience. Preferred Qualifications Experience with Git and GitHub Experience using Azure technologies is a bonus Experience using front-end frameworks like React.js Understanding of REST principles and experience with backend APIs Strong written and verbal communication skill Passionate about healthy team culture and collaboration Comfortable working transparently in an agile environment and soliciting feedback from peers Compensation Range The base salary range for this job is USD $66,900.00 - USD $177,600.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications 1+ year(s) experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, or related field OR equivalent experience. Preferred Qualifications Experience with Git and GitHub Experience using Azure technologies is a bonus Experience using front-end frameworks like React.js Understanding of REST principles and experience with backend APIs Strong written and verbal communication skill Passionate about healthy team culture and collaboration Comfortable working transparently in an agile environment and soliciting feedback from peers","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Receive technical mentorship, collaborate and pair with others, provide code reviews, and communicate clearly to your leadership about progress, blockers, and gaps. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","posted_date":"2024-10-28T20:31:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/3650/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/90968746054558406","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"c7a10fb44093de75884b66e68910648c","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Receive technical mentorship, collaborate and pair with others, provide code reviews, and communicate clearly to your leadership about progress, blockers, and gaps. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-10-28T21:20:51Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-10-28T20:31:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9"},"revision_int":3,"uuid":"4f25647c-49c0-4a73-bb00-de60ba92bc3c"},"import_id":"bf050210-d070-4b84-9dd9-8af2cf5beed3","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3650?lang=en-us","last_mod":"2024-10-28T21:21:33+0000","gdpr":false},"update_date":"2024-10-28T21:21:33+0000","create_date":"2024-10-28T20:36:34+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"3372","language":"en-us","languages":["en-us"],"req_id":"3372","title":"Staff Networking Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview We’re looking for a Staff Network Engineer to join GitHub’s Network Engineering team. Our mission is to design, build, maintain, and scale GitHub’s peering, transport, exchange, and data center network infrastructure in a multi-site, on-premises data center environment, while also supporting our hybrid cloud efforts. As GitHub grows, our network engineers must work cross-functionally to support our ever-expanding compute footprint and rapid user growth. This critical infrastructure supports all GitHub products, teams, and users, making your role pivotal in ensuring its ongoing scalability and reliability. In this role, you will be responsible for providing technical leadership within our network engineering team and driving capabilities that serve our unique and complex platform. You will lead the team in building and enhancing the architecture, configuration, and software frameworks and tools that are used to manage and maintain our network infrastructure. You will assess capacity needs, predict growth trends, and plan for scalability. You will also handle internal/external support within your area of responsibility, drive network security and compliance, and lead efforts to monitor infrastructure proactively to identify and address potential issues. Furthermore, you will drive optimization efforts and lead initiatives aimed at enhancing system performance, reliability, and scalability. You must maintain advanced knowledge of the latest technologies and best practices in network engineering and be adept at diagnosing common and uncommon errors to develop or direct solutions. You will collaborate with software engineers and other infrastructure teams to troubleshoot issues and optimize network performance. Responsibilities Network Development and Management Lead the team in designing, building, maintaining, and scaling components of a large-scale, multi-site, heavily peered network. Assess network capacity needs, predict growth trends, and plan for scalability. Ensure sufficient resources are allocated, and that network equipment and services are properly scaled to handle increasing demands. Expand network platform offerings to meet business and developer needs. Availability and Performance Handle internal/external support for network engineering escalations. Participate in a 24x7 on-call rotation, respond to incidents, and collaborate with other teams to resolve reliability issues. Lead efforts to monitor infrastructure proactively to identify and address issues, including through instructional playbooks. Research and understand performance gaps or outages, using this knowledge to resolve issues. Identify and execute disaster recovery/failure test scenarios. Fundamentals Drive the security and compliance of the infrastructure. Collaborate with security teams to implement and maintain robust security measures, conduct vulnerability assessments, and adhere to relevant regulatory standards. Ensure timely upgrades to software and firmware used for infrastructure operation, as well as to software components in our management and automation toolchains. Drive incident management processes, provide incident reports, identify root causes, and implement preventive measures to avoid future incidents. Behavior Embody our values: better together, growth mindset, ship to learn, customer-obsessed, diverse \u0026 inclusive, and own the outcome. Embody our principles: create clarity, generate energy, and deliver success. Qualifications Required Qualifications: 9+ years of technical experience in network engineering, including architecture, network design, and product selection/hardware specifications. OR Bachelor's Degree in Computer Science, Information Technology, or a related field AND 7+ years of technical experience in network engineering OR equivalent experience 2+ years of technical leadership experience (Staff, Principal, or equivalent level) 2+ years of scripting experience in mainstream languages (Python, Bash, etc.) or frameworks (Ansible, Chef, Puppet, etc.) Preferred Qualifications: 4+ years of experience in one or more scripting languages (e.g., Bash, Python, or similar). 4+ years of experience using general-purpose programming languages (e.g., Go, Ruby, or similar). 5+ years of experience managing compute hardware in the context of datacenter deployments. 5+ years of experience with compute platforms and frameworks (Kubernetes, Virtualization platforms like VMware, libvirt/KVM), including service mesh and service discovery technologies (Istio, Consul, etc.). Compensation Range The base salary range for this job is USD $127,600.00 - USD $338,500.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 9+ years of technical experience in network engineering, including architecture, network design, and product selection/hardware specifications. OR Bachelor's Degree in Computer Science, Information Technology, or a related field AND 7+ years of technical experience in network engineering OR equivalent experience 2+ years of technical leadership experience (Staff, Principal, or equivalent level) 2+ years of scripting experience in mainstream languages (Python, Bash, etc.) or frameworks (Ansible, Chef, Puppet, etc.) Preferred Qualifications: 4+ years of experience in one or more scripting languages (e.g., Bash, Python, or similar). 4+ years of experience using general-purpose programming languages (e.g., Go, Ruby, or similar). 5+ years of experience managing compute hardware in the context of datacenter deployments. 5+ years of experience with compute platforms and frameworks (Kubernetes, Virtualization platforms like VMware, libvirt/KVM), including service mesh and service discovery technologies (Istio, Consul, etc.).","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Network Development and Management Lead the team in designing, building, maintaining, and scaling components of a large-scale, multi-site, heavily peered network. Assess network capacity needs, predict growth trends, and plan for scalability. Ensure sufficient resources are allocated, and that network equipment and services are properly scaled to handle increasing demands. Expand network platform offerings to meet business and developer needs. Availability and Performance Handle internal/external support for network engineering escalations. Participate in a 24x7 on-call rotation, respond to incidents, and collaborate with other teams to resolve reliability issues. Lead efforts to monitor infrastructure proactively to identify and address issues, including through instructional playbooks. Research and understand performance gaps or outages, using this knowledge to resolve issues. Identify and execute disaster recovery/failure test scenarios. Fundamentals Drive the security and compliance of the infrastructure. Collaborate with security teams to implement and maintain robust security measures, conduct vulnerability assessments, and adhere to relevant regulatory standards. Ensure timely upgrades to software and firmware used for infrastructure operation, as well as to software components in our management and automation toolchains. Drive incident management processes, provide incident reports, identify root causes, and implement preventive measures to avoid future incidents. Behavior Embody our values: better together, growth mindset, ship to learn, customer-obsessed, diverse \u0026 inclusive, and own the outcome. Embody our principles: create clarity, generate energy, and deliver success.","posted_date":"2024-10-07T19:33:00+0000","posting_expiry_date":"2024-11-30T06:00:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/3372/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/127026632350147270","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"84595524f454430193a3e809eba7afa9","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"Network Development and Management Lead the team in designing, building, maintaining, and scaling components of a large-scale, multi-site, heavily peered network. Assess network capacity needs, predict growth trends, and plan for scalability. Ensure sufficient resources are allocated, and that network equipment and services are properly scaled to handle increasing demands. Expand network platform offerings to meet business and developer needs. Availability and Performance Handle internal/external support for network engineering escalations. Participate in a 24x7 on-call rotation, respond to incidents, and collaborate with other teams to resolve reliability issues. Lead efforts to monitor infrastructure proactively to identify and address issues, including through instructional playbooks. Research and understand performance gaps or outages, using this knowledge to resolve issues. Identify and execute disaster recovery/failure test scenarios. Fundamentals Drive the security and compliance of the infrastructure. Collaborate with security teams to implement and maintain robust security measures, conduct vulnerability assessments, and adhere to relevant regulatory standards. Ensure timely upgrades to software and firmware used for infrastructure operation, as well as to software components in our management and automation toolchains. Drive incident management processes, provide incident reports, identify root causes, and implement preventive measures to avoid future incidents. Behavior Embody our values: better together, growth mindset, ship to learn, customer-obsessed, diverse \u0026 inclusive, and own the outcome. Embody our principles: create clarity, generate energy, and deliver success.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-10-30T14:04:04Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-10-07T19:33:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9","validThrough":"2024-11-30T06:00:00+0000"},"revision_int":6,"uuid":"b2b1c9c9-0e6a-4674-b45b-6cda7c1f756a"},"import_id":"48877814-32c3-4bcd-a1b6-5e8e04bcad04","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3372?lang=en-us","last_mod":"2024-10-30T14:04:33+0000","gdpr":false},"update_date":"2024-10-30T14:04:33+0000","create_date":"2024-10-16T20:53:51+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"3513","language":"en-us","languages":["en-us"],"req_id":"3513","title":"Staff Research Engineer, GitHub Next","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub has changed the way software is built, and we have a unique opportunity to look further ahead to identify how software development can be faster, safer, easier, and more accessible. We’re looking for talented, experienced polymaths to join us in this mission! This is the rare role that affords both startup-level agency and a larger company’s resources. GitHub Next has incubated genre-defining products like Copilot, Copilot Workspace, and more. You’ll work closely with a small group of experienced and talented researchers to explore the future of software development. Our team’s prototypes inform GitHub’s leadership and roadmap. Each exploration represents a risky bet that GitHub might want to make, and we have to support those bets with working prototypes. Please note that this is not an academic research role. Our job is to dream big about the future of software development — and then build it. Our team feels like a permanent startup: every time we succeed, we hand off our prototypes and return to the drawing board to do it all over again. You can see many of our projects at githubnext.com. Responsibilities Research Engineers build prototypes. Sometimes, we have an interesting technological idea but need to figure out how to turn it into a reliable product. Other times, we dream of an experience, but we’re not sure how to make that experience a reality. With few constraints on our solution space, our hardest task is figuring out how to scope our bets and deliver value. We will have more ideas than we can possibly pursue; choosing wisely is part of the job. The exploration domains are varied and will require an ability to understand, investigate, and implement prototypes across a wide range of technologies. Our team has a lot of different skills under one roof, and we work together in squads to identify and debate ideas, then execute everything needed for a working prototype. For this role, we are seeking an individual with exceptional frontend and design skills. Next’s prototypes grapple with difficult UX challenges in domains with little prior art to guide us. You may be a good fit if: You are a generalist with some areas of deeper knowledge. Hybrids will feel at home on this team. We will also consider candidates who have specialized in a relevant field. You are an effective and inclusive communicator, comfortable with remote communication practices. Next’s currency is ideas; the health of our team, our execution, and our results rests on our ability to communicate well. You are comfortable collaborating with teammates to figure out what work needs doing, then splitting up that work and doing it. Ideating alone is natural and common, but projects staffed by one individual don’t tend to survive. Your teammates are the first ones you must persuade with your ideas. You are comfortable reading source code. You are comfortable picking up new technology stacks in the normal course of work. This is a senior engineering role! While we do have some technologies that we generally like to use, we are not indexing on a specific stack. Experience is more than your ability to write code in language X or framework Y. Qualifications Required Qualifications: 9+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 8+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science or related field AND 7+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR equivalent experience. Experience creating rapid prototypes that demonstrate a concept to stakeholders and enable decision making Experience identifying and justifying research goals in situations of ambiguity and executing towards those goals without explicit direction Preferred Qualifications: These are more specific abilities we’re looking for, but it is the rare human who possesses them all. Think of this as a descriptive sketch, not a checklist of requirements. Be comfortable applying even if you don’t have all of them. A deep understanding of GitHub’s industry and business context and the ability to articulate topics related to our product and audience Has held roles that deal with topics at the boundary of human knowledge regarding software development and developers Have significant experience with one or more frontend technologies. We currently default to Typescript and React for the web, but we also have some efforts underway with Svelte and SvelteKit. “Whatever enables us to ship” is the top concern Have significant experience with machine learning, LLMs, and the rapidly-evolving landscape of techniques and tools used to build intelligence into products Have significant experience with one or more backend technologies: server-side environments, compute, datastores, networking, infrastructure, devops, security, and programming languages Have significant experience with open-source software, communities, and the systems these communities use to self-organize and ship software for others Have significant experience operating production systems at a nontrivial scale and are familiar with the common patterns and pitfalls of that work Have significant experience in another area of computing that is relevant to our mission. Human-computer interaction, distributed systems, $YOURTHING Compensation Range The base salary range for this job is USD $118,100.00 - USD $313,300.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 9+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 8+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science or related field AND 7+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR equivalent experience. Experience creating rapid prototypes that demonstrate a concept to stakeholders and enable decision making Experience identifying and justifying research goals in situations of ambiguity and executing towards those goals without explicit direction Preferred Qualifications: These are more specific abilities we’re looking for, but it is the rare human who possesses them all. Think of this as a descriptive sketch, not a checklist of requirements. Be comfortable applying even if you don’t have all of them. A deep understanding of GitHub’s industry and business context and the ability to articulate topics related to our product and audience Has held roles that deal with topics at the boundary of human knowledge regarding software development and developers Have significant experience with one or more frontend technologies. We currently default to Typescript and React for the web, but we also have some efforts underway with Svelte and SvelteKit. “Whatever enables us to ship” is the top concern Have significant experience with machine learning, LLMs, and the rapidly-evolving landscape of techniques and tools used to build intelligence into products Have significant experience with one or more backend technologies: server-side environments, compute, datastores, networking, infrastructure, devops, security, and programming languages Have significant experience with open-source software, communities, and the systems these communities use to self-organize and ship software for others Have significant experience operating production systems at a nontrivial scale and are familiar with the common patterns and pitfalls of that work Have significant experience in another area of computing that is relevant to our mission. Human-computer interaction, distributed systems, $YOURTHING","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Research Engineers build prototypes. Sometimes, we have an interesting technological idea but need to figure out how to turn it into a reliable product. Other times, we dream of an experience, but we’re not sure how to make that experience a reality. With few constraints on our solution space, our hardest task is figuring out how to scope our bets and deliver value. We will have more ideas than we can possibly pursue; choosing wisely is part of the job. The exploration domains are varied and will require an ability to understand, investigate, and implement prototypes across a wide range of technologies. Our team has a lot of different skills under one roof, and we work together in squads to identify and debate ideas, then execute everything needed for a working prototype. For this role, we are seeking an individual with exceptional frontend and design skills. Next’s prototypes grapple with difficult UX challenges in domains with little prior art to guide us. You may be a good fit if: You are a generalist with some areas of deeper knowledge. Hybrids will feel at home on this team. We will also consider candidates who have specialized in a relevant field. You are an effective and inclusive communicator, comfortable with remote communication practices. Next’s currency is ideas; the health of our team, our execution, and our results rests on our ability to communicate well. You are comfortable collaborating with teammates to figure out what work needs doing, then splitting up that work and doing it. Ideating alone is natural and common, but projects staffed by one individual don’t tend to survive. Your teammates are the first ones you must persuade with your ideas. You are comfortable reading source code. You are comfortable picking up new technology stacks in the normal course of work. This is a senior engineering role! While we do have some technologies that we generally like to use, we are not indexing on a specific stack. Experience is more than your ability to write code in language X or framework Y.","posted_date":"2024-09-27T21:14:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/3513/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/142007571425698502","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"f047e035e3cde70b2e90cbf195aa6dce","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"Research Engineers build prototypes. Sometimes, we have an interesting technological idea but need to figure out how to turn it into a reliable product. Other times, we dream of an experience, but we’re not sure how to make that experience a reality. With few constraints on our solution space, our hardest task is figuring out how to scope our bets and deliver value. We will have more ideas than we can possibly pursue; choosing wisely is part of the job. The exploration domains are varied and will require an ability to understand, investigate, and implement prototypes across a wide range of technologies. Our team has a lot of different skills under one roof, and we work together in squads to identify and debate ideas, then execute everything needed for a working prototype. For this role, we are seeking an individual with exceptional frontend and design skills. Next’s prototypes grapple with difficult UX challenges in domains with little prior art to guide us. You may be a good fit if: You are a generalist with some areas of deeper knowledge. Hybrids will feel at home on this team. We will also consider candidates who have specialized in a relevant field. You are an effective and inclusive communicator, comfortable with remote communication practices. Next’s currency is ideas; the health of our team, our execution, and our results rests on our ability to communicate well. You are comfortable collaborating with teammates to figure out what work needs doing, then splitting up that work and doing it. Ideating alone is natural and common, but projects staffed by one individual don’t tend to survive. Your teammates are the first ones you must persuade with your ideas. You are comfortable reading source code. You are comfortable picking up new technology stacks in the normal course of work. This is a senior engineering role! While we do have some technologies that we generally like to use, we are not indexing on a specific stack. Experience is more than your ability to write code in language X or framework Y.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-10-14T14:36:44Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-09-27T21:14:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9"},"revision_int":6,"uuid":"6cb1a55f-cb25-4320-86bb-26632f0a5afe"},"import_id":"365bad9c-a918-44ea-a2e7-caebfc9f0470","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3513?lang=en-us","last_mod":"2024-10-14T14:36:51+0000","gdpr":false},"update_date":"2024-10-14T14:36:51+0000","create_date":"2024-09-27T21:21:31+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"3496","language":"en-us","languages":["en-us"],"req_id":"3496","title":"Software Engineer III","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. The team is responsible for Blackbird, GitHub’s powerful, blazingly fast code search engine, used by millions of software developers around the world. We are looking for a Software Engineer III with a background in Site Reliability Engineering (SRE) to contribute to developing and enhancing our platform to ensure its stability, scalability, and performance. The ideal candidate will have strong operational and troubleshooting skills with experience in incident management. Stack: GitHub is built on various technologies, including cloud platforms, Kubernetes, Docker, and CI/CD pipelines. The Team works primarily in the Rust and Go programming languages. We utilize observability and alerting tools such as Splunk, DataDog, and PagerDuty. Responsibilities Maintain and improve automation tooling for deployment, configuration management, and system maintenance. Implement and enhance monitoring, logging, and alerting solutions to maintain system health and performance. Help with incident response efforts, performing root cause analysis and implementing measures to prevent future incidents. Collaborate with the team to address scalability issues, optimize system performance, and improve reliability. Participate in on-call rotations with the team to support system availability and performance, providing off-hours support when needed. Document systems, processes, and runbooks for efficient troubleshooting and knowledge sharing. Conduct post-mortem analyses to drive continuous improvement in our systems and processes. Qualifications Required Qualifications: 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field OR equivalent experience. Experience in site reliability engineering principles, including monitoring, alerting, and automation. 1+ year(s) experience with cloud infrastructure, containerization, and CI/CD pipelines. Preferred Qualifications: Experience in working with a remote, distributed team. Experience with the Rust and Go programming language ecosystems. Familiarity with emerging AI concepts (e.g., LLMs, embeddings) and related challenges. Familiarity with observability tools and incident response platforms. Knowledge of open-source software and experience contributing to open-source projects. Compensation Range The base salary range for this job is USD $97,900.00 - USD $259,900.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications: 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field OR equivalent experience. Experience in site reliability engineering principles, including monitoring, alerting, and automation. 1+ year(s) experience with cloud infrastructure, containerization, and CI/CD pipelines. Preferred Qualifications: Experience in working with a remote, distributed team. Experience with the Rust and Go programming language ecosystems. Familiarity with emerging AI concepts (e.g., LLMs, embeddings) and related challenges. Familiarity with observability tools and incident response platforms. Knowledge of open-source software and experience contributing to open-source projects.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Maintain and improve automation tooling for deployment, configuration management, and system maintenance. Implement and enhance monitoring, logging, and alerting solutions to maintain system health and performance. Help with incident response efforts, performing root cause analysis and implementing measures to prevent future incidents. Collaborate with the team to address scalability issues, optimize system performance, and improve reliability. Participate in on-call rotations with the team to support system availability and performance, providing off-hours support when needed. Document systems, processes, and runbooks for efficient troubleshooting and knowledge sharing. Conduct post-mortem analyses to drive continuous improvement in our systems and processes.","posted_date":"2024-09-25T14:22:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/3496/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/104598252732457670","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"1e1942354b25206b7bd74303146f0afe","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"Maintain and improve automation tooling for deployment, configuration management, and system maintenance. Implement and enhance monitoring, logging, and alerting solutions to maintain system health and performance. Help with incident response efforts, performing root cause analysis and implementing measures to prevent future incidents. Collaborate with the team to address scalability issues, optimize system performance, and improve reliability. Participate in on-call rotations with the team to support system availability and performance, providing off-hours support when needed. Document systems, processes, and runbooks for efficient troubleshooting and knowledge sharing. Conduct post-mortem analyses to drive continuous improvement in our systems and processes.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-10-14T18:41:29Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-09-25T14:22:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9"},"revision_int":5,"uuid":"a0835bf7-42e2-4bf4-bc4c-40039da9983b"},"import_id":"b534933e-e71c-4d3a-9327-ad688af179a2","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3496?lang=en-us","last_mod":"2024-10-14T18:41:51+0000","gdpr":false},"update_date":"2024-10-14T18:41:51+0000","create_date":"2024-09-25T14:28:56+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"3088","language":"en-us","languages":["en-us"],"req_id":"3088","title":"Staff Software Engineer - Search","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview GitHub is changing the way the world builds software, and we want you to help! We’re looking for a Staff level Software Engineer to join the Code Search team. More of the world’s development data lives on GitHub than anywhere else. Helping developers navigate and understand that data is a core part of GitHub’s mission, and an area with significant potential we’ve only begun to realize. We have high aspirations for how we can help developers understand and navigate code, and for making collaboration more seamless. The foundation for these efforts is our highly scalable code search engine, which we are now expanding to help power semantic/vector search to better support many of GitHub’s AI experiences. In this role, you will have the opportunity to be part of the team that’s reinventing the platform and infrastructure that millions of developers depend on for -- re-thinking everything from the experience to the system architecture supporting it. You will be involved in the design, rollout, and support of a highly performant, highly scalable and highly available search platform with your team. Code search, semantic search and AI are a complex, cutting edge problem space and you will help your senior team navigate uncertainty and make effective implementation tradeoff decisions, relying on careful reasoning and decision making around a significant infrastructure budget. Together we are creating the tools and products that are integral to how people build software. We pride ourselves on being thoughtful, intentional, and productive. We value learning, introspection and reflection, and we’re always looking for ways to improve as a team and as individuals. Responsibilities Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support a highly available service used by millions of users on a daily basis Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Help ensure that individuals on the team are learning, growing and advancing in their respective careers Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you Qualifications Required Qualifications: Several years of proficiency in Rust, C or C++ Several years of proficiency in systems programming, search index internals and information retrieval Experience designing, building, scaling and maintaining large-scale distributed systems Experience designing and implementing data structures and algorithms Preferred Qualifications: Experience effectively contributing to technical strategy and roadmaps Passionate about fostering good engineering practices and processes Solid understanding of testing principles and high quality software Understanding of production system monitoring and observability Troubleshooting skills across network, application, caching, queuing, load-balancing, storage and distributed services layers. Excellent analytical skills as well as communication skills both verbal and written. We’re a distributed team so we’re extra mindful about communication. Strong customer focus and data driven approach GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"United Kingdom Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: Several years of proficiency in Rust, C or C++ Several years of proficiency in systems programming, search index internals and information retrieval Experience designing, building, scaling and maintaining large-scale distributed systems Experience designing and implementing data structures and algorithms Preferred Qualifications: Experience effectively contributing to technical strategy and roadmaps Passionate about fostering good engineering practices and processes Solid understanding of testing principles and high quality software Understanding of production system monitoring and observability Troubleshooting skills across network, application, caching, queuing, load-balancing, storage and distributed services layers. Excellent analytical skills as well as communication skills both verbal and written. We’re a distributed team so we’re extra mindful about communication. Strong customer focus and data driven approach","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support a highly available service used by millions of users on a daily basis Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Help ensure that individuals on the team are learning, growing and advancing in their respective careers Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you","posted_date":"2024-07-12T19:06:00+0000","apply_url":"https://globalcareers-githubinc.icims.com/jobs/3088/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/96523746461786822","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"47f18799785678fd84192fac5c1b50fa","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support a highly available service used by millions of users on a daily basis Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Help ensure that individuals on the team are learning, growing and advancing in their respective careers Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-08-28T21:04:05Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-07-12T19:06:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":3,"uuid":"75b7c161-9b1f-4da3-a334-741ebef47f8c"},"import_id":"93f3915a-edba-4411-a269-a9b76d2c5f15","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3088?lang=en-us","last_mod":"2024-08-28T21:04:15+0000","gdpr":true},"update_date":"2024-08-28T21:04:15+0000","create_date":"2024-07-12T19:11:56+0000","category":[" Engineering"],"full_location":"United Kingdom","short_location":"United Kingdom","multipleLocations":false}},{"data":{"slug":"3582","language":"en-us","languages":["en-us"],"req_id":"3582","title":"Staff Manager, Machine Learning (Copilot)","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview We are looking for a manager to lead our Model Development and Evaluation team within GitHub Copilot Applied Science, where you'll make a high-impact contribution to the capabilities and quality of GitHub Copilot. In this role, you'll manage a team of machine learning researchers and engineers to advance and produce state-of-the-art LLMs for code, working closely with engineering, product management, and leadership to drive innovation. You'll play a key role in shaping GitHub Copilot's future by improving AI-driven developer tools used by millions globally, directly influencing the product's features, performance, and user experience. This role requires a deep understanding of LLM model training and evaluation and a solid ability to lead cross-functional teams on complex technical projects. As part of GitHub, a company committed to empowering developers and fostering open-source innovation, you'll contribute to a culture of diversity, inclusion, and collaboration. Your work will help developers worldwide be more productive and creative, aligned with GitHub's mission to advance the software development community. You will report to the Director of Applied Science and collaborate across teams to ensure that research aligns with GitHub Copilot's broader product and company goals, with opportunities for career growth and leadership development in a flexible, distributed work environment. Responsibilities A day in the life: Our team and partners are distributed worldwide, working asynchronously and in real-time. Your typical week would include: Collaborate with engineering, product, stakeholders, and leadership to define and prioritize critical problems for GitHub Copilot, ensuring alignment on high-impact goals. Remove blockers for the team through real-time and asynchronous communication via Slack, Zoom, GitHub Issues, PRs, and Discussions. Guide the team's technical direction, selecting the best research opportunities, data curation approaches, and model evaluation strategies to drive innovation. Communicate progress, risks, and successes to stakeholders, ensuring consistent progress toward goals and managing high-impact outcomes. Lead cross-functional collaboration to improve workflows, foster alignment across teams, and ensure that advanced technologies are applied practically to meet business objectives. Conduct 1:1s with team members, providing regular feedback, identifying development opportunities, and supporting career growth through impactful projects and continuous learning. Drive informed, strategic decision-making, ensuring that the team's work contributes to the success of GitHub Copilot and aligns with broader organizational goals. Anticipate and address model challenges, providing proactive solutions to ensure machine learning models perform according to critical metrics and expected outcomes. Leverage and integrate existing research approaches to solve immediate product challenges and bring long-term AI innovations into production. Qualifications Required Qualifications 8+ years experience in software development, applied science, machine learning, or related field OR Bachelor's Degree in Computer Science, Software Development, Electrical or Computer Engineering, Mathematical Sciences, or related field AND 6+ years experience in software development, applied science, machine learning, or related field OR Master's Degree in Machine Learning, Computer Science, Software Development, Electrical or Computer Engineering, Mathematical Sciences, or related field AND 4+ years experience in software development, applied science, machine learning, or related field OR Doctorate in Machine Learning, Computer Science, Software Development, Electrical or Computer Engineering, Mathematical Sciences, or related field AND 2+ years experience in software development, applied science, machine learning, or related field OR equivalent experience. 1+ years people management experience 5+ years experience with machine learning models and experimentation 2+ years experience with cross-team project leadership Preferred Qualifications Master's Degree in Machine Learning, Computer Science, Software Development, Electrical or Computer Engineering, Mathematical Sciences, or related field AND 7+ years experience in software development, applied science, machine learning, or related field Experience recruiting and retaining healthy teams, managing performance, and calibrating expectations Experience working remotely and leading distributed teams Experience working with LLMs for code generation Compensation Range The base salary range for this job is USD $127,600.00 - USD $338,500.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Director"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications 8+ years experience in software development, applied science, machine learning, or related field OR Bachelor's Degree in Computer Science, Software Development, Electrical or Computer Engineering, Mathematical Sciences, or related field AND 6+ years experience in software development, applied science, machine learning, or related field OR Master's Degree in Machine Learning, Computer Science, Software Development, Electrical or Computer Engineering, Mathematical Sciences, or related field AND 4+ years experience in software development, applied science, machine learning, or related field OR Doctorate in Machine Learning, Computer Science, Software Development, Electrical or Computer Engineering, Mathematical Sciences, or related field AND 2+ years experience in software development, applied science, machine learning, or related field OR equivalent experience. 1+ years people management experience 5+ years experience with machine learning models and experimentation 2+ years experience with cross-team project leadership Preferred Qualifications Master's Degree in Machine Learning, Computer Science, Software Development, Electrical or Computer Engineering, Mathematical Sciences, or related field AND 7+ years experience in software development, applied science, machine learning, or related field Experience recruiting and retaining healthy teams, managing performance, and calibrating expectations Experience working remotely and leading distributed teams Experience working with LLMs for code generation","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"A day in the life: Our team and partners are distributed worldwide, working asynchronously and in real-time. Your typical week would include: Collaborate with engineering, product, stakeholders, and leadership to define and prioritize critical problems for GitHub Copilot, ensuring alignment on high-impact goals. Remove blockers for the team through real-time and asynchronous communication via Slack, Zoom, GitHub Issues, PRs, and Discussions. Guide the team's technical direction, selecting the best research opportunities, data curation approaches, and model evaluation strategies to drive innovation. Communicate progress, risks, and successes to stakeholders, ensuring consistent progress toward goals and managing high-impact outcomes. Lead cross-functional collaboration to improve workflows, foster alignment across teams, and ensure that advanced technologies are applied practically to meet business objectives. Conduct 1:1s with team members, providing regular feedback, identifying development opportunities, and supporting career growth through impactful projects and continuous learning. Drive informed, strategic decision-making, ensuring that the team's work contributes to the success of GitHub Copilot and aligns with broader organizational goals. Anticipate and address model challenges, providing proactive solutions to ensure machine learning models perform according to critical metrics and expected outcomes. Leverage and integrate existing research approaches to solve immediate product challenges and bring long-term AI innovations into production.","posted_date":"2024-10-22T14:43:00+0000","posting_expiry_date":"2024-11-30T06:00:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/3582/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/135195386342974150","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"8c934353ca6d0bf19736f622fb97f38f","derivedInfo":{"jobCategories":["MANAGEMENT","HUMAN_RESOURCES","EDUCATION"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"A day in the life: Our team and partners are distributed worldwide, working asynchronously and in real-time. Your typical week would include: Collaborate with engineering, product, stakeholders, and leadership to define and prioritize critical problems for GitHub Copilot, ensuring alignment on high-impact goals. Remove blockers for the team through real-time and asynchronous communication via Slack, Zoom, GitHub Issues, PRs, and Discussions. Guide the team's technical direction, selecting the best research opportunities, data curation approaches, and model evaluation strategies to drive innovation. Communicate progress, risks, and successes to stakeholders, ensuring consistent progress toward goals and managing high-impact outcomes. Lead cross-functional collaboration to improve workflows, foster alignment across teams, and ensure that advanced technologies are applied practically to meet business objectives. Conduct 1:1s with team members, providing regular feedback, identifying development opportunities, and supporting career growth through impactful projects and continuous learning. Drive informed, strategic decision-making, ensuring that the team's work contributes to the success of GitHub Copilot and aligns with broader organizational goals. Anticipate and address model challenges, providing proactive solutions to ensure machine learning models perform according to critical metrics and expected outcomes. Leverage and integrate existing research approaches to solve immediate product challenges and bring long-term AI innovations into production.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-10-25T22:38:34Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-10-22T14:43:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9","validThrough":"2024-11-30T06:00:00+0000"},"revision_int":2,"uuid":"42aa65bf-9d89-4ecd-97b6-d8995a7f39f9"},"import_id":"c4ee6135-881c-402f-ab5c-e4a2bcb6175d","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3582?lang=en-us","last_mod":"2024-10-25T22:39:31+0000","gdpr":false},"update_date":"2024-10-25T22:39:31+0000","create_date":"2024-10-22T14:49:31+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"3244","language":"en-us","languages":["en-us"],"req_id":"3244","title":"Software Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview As a software engineer at GitHub, you will enhance the collaboration experience at GitHub by working closely with a community of engineers and designers with a distributed, diverse and passionate team delivering the services that millions of developers depend on. In this role you will design, prototype, implement, ship and support highly performant and inspiring user experiences with your team. We are looking for creative problem solvers and diverse thinkers, people who care about culture as well as customers and features. We believe that how we do things is as important as what we do. Big vision, a common purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what lead to great results. Great products reflect the teams that build them. Responsibilities Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Receive technical mentorship, collaborate and pair with others, provide code reviews, and communicate clearly to your leadership about progress, blockers, and gaps. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code. Qualifications Required Qualifications Experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, or related field OR equivalent experience. Preferred Qualifications Experience with Git and GitHub Experience using Azure technologies is a bonus Experience using front-end frameworks like React.js Understanding of REST principles and experience with backend APIs Strong written and verbal communication skill Passionate about healthy team culture and collaboration Comfortable working transparently in an agile environment and soliciting feedback from peers. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"United Kingdom Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications Experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, or related field OR equivalent experience. Preferred Qualifications Experience with Git and GitHub Experience using Azure technologies is a bonus Experience using front-end frameworks like React.js Understanding of REST principles and experience with backend APIs Strong written and verbal communication skill Passionate about healthy team culture and collaboration Comfortable working transparently in an agile environment and soliciting feedback from peers.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Receive technical mentorship, collaborate and pair with others, provide code reviews, and communicate clearly to your leadership about progress, blockers, and gaps. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","posted_date":"2024-08-07T21:15:00+0000","apply_url":"https://globalcareers-githubinc.icims.com/jobs/3244/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/86162782910587590","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"09e9a19b97321968ab7fb5f1329931ff","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Receive technical mentorship, collaborate and pair with others, provide code reviews, and communicate clearly to your leadership about progress, blockers, and gaps. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-10-29T15:05:46Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-08-07T21:15:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":34,"uuid":"de65e6d3-f918-423c-bcf8-f72761bd6815"},"import_id":"93aaf357-0146-4258-a03e-b609e2e33b34","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3244?lang=en-us","last_mod":"2024-10-29T15:06:33+0000","gdpr":true},"update_date":"2024-10-29T15:06:33+0000","create_date":"2024-08-07T21:21:00+0000","category":[" Engineering"],"full_location":"United Kingdom","short_location":"United Kingdom","multipleLocations":false}},{"data":{"slug":"3319","language":"en-us","languages":["en-us"],"req_id":"3319","title":"Software Engineer II","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview As a software engineer at GitHub, you will enhance the collaboration experience at GitHub by working closely with a community of engineers and designers with a distributed, diverse and passionate team delivering the services that millions of developers depend on. In this role you will design, prototype, implement, ship and support highly performant and inspiring user experiences with your team. We are looking for creative problem solvers and diverse thinkers, people who care about culture as well as customers and features. We believe that how we do things is as important as what we do. Big vision, a common purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what lead to great results. Great products reflect the teams that build them. Responsibilities Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code. Qualifications Required Qualifications Experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, or related field OR equivalent experience. Preferred Qualifications Experience with Git and GitHub Experience using Azure technologies is a bonus Experience using front-end frameworks like React.js Understanding of REST principles and experience with backend APIs Strong written and verbal communication skill Passionate about healthy team culture and collaboration Comfortable working transparently in an agile environment and soliciting feedback from peers. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"United Kingdom Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications Experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, or related field OR equivalent experience. Preferred Qualifications Experience with Git and GitHub Experience using Azure technologies is a bonus Experience using front-end frameworks like React.js Understanding of REST principles and experience with backend APIs Strong written and verbal communication skill Passionate about healthy team culture and collaboration Comfortable working transparently in an agile environment and soliciting feedback from peers.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","posted_date":"2024-08-22T20:09:00+0000","apply_url":"https://globalcareers-githubinc.icims.com/jobs/3319/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/73105548009972422","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"67dafed748573a76da1b8dfccd067adb","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-10-28T16:20:16Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-08-22T20:09:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":21,"uuid":"9262338a-1233-47f2-bed4-cc7f529e0e9c"},"import_id":"cb3d097d-9276-4e10-ae1c-57371faa132c","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3319?lang=en-us","last_mod":"2024-10-28T16:20:34+0000","gdpr":true},"update_date":"2024-10-28T16:20:34+0000","create_date":"2024-08-22T20:15:36+0000","category":[" Engineering"],"full_location":"United Kingdom","short_location":"United Kingdom","multipleLocations":false}},{"data":{"slug":"3624","language":"en-us","languages":["en-us"],"req_id":"3624","title":"Senior Software Engineer, Copilot Workspace","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview As a software engineer at GitHub, you will enhance the collaboration experience at GitHub by working closely with a community of engineers and designers with a distributed, diverse and passionate team delivering the services that millions of developers depend on. In this role you will design, prototype, implement, ship and support highly performant and inspiring user experiences with your team. We are looking for creative problem solvers and diverse thinkers, people who care about culture as well as customers and features. We believe that how we do things is as important as what we do. Big vision, a common purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what lead to great results. Great products reflect the teams that build them. Responsibilities Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code. Qualifications Required Qualifications: 6+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field. OR equivalent experience. Experience in working with Large Language Models (LLMs) for tasks such as code generation, natural language understanding, or building AI-driven development tools. Familiarity with fine-tuning, prompt engineering, and integrating LLMs into engineering workflows. Preferred Qualifications: Experience with frontend development using React, along with a solid understanding of Ruby for building web applications. Ability to design and implement responsive, user-friendly interfaces and integrate them with backend services. Experience in cloud-native development, including designing, building, and deploying scalable applications using microservices architecture, containers (e.g., Docker), and orchestration tools like Kubernetes. Proficiency in leveraging cloud platforms (e.g., AWS, Azure, or GCP) for optimizing application performance and scalability. Proficiency in Git and GitHub for version control and collaborative development and branching strategies. Experience with CI/CD Tools: Strong knowledge of CI/CD concepts and best practices. Experience with GitHub actions and workflows platform, familiar with other tools like Jenkins Compensation Range The base salary range for this job is USD $112,800.00 - USD $299,300.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications: 6+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field. OR equivalent experience. Experience in working with Large Language Models (LLMs) for tasks such as code generation, natural language understanding, or building AI-driven development tools. Familiarity with fine-tuning, prompt engineering, and integrating LLMs into engineering workflows. Preferred Qualifications: Experience with frontend development using React, along with a solid understanding of Ruby for building web applications. Ability to design and implement responsive, user-friendly interfaces and integrate them with backend services. Experience in cloud-native development, including designing, building, and deploying scalable applications using microservices architecture, containers (e.g., Docker), and orchestration tools like Kubernetes. Proficiency in leveraging cloud platforms (e.g., AWS, Azure, or GCP) for optimizing application performance and scalability. Proficiency in Git and GitHub for version control and collaborative development and branching strategies. Experience with CI/CD Tools: Strong knowledge of CI/CD concepts and best practices. Experience with GitHub actions and workflows platform, familiar with other tools like Jenkins","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","posted_date":"2024-10-23T17:02:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/3624/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-10-23T17:07:48Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-10-23T17:02:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9"},"revision_int":1,"uuid":"32acf1e3-2ada-457d-89f0-169dd938521e"},"import_id":"f04ae9f4-b5a9-4234-992b-44cbf1b7eb75","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/jobs/134927994564027078","jobHash":"600d03f75e6e2104cb325ffddab0b294","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/3624?lang=en-us","last_mod":"2024-10-23T17:08:32+0000","gdpr":false},"update_date":"2024-10-23T17:08:32+0000","create_date":"2024-10-23T17:08:32+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"3618","language":"en-us","languages":["en-us"],"req_id":"3618","title":"Software Engineer III Issues Team","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview Join us in shaping the future of project planning and tracking on GitHub! Our team helps customers turn their ideas into reality, innovate, and collaborate throughout the entire project lifecycle. GitHub Issues is a leading service for managing and tracking work right where it happens. Learn more about GitHub’s project management tools on https://github.com/features/issues. Work closely with a diverse and passionate community of engineers to enhance project management on GitHub. Join our distributed team in delivering reliable services to millions of developers worldwide. In this role, you will design, prototype, implement, ship, and support highly performant and engaging user experiences with your team. We seek creative problem solvers and diverse thinkers who care about culture, customers, and features. We believe that how we work is as important as what we do. A big vision, a common purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration lead to great results. Great products reflect the teams that build them. We are looking for a Software Engineer III with a background in backend development to contribute to developing and enhancing our platform to ensure its stability, scalability, and performance. Our team works primarily in Ruby, TypeScript (React) and Golang programming languages and maintains data storage solutions based on SQL and No-SQL databases. We utilize observability and alerting tools such as Splunk, DataDog, and PagerDuty. Responsibilities We work on core services at GitHub and aim to deliver customer value with everything we do. As part of our team you’ll get the opportunity to: Build experiences that millions love and use every day, helping them be more productive and collaborative and influence the future technological foundation of GitHub’s core services. Have a real impact by taking ownership of GitHub.com and contributing to the codebase from day one. Grow your technical skills and learn about other technology stacks and disciplines. Write, review, and maintain code primarily in Ruby, Golang, and TypeScript (React). Design and implement data storage solutions on SQL and No-SQL databases. Conduct post-mortem analyses to drive continuous improvement in our systems and processes and collaborate with the team to address scalability issues, optimize system performance, and improve reliability. Qualifications Required Extensive experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby,Rust, or Python A degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics or Computer Engineering or equivalent experience. Preferred Experience working with a remote, distributed team. Hands-on experience with modern web stacks (e.g., Rails, Go, React, MySQL, GraphQL). Data analytics skills and experience with observability and monitoring tools (e.g. DataDog, Splunk, Sentry, VividCortex, etc.) GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"United Kingdom Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Extensive experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby,Rust, or Python A degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics or Computer Engineering or equivalent experience. Preferred Experience working with a remote, distributed team. Hands-on experience with modern web stacks (e.g., Rails, Go, React, MySQL, GraphQL). Data analytics skills and experience with observability and monitoring tools (e.g. DataDog, Splunk, Sentry, VividCortex, etc.)","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"We work on core services at GitHub and aim to deliver customer value with everything we do. As part of our team you’ll get the opportunity to: Build experiences that millions love and use every day, helping them be more productive and collaborative and influence the future technological foundation of GitHub’s core services. Have a real impact by taking ownership of GitHub.com and contributing to the codebase from day one. Grow your technical skills and learn about other technology stacks and disciplines. Write, review, and maintain code primarily in Ruby, Golang, and TypeScript (React). Design and implement data storage solutions on SQL and No-SQL databases. Conduct post-mortem analyses to drive continuous improvement in our systems and processes and collaborate with the team to address scalability issues, optimize system performance, and improve reliability.","posted_date":"2024-10-30T14:29:00+0000","apply_url":"https://globalcareers-githubinc.icims.com/jobs/3618/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/140969732038632134","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"b3764120042bc89c9522bfe88b3ab8cd","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"We work on core services at GitHub and aim to deliver customer value with everything we do. As part of our team you’ll get the opportunity to: Build experiences that millions love and use every day, helping them be more productive and collaborative and influence the future technological foundation of GitHub’s core services. Have a real impact by taking ownership of GitHub.com and contributing to the codebase from day one. Grow your technical skills and learn about other technology stacks and disciplines. Write, review, and maintain code primarily in Ruby, Golang, and TypeScript (React). Design and implement data storage solutions on SQL and No-SQL databases. Conduct post-mortem analyses to drive continuous improvement in our systems and processes and collaborate with the team to address scalability issues, optimize system performance, and improve reliability.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-10-31T11:08:37Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-10-30T14:29:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":2,"uuid":"f9678068-c6aa-46ad-abed-cee433021985"},"import_id":"d65fb78a-dacd-42a3-950b-88b7f2b69113","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3618?lang=en-us","last_mod":"2024-10-31T11:09:33+0000","gdpr":true},"update_date":"2024-10-31T11:09:33+0000","create_date":"2024-10-30T14:35:34+0000","category":[" Engineering"],"full_location":"United Kingdom","short_location":"United Kingdom","multipleLocations":false}}],"locations":[],"totalCount":18,"request_id":false,"count":18,"languageCounts":{"en-us":{"displayName":"English","count":18}},"filter":{"facetList":{"tags4":[{"term":"Experienced Professional","count":18}],"tags5":[{"term":"Individual Contributor","count":14},{"term":"Director","count":2},{"term":"Senior Manager","count":2}],"tags6":[{"term":"Yes","count":17},{"term":"No","count":1}]},"displayLimit":10,"brands":{"all":[],"shortlist":[]},"categories":{"all":[{"category":"Engineering","numJobs":18}],"shortlist":[{"category":"Engineering","numJobs":18}]},"locations":{"all":[{"city":null,"state":null,"country":"Germany","count":1},{"city":null,"state":null,"country":"United Kingdom","count":5},{"city":null,"state":null,"country":"United States","count":12}],"shortlist":[{"city":null,"state":null,"country":"Germany","count":1},{"city":null,"state":null,"country":"United Kingdom","count":5},{"city":null,"state":null,"country":"United States","count":12}]},"experienceLevels":{"all":[],"shortlist":[]}}}