{"jobs":[{"data":{"slug":"4450","language":"en-us","languages":["en-us"],"req_id":"4450","title":"Principal Software Engineer, Copilot Platform","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is looking for a Principal Software Engineer to join its growing Engineering team. This leadership role involves leading system architecture design, coaching engineering teams, and delivering impactful technical solutions. The ideal candidate will have deep expertise in scalable systems and performance engineering, including tuning and optimizing high-throughput services in production environments. They thrive in cross-functional environments and bring creative, pragmatic solutions to complex engineering challenges. As a Principal Software Engineer on the GitHub Copilot Platform, you will collaborate with a distributed, diverse, and passionate team of engineers and product managers across GitHub and other partners. The GitHub Copilot Platform is crucial for ensuring the quality, scale, and global expansion of Copilot features, maintaining its industry-leading status, and empowering other GitHub engineering teams with seamless integration. You will lead through personal contributions and by coaching others, as well as guiding technical strategy, architectural decisions, and performance optimization across teams. Our goal is to continuously enhance AI-powered capabilities within GitHub and beyond, improving and maintaining the platform that integrators depend on in their development cycles. We operate in a culture that values developer empathy, transparency, and inclusive collaboration, where curiosity and impact drive everything we build. Responsibilities Lead and influence system architecture design for complex products and solutions, ensuring they meet security, compliance, and performance requirements. Establish and mentor best practices for testing, performance tuning, and code quality, defining success metrics and ensuring maintainability across dependencies. Provide technical leadership during code reviews to ensure reliability, scalability, and alignment with product goals. Partner with product managers and technical leads to define service requirements and incorporate feedback into future designs. Act as an expert in debugging tools and methods, leading proactive and reactive development to resolve issues across teams. Optimize deployments and runtime performance to meet business objectives, ensuring safe rollouts aligned with GitHub’s standards. Drive improvements in development quality and team performance through tooling, automation, and knowledge sharing. Lead product refinement through telemetry analysis, performance metrics, and experimentation frameworks to inform engineering decisions. Develop strategies to identify and mitigate technical risks, including frameworks for risk assessment and contingency planning. Shape the strategic vision for technology and product development, identifying opportunities for innovation and leading initiatives aligned with GitHub’s long-term goals. Qualifications Required Qualifications: 11+ years' experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 10+ years' experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR Bachelor's Degree in Computer Science or related field AND 9+ years' experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 7+ years' experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years' experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR equivalent experience. Experience contributing technical solutions to high throughput services in production environments, such as systems profiling tools and distributed systems performance tuning. Preferred Qualifications: Proven experience designing and operating high-throughput cloud-native distributed systems in production environments. Deep understanding of performance profiling, observability, and telemetry-driven optimization, especially in Go or similar languages Experience integrating machine learning or generative AI capabilities into production systems. Experience driving cross-functional projects in close partnership with product management, design, and engineering teams. Strong communication and leadership skills, with a track record of mentoring senior engineers and influencing engineering culture. Compensation Range The base salary range for this job is USD $145,600.00 - USD $386,400.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"tags7":["US Careers (External)"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 11+ years' experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 10+ years' experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR Bachelor's Degree in Computer Science or related field AND 9+ years' experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 7+ years' experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years' experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR equivalent experience. Experience contributing technical solutions to high throughput services in production environments, such as systems profiling tools and distributed systems performance tuning. Preferred Qualifications: Proven experience designing and operating high-throughput cloud-native distributed systems in production environments. Deep understanding of performance profiling, observability, and telemetry-driven optimization, especially in Go or similar languages Experience integrating machine learning or generative AI capabilities into production systems. Experience driving cross-functional projects in close partnership with product management, design, and engineering teams. Strong communication and leadership skills, with a track record of mentoring senior engineers and influencing engineering culture.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Lead and influence system architecture design for complex products and solutions, ensuring they meet security, compliance, and performance requirements. Establish and mentor best practices for testing, performance tuning, and code quality, defining success metrics and ensuring maintainability across dependencies. Provide technical leadership during code reviews to ensure reliability, scalability, and alignment with product goals. Partner with product managers and technical leads to define service requirements and incorporate feedback into future designs. Act as an expert in debugging tools and methods, leading proactive and reactive development to resolve issues across teams. Optimize deployments and runtime performance to meet business objectives, ensuring safe rollouts aligned with GitHub’s standards. Drive improvements in development quality and team performance through tooling, automation, and knowledge sharing. Lead product refinement through telemetry analysis, performance metrics, and experimentation frameworks to inform engineering decisions. Develop strategies to identify and mitigate technical risks, including frameworks for risk assessment and contingency planning. Shape the strategic vision for technology and product development, identifying opportunities for innovation and leading initiatives aligned with GitHub’s long-term goals.","posted_date":"2025-09-03T15:29:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/4450/login","internal":false,"external":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"last_mod":"2025-09-03T15:47:46.582+00:00","icims":{"jps_is_public":true,"date_updated":"2025-09-03T15:46:48Z","primary_posted_site_object":{"site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9","datePosted":"2025-09-03T15:29:00+0000"},"config_keys":null,"revision_int":2,"uuid":"c84e57d0-1432-4c5a-8aba-cb5b249b89eb"},"googlejobs":{"jobName":"projects/helpful-passage-853/jobs/140910098078671558","jobTitleSnippet":"","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","searchTextSnippet":"","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"radiusInMiles":2.6691467883166546,"postalAddress":{"regionCode":"US","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["United States"],"administrativeArea":"","languageCode":"","revision":0},"locationType":"COUNTRY","latLng":{"latitude":38.7945952,"longitude":-106.5348379}}]},"jobHash":"9e0e8010c854f1cfb72c8ebf3d7e835d","jobSummary":"Lead and influence system architecture design for complex products and solutions, ensuring they meet security, compliance, and performance requirements. Establish and mentor best practices for testing, performance tuning, and code quality, defining success metrics and ensuring maintainability across dependencies. Provide technical leadership during code reviews to ensure reliability, scalability, and alignment with product goals. Partner with product managers and technical leads to define service requirements and incorporate feedback into future designs. Act as an expert in debugging tools and methods, leading proactive and reactive development to resolve issues across teams. Optimize deployments and runtime performance to meet business objectives, ensuring safe rollouts aligned with GitHub’s standards. Drive improvements in development quality and team performance through tooling, automation, and knowledge sharing. Lead product refinement through telemetry analysis, performance metrics, and experimentation frameworks to inform engineering decisions. Develop strategies to identify and mitigate technical risks, including frameworks for risk assessment and contingency planning. Shape the strategic vision for technology and product development, identifying opportunities for innovation and leading initiatives aligned with GitHub’s long-term goals."},"import_id":"6f0d1690-06eb-4312-ab3f-8082b7a179a8","redirectOnApply":true,"import_source":"ImporterService","canonical_url":"https://githubinc.jibeapply.com/jobs/4450?lang=en-us","client_code":"githubinc","gdpr":false},"update_date":"2025-09-03T15:47:46+0000","create_date":"2025-09-03T15:29:47+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"4494","language":"en-us","languages":["en-us"],"req_id":"4494","title":"Senior Engineering Manager, Mobile","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub Mobile empowers developers to stay connected, productive, and collaborative on the go. Our iOS and Android apps bring the power of GitHub directly to mobile devices, helping millions of developers review code, manage issues, and stay engaged with their projects anytime, anywhere. We are seeking an experienced Senior Engineering Manager to lead a team building and scaling GitHub’s Mobile experiences. This role is pivotal in shaping how developers interact with GitHub across device platforms, ensuring stability, usability, and delight in our mobile apps. As a Senior Engineering Manager for Github Mobile, you will: Foster a collaborative environment where engineers, product managers, and designers work together to deliver meaningful outcomes. Cultivate a culture of inclusivity, psychological safety, and sustainable delivery, where team members feel empowered to do their best work. Provide mentorship and guidance to engineers, supporting their career development and growth. Partner closely with peers across GitHub to deliver high-quality, resilient, and user-centered mobile products. Promote engineering excellence and innovation, ensuring the team continuously improves technical practices and approaches challenges with creativity. This is a highly collaborative and distributed role—your team will span North America and Europe, including time zones from the US West Coast to Germany. You’ll thrive in a remote-first environment using both synchronous (including meetings across these time zones) and asynchronous communication effectively. Responsibilities Lead a distributed team by conducting regular 1:1s across time zones from the U.S. West Coast to Germany, providing feedback, mentorship, and career growth opportunities, and fostering a healthy, inclusive, high-performing culture. Partner with engineering, product management, and design to align on priorities, requirements, and customer needs for GitHub’s mobile experiences. Coach the team to improve processes, architecture, and delivery practices through both real-time collaboration and asynchronous tools (GitHub Issues, PRs, Discussions, Projects). Ensure the team consistently delivers well-designed systems, reliable code, and high-quality user experiences. Coach others to understand the customer need via data interpretation (e.g., metrics, bugs, customer feedback), identify problems and/or trends for resolution, and other actionable metrics of value. Guide the team to iteratively ship features and bug fixes that balance speed, quality, and long-term velocity. Solve complex challenges by providing creative solutions that advance the team’s goals and improve resilience. Drive innovation by encouraging exploration of new tools, methodologies, and approaches that enhance mobile delivery. Facilitate inclusive discussions so diverse perspectives are heard in technical and product decision-making. Communicate progress, findings, risks, team health, and customer impact clearly to stakeholders and leadership. Recruit, onboard, and develop top engineering talent, fostering a culture of innovation, continuous learning, and sustainable practices. Qualifications Required Qualifications 6+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field OR equivalent experience. 1+ year(s) direct and/or indirect people management or leadership experience. Preferred Qualifications Experience leading mobile engineering teams or working with mobile platforms (iOS and/or Android). Demonstrated ability to build collaborative partnerships across engineering, product, and design. Strong people management experience, with a proven ability to lead engineering teams while building inclusive, high-performing cultures and fostering effective, sustainable engineering practices. Demonstrated success coaching and developing engineers to achieve their full potential. High emotional intelligence and empathy, with the ability to address interpersonal issues constructively and promote team health. Strong project leadership skills: balancing priorities, managing dependencies, and ensuring successful delivery of complex initiatives. Excellent written and verbal communication skills, with the ability to thrive in a distributed, remote-first environment and communicate effectively with both peers and leadership. Compensation Range The base salary range for this job is USD $112,800.00 - USD $299,300.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Senior Manager"],"tags6":["Yes"],"tags7":["US Careers (External)"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications 6+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field OR equivalent experience. 1+ year(s) direct and/or indirect people management or leadership experience. Preferred Qualifications Experience leading mobile engineering teams or working with mobile platforms (iOS and/or Android). Demonstrated ability to build collaborative partnerships across engineering, product, and design. Strong people management experience, with a proven ability to lead engineering teams while building inclusive, high-performing cultures and fostering effective, sustainable engineering practices. Demonstrated success coaching and developing engineers to achieve their full potential. High emotional intelligence and empathy, with the ability to address interpersonal issues constructively and promote team health. Strong project leadership skills: balancing priorities, managing dependencies, and ensuring successful delivery of complex initiatives. Excellent written and verbal communication skills, with the ability to thrive in a distributed, remote-first environment and communicate effectively with both peers and leadership.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Lead a distributed team by conducting regular 1:1s across time zones from the U.S. West Coast to Germany, providing feedback, mentorship, and career growth opportunities, and fostering a healthy, inclusive, high-performing culture. Partner with engineering, product management, and design to align on priorities, requirements, and customer needs for GitHub’s mobile experiences. Coach the team to improve processes, architecture, and delivery practices through both real-time collaboration and asynchronous tools (GitHub Issues, PRs, Discussions, Projects). Ensure the team consistently delivers well-designed systems, reliable code, and high-quality user experiences. Coach others to understand the customer need via data interpretation (e.g., metrics, bugs, customer feedback), identify problems and/or trends for resolution, and other actionable metrics of value. Guide the team to iteratively ship features and bug fixes that balance speed, quality, and long-term velocity. Solve complex challenges by providing creative solutions that advance the team’s goals and improve resilience. Drive innovation by encouraging exploration of new tools, methodologies, and approaches that enhance mobile delivery. Facilitate inclusive discussions so diverse perspectives are heard in technical and product decision-making. Communicate progress, findings, risks, team health, and customer impact clearly to stakeholders and leadership. Recruit, onboard, and develop top engineering talent, fostering a culture of innovation, continuous learning, and sustainable practices.","posted_date":"2025-09-09T20:40:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/4494/login","internal":false,"external":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"last_mod":"2025-09-09T22:09:32.854+00:00","icims":{"jps_is_public":true,"date_updated":"2025-09-09T22:09:24Z","primary_posted_site_object":{"site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9","datePosted":"2025-09-09T20:40:00+0000"},"config_keys":null,"revision_int":2,"uuid":"f386d600-4e8a-4cad-8194-e9c89ee57f05"},"googlejobs":{"jobName":"projects/helpful-passage-853/jobs/130676561106870982","jobTitleSnippet":"","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","searchTextSnippet":"","derivedInfo":{"jobCategories":["MANAGEMENT","COMPUTER_AND_IT"],"locations":[{"radiusInMiles":2.6691467883166546,"postalAddress":{"regionCode":"US","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["United States"],"administrativeArea":"","languageCode":"","revision":0},"locationType":"COUNTRY","latLng":{"latitude":38.7945952,"longitude":-106.5348379}}]},"jobHash":"dc268e49e1afd566efd5dbc97e48707f","jobSummary":"Lead a distributed team by conducting regular 1:1s across time zones from the U.S. West Coast to Germany, providing feedback, mentorship, and career growth opportunities, and fostering a healthy, inclusive, high-performing culture. Partner with engineering, product management, and design to align on priorities, requirements, and customer needs for GitHub’s mobile experiences. Coach the team to improve processes, architecture, and delivery practices through both real-time collaboration and asynchronous tools (GitHub Issues, PRs, Discussions, Projects). Ensure the team consistently delivers well-designed systems, reliable code, and high-quality user experiences. Coach others to understand the customer need via data interpretation (e.g., metrics, bugs, customer feedback), identify problems and/or trends for resolution, and other actionable metrics of value. Guide the team to iteratively ship features and bug fixes that balance speed, quality, and long-term velocity. Solve complex challenges by providing creative solutions that advance the team’s goals and improve resilience. Drive innovation by encouraging exploration of new tools, methodologies, and approaches that enhance mobile delivery. Facilitate inclusive discussions so diverse perspectives are heard in technical and product decision-making. Communicate progress, findings, risks, team health, and customer impact clearly to stakeholders and leadership. Recruit, onboard, and develop top engineering talent, fostering a culture of innovation, continuous learning, and sustainable practices."},"import_id":"0d7a1364-4287-4943-a7a9-4c119c364ec0","redirectOnApply":true,"import_source":"ImporterService","canonical_url":"https://githubinc.jibeapply.com/jobs/4494?lang=en-us","client_code":"githubinc","gdpr":false},"update_date":"2025-09-09T22:09:32+0000","create_date":"2025-09-09T20:41:31+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"4444","language":"en-us","languages":["en-us"],"req_id":"4444","title":"Software Engineer III, Projects","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub Projects is building the future of team collaboration on software projects. Teams often face challenges in communicating and organizing work effectively. Our goal is to improve the software development lifecycle by creating tools that teams love to use. We are committed to fostering an environment where our employees can do the best work of their careers. As part of this team, you’ll collaborate across functions and teams to deliver industry-leading tools that empower developers and organizations. In this role, you’ll work as an engineer on a distributed, diverse, and passionate team, where independence and a drive for results are essential. You’ll design, implement, roll out, and support highly performant, scalable, and available features alongside talented software engineering professionals. We’re looking for creative problem-solvers and diverse thinkers who are passionate about helping teams work better together. Big vision, shared purpose, commitment to quality, curiosity, and a collaborative spirit drive our success. We embrace pair or mob programming but also lean on asynchronous communication to ensure that everyone can contribute in a way that works for them. Great products reflect the teams that build them—come join us! Responsibilities Stay current with emerging technologies, security standards, and best practices to ensure high-quality software development. You will primarily be working in TypeScript (React) and Ruby. Experience with GraphQL, Elasticsearch, and MySQL is a plus. Collaborate with stakeholders to understand requirements and incorporate feedback into designs and solutions. Design and implement scalable, secure, and reliable features, considering performance, availability, and compliance requirements. Write clean, maintainable, and extensible code following best practices; participate in code reviews to ensure quality. Debug and resolve issues proactively using telemetry, logs, and root cause analysis. Contribute to project planning by estimating work, identifying dependencies, and supporting safe deployments. Monitor and maintain live services, responding to incidents within defined SLAs and improving system health through telemetry and scorecards. Support continuous improvement through instrumentation, automation, and process enhancements for reliability and efficiency. Qualifications Required Qualifications 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field OR equivalent experience Preferred Qualifications Strong familiarity with TypeScript and React including the ecosystem of tools including testing and state management. Solid understanding of testing principles and high quality software Experience with Elasticsearch or equivalent search technology A passion for and understanding of accessibility Experience with Ruby on Rails or other web frameworks Compensation Range The base salary range for this job is USD $97,900.00 - USD $259,900.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"tags7":["US Careers (External)"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field OR equivalent experience Preferred Qualifications Strong familiarity with TypeScript and React including the ecosystem of tools including testing and state management. Solid understanding of testing principles and high quality software Experience with Elasticsearch or equivalent search technology A passion for and understanding of accessibility Experience with Ruby on Rails or other web frameworks","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Stay current with emerging technologies, security standards, and best practices to ensure high-quality software development. You will primarily be working in TypeScript (React) and Ruby. Experience with GraphQL, Elasticsearch, and MySQL is a plus. Collaborate with stakeholders to understand requirements and incorporate feedback into designs and solutions. Design and implement scalable, secure, and reliable features, considering performance, availability, and compliance requirements. Write clean, maintainable, and extensible code following best practices; participate in code reviews to ensure quality. Debug and resolve issues proactively using telemetry, logs, and root cause analysis. Contribute to project planning by estimating work, identifying dependencies, and supporting safe deployments. Monitor and maintain live services, responding to incidents within defined SLAs and improving system health through telemetry and scorecards. Support continuous improvement through instrumentation, automation, and process enhancements for reliability and efficiency.","posted_date":"2025-09-08T16:41:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/4444/login","internal":false,"external":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"last_mod":"2025-09-08T16:42:31.311+00:00","icims":{"jps_is_public":true,"date_updated":"2025-09-08T16:42:14Z","primary_posted_site_object":{"site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9","datePosted":"2025-09-08T16:41:00+0000"},"config_keys":null,"revision_int":1,"uuid":"02d6a081-494b-4364-8793-712e52d8ad36"},"googlejobs":{"jobName":"projects/helpful-passage-853/jobs/84096206262674118","jobTitleSnippet":"","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","searchTextSnippet":"","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"radiusInMiles":2.6691467883166546,"postalAddress":{"regionCode":"US","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["United States"],"administrativeArea":"","languageCode":"","revision":0},"locationType":"COUNTRY","latLng":{"latitude":38.7945952,"longitude":-106.5348379}}]},"jobHash":"ae0198373b8243412b348ad8745efc74","jobSummary":"Stay current with emerging technologies, security standards, and best practices to ensure high-quality software development. You will primarily be working in TypeScript (React) and Ruby. Experience with GraphQL, Elasticsearch, and MySQL is a plus. Collaborate with stakeholders to understand requirements and incorporate feedback into designs and solutions. Design and implement scalable, secure, and reliable features, considering performance, availability, and compliance requirements. Write clean, maintainable, and extensible code following best practices; participate in code reviews to ensure quality. Debug and resolve issues proactively using telemetry, logs, and root cause analysis. Contribute to project planning by estimating work, identifying dependencies, and supporting safe deployments. Monitor and maintain live services, responding to incidents within defined SLAs and improving system health through telemetry and scorecards. Support continuous improvement through instrumentation, automation, and process enhancements for reliability and efficiency."},"import_id":"b9158611-1961-468e-95ce-f4e489816855","redirectOnApply":true,"import_source":"ImporterService","canonical_url":"https://githubinc.jibeapply.com/jobs/4444?lang=en-us","client_code":"githubinc","gdpr":false},"update_date":"2025-09-08T16:42:31+0000","create_date":"2025-09-08T16:42:31+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"4432","language":"en-us","languages":["en-us"],"req_id":"4432","title":"Staff Software Engineer, Performance Engineering","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview Do you want to make software development a delight for the entire world? Join us at GitHub! We want you to help build and deliver the best end to end software development experience across GitHub. We’re looking for a Staff Software Engineer to join the GitHub Enterprise Server team. GHES is a self-hosted version of GitHub that provides all the features and functionality of GitHub.com but allows organizations to host it on their own infrastructure. Our customers run GHES in some of the most demanding enterprise environments in the world at scales with tens of thousands of developers, millions of repositories, and mission-critical workloads. In this role, you’ll lead the performance testing and analysis strategy for our enterprise offerings: building frameworks, designing workloads that mirror real customer usage, diagnosing bottlenecks across the stack, and working cross-functionally to ensure every release scales with our customers’ needs. If you are passionate about performance, distributed systems, and large-scale reliability and thrive on diving deep into complex systems to make them faster and more efficient we want to hear from you! Responsibilities Lead the design, development, and evolution of performance testing frameworks. Collaborate with cross-functional teams and partner with stakeholders and lead discussions for technical solutions, including design and cost considerations. Define, implement, and scale realistic workloads that capture customer usage patterns (e.g., Git, API, CI/CD). Profile and analyze performance across the full stack: application (Ruby, Go), database (MySQL), caching (Redis), job systems (Resque/Sidekiq), and orchestration layers (Nomad, containers). Partner with engineering teams to identify, reproduce, and resolve performance bottlenecks. Establish performance baselines and regression detection in CI/CD pipelines. Design experiments to evaluate system scalability, concurrency, and fault tolerance. Provide deep technical guidance and mentorship on performance methodology across the org. Collaborate with support and reliability teams to reproduce customer workloads and drive fixes upstream. Author clear technical documentation and present findings to senior leadership and customers. Create and guide others in building a performance testing roadmap for Enterprise as a whole that includes defining success metrics and integrating customer feedback for continuous improvement. Qualifications Required Qualifications: 9+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, Rust, Python, JavaScript, C, C++, C#, Java, OR associate’s degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 8+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, Rust, Python, JavaScript, C, C++, C#, Java, OR bachelor's degree in Computer Science or related field AND 7+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, Rust, Python, JavaScript, C, C++, C#, Java, OR master's degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, Rust, Python, JavaScript, C, C++, C#, Java, OR doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, Rust, Python, JavaScript, C, C++, C#, Java, OR equivalent experience. 4+ years of hands-on experience in performance engineering, systems performance analysis, or equivalent work in profiling, benchmarking, and tuning distributed systems. Preferred Qualifications: Experience developing in large scale Ruby projects. Proven ability to design experiments, interpret performance data, and drive systemic performance improvements. Experience with GitHub’s technology stack (MySQL, Redis, Queuing technologies, Datadog, Nomad, Haproxy, Rails). Knowledge of observability tools (Grafana, Prometheus, Splunk, VictoriaMetrics, VictoriaLogs, etc.). Demonstrated experience with large-scale system architecture and design, particularly in cloud-based environments, with a strong understanding of distributed systems and microservices. Experience working closely with product management, design, and other engineering teams to drive cross-functional projects and deliver high-quality products Compensation Range The base salary range for this job is USD $127,600.00 - USD $338,500.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"tags7":["US Careers (External)"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 9+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, Rust, Python, JavaScript, C, C++, C#, Java, OR associate’s degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 8+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, Rust, Python, JavaScript, C, C++, C#, Java, OR bachelor's degree in Computer Science or related field AND 7+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, Rust, Python, JavaScript, C, C++, C#, Java, OR master's degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, Rust, Python, JavaScript, C, C++, C#, Java, OR doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, Rust, Python, JavaScript, C, C++, C#, Java, OR equivalent experience. 4+ years of hands-on experience in performance engineering, systems performance analysis, or equivalent work in profiling, benchmarking, and tuning distributed systems. Preferred Qualifications: Experience developing in large scale Ruby projects. Proven ability to design experiments, interpret performance data, and drive systemic performance improvements. Experience with GitHub’s technology stack (MySQL, Redis, Queuing technologies, Datadog, Nomad, Haproxy, Rails). Knowledge of observability tools (Grafana, Prometheus, Splunk, VictoriaMetrics, VictoriaLogs, etc.). Demonstrated experience with large-scale system architecture and design, particularly in cloud-based environments, with a strong understanding of distributed systems and microservices. Experience working closely with product management, design, and other engineering teams to drive cross-functional projects and deliver high-quality products","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Lead the design, development, and evolution of performance testing frameworks. Collaborate with cross-functional teams and partner with stakeholders and lead discussions for technical solutions, including design and cost considerations. Define, implement, and scale realistic workloads that capture customer usage patterns (e.g., Git, API, CI/CD). Profile and analyze performance across the full stack: application (Ruby, Go), database (MySQL), caching (Redis), job systems (Resque/Sidekiq), and orchestration layers (Nomad, containers). Partner with engineering teams to identify, reproduce, and resolve performance bottlenecks. Establish performance baselines and regression detection in CI/CD pipelines. Design experiments to evaluate system scalability, concurrency, and fault tolerance. Provide deep technical guidance and mentorship on performance methodology across the org. Collaborate with support and reliability teams to reproduce customer workloads and drive fixes upstream. Author clear technical documentation and present findings to senior leadership and customers. Create and guide others in building a performance testing roadmap for Enterprise as a whole that includes defining success metrics and integrating customer feedback for continuous improvement.","posted_date":"2025-09-08T21:37:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/4432/login","internal":false,"external":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"last_mod":"2025-09-08T21:38:31.342+00:00","icims":{"jps_is_public":true,"date_updated":"2025-09-08T21:37:30Z","primary_posted_site_object":{"site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9","datePosted":"2025-09-08T21:37:00+0000"},"config_keys":null,"revision_int":4,"uuid":"b9b5b07d-9856-4d18-81f9-19c962e290f2"},"googlejobs":{"jobName":"projects/helpful-passage-853/jobs/133078074890560198","jobTitleSnippet":"","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","searchTextSnippet":"","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"radiusInMiles":2.6691467883166546,"postalAddress":{"regionCode":"US","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["United States"],"administrativeArea":"","languageCode":"","revision":0},"locationType":"COUNTRY","latLng":{"latitude":38.7945952,"longitude":-106.5348379}}]},"jobHash":"dd7695e134559390f9196ff3be62f0e2","jobSummary":"Lead the design, development, and evolution of performance testing frameworks. Collaborate with cross-functional teams and partner with stakeholders and lead discussions for technical solutions, including design and cost considerations. Define, implement, and scale realistic workloads that capture customer usage patterns (e.g., Git, API, CI/CD). Profile and analyze performance across the full stack: application (Ruby, Go), database (MySQL), caching (Redis), job systems (Resque/Sidekiq), and orchestration layers (Nomad, containers). Partner with engineering teams to identify, reproduce, and resolve performance bottlenecks. Establish performance baselines and regression detection in CI/CD pipelines. Design experiments to evaluate system scalability, concurrency, and fault tolerance. Provide deep technical guidance and mentorship on performance methodology across the org. Collaborate with support and reliability teams to reproduce customer workloads and drive fixes upstream. Author clear technical documentation and present findings to senior leadership and customers. Create and guide others in building a performance testing roadmap for Enterprise as a whole that includes defining success metrics and integrating customer feedback for continuous improvement."},"import_id":"44115493-b63d-44fa-8811-f30a8f92019b","redirectOnApply":true,"import_source":"ImporterService","canonical_url":"https://githubinc.jibeapply.com/jobs/4432?lang=en-us","client_code":"githubinc","gdpr":false},"update_date":"2025-09-08T21:38:31+0000","create_date":"2025-09-08T21:38:31+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"4427","language":"en-us","languages":["en-us"],"req_id":"4427","title":"Senior Search Software Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, Germany Overview The Elasticsearch team at GitHub owns the infrastructure and code that powers searching Issues, Pull Requests, Projects, Discussions and more. We're responsible for the creation and management of large-scale Elasticsearch clusters (hundreds of terabytes of data serving multiple thousands of reads and writes per second). Our problem space also includes optimizing index creation, population, repair and reindex processes to ensure that indexes with billions or trillions of records are recoverable, correctly mapped, and can be restored quickly. At the same time we're also focused on pushing the boundaries of cluster management, scale and availability. We're looking for a senior search and data focused engineer to join the team and help us build the future of Search at GitHub. Our top priorities include scaling support for both agentic and human-driven traffic, improving relevance tooling for teams that build search experiences, and building an API-driven interface between our relational data and search indexes. Responsibilities Infrastructure Development and Management ● Builds and enhances the physical and/or virtual frameworks and tools that are used to manage and maintain the infrastructure. Helps create scalable and efficient systems, automates processes, and improves overall infrastructure performance. Participates in capacity planning and design initiatives. ● With minimal guidance, assesses infrastructure capacity needs, predicts growth trends, and plans for scalability. Ensures sufficient resources are allocated and infrastructure is properly scaled to handle increasing demands. Expands infrastructure/platform offerings to meet business and developer needs. Site Availability and Performance ● Acts as the first point of contact for user issues in the area of responsibility. Engages with other teams to diagnose and respond to broad incidents. Solicits information from customer to form an understanding of the nature of the outage and identify potential troubleshooting steps. ● Ensures the security and compliance of the infrastructure. Collaborates with security teams to implement and maintain robust security measures, conduct vulnerability assessments, and adhere to relevant regulatory standards. Performs timely upgrades to applications/open-source software (OSS)/operating systems used for operation of the infrastructure. ● Establishes appropriate observability and monitoring of infrastructure to proactively identify and address situations, including instructional playbooks. Researches and understands performance gaps or outages. Executes disaster recovery/failure test scenarios. Database Infrastructure and Management ● Identifies areas for optimization, implements innovative solutions, and drives initiatives to enhance system performance, reliability, and scalability. ● Stays updated with latest technologies, industry trends, and best practices in infrastructure engineering. Implements projects that incorporates these into GitHub platforms. Troubleshooting ● Understands how to read and assess common errors to form accurate diagnoses and create or direct fixes. Remains on-call to handle incidents and outages, investigating and resolving issues promptly to minimize the downtime and impact on services. Contributes to incident management processes, participates in incident report-out, identifies root causes, and implements preventive measures to avoid similar incidents in the future. Collaboration ● Contributes to open-source projects. Collaborates with broader open-source community to enhance existing tools, develop new features, and share best practices with other infrastructure engineers in the industry. ● Collaborates with software engineers and other infrastructure teams to troubleshoot issues and optimise infrastructure performance. Understands systems and writes technical design docs to drive shared understanding and alignment across partner teams and stakeholders. Collaborates with various teams to identify cross-team opportunities for new features and improvement and able to approach every development task with a \"How do I observe the impact of this\" mindset and similarly approach Production incidents with a thought to \"How could I have seen this earlier\" Qualifications Required/Minimum Qualifications Minimum of 6 years technical experience in one or more infrastructure domains (e.g., container orchestration engineering, platform engineering, database engineering, software engineering, network engineering, systems administration, or related field) o OR Bachelor's Degree in Computer Science, Information Technology, or related field AND 4+ years technical experience in infrastructure domains (e.g., container orchestration engineering, platform engineering, database engineering, software engineering, network engineering, systems administration, or related field) o OR equivalent experience. Minimum of 6 years experience with Lucene/Apache based search engines such as Elasticsearch or Solr. Minimum of 6 years experience of Building, deploying and maintaining distributed databases at scale such as Redis, MySQL, or Elasticsearch. Minimum of 6 years experience with Search Relevance, Scoring and building Search Experiences and with Infrastructure as code, configuration management and associated tooling such as Terraform, Puppet and Ansible. Preferred Qualifications Minimum of 3 years experience using general purpose programming languages (e.g., Go, Ruby, or Rust). Minimum 1 year of technical leadership experience. Minimum of 3 years experience in one or more scripting languages (e.g., Bash, Python, or a similar language). GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. Equal Employment Opportunity GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"Germany Remote","country":"Germany","country_code":"DE","location_type":"ANY","latitude":51.165691,"longitude":10.451526,"categories":[{"name":"Engineering"}],"tags2":["DE-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"tags7":["Global Careers (External)"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required/Minimum Qualifications Minimum of 6 years technical experience in one or more infrastructure domains (e.g., container orchestration engineering, platform engineering, database engineering, software engineering, network engineering, systems administration, or related field) o OR Bachelor's Degree in Computer Science, Information Technology, or related field AND 4+ years technical experience in infrastructure domains (e.g., container orchestration engineering, platform engineering, database engineering, software engineering, network engineering, systems administration, or related field) o OR equivalent experience. Minimum of 6 years experience with Lucene/Apache based search engines such as Elasticsearch or Solr. Minimum of 6 years experience of Building, deploying and maintaining distributed databases at scale such as Redis, MySQL, or Elasticsearch. Minimum of 6 years experience with Search Relevance, Scoring and building Search Experiences and with Infrastructure as code, configuration management and associated tooling such as Terraform, Puppet and Ansible. Preferred Qualifications Minimum of 3 years experience using general purpose programming languages (e.g., Go, Ruby, or Rust). Minimum 1 year of technical leadership experience. Minimum of 3 years experience in one or more scripting languages (e.g., Bash, Python, or a similar language).","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Infrastructure Development and Management ● Builds and enhances the physical and/or virtual frameworks and tools that are used to manage and maintain the infrastructure. Helps create scalable and efficient systems, automates processes, and improves overall infrastructure performance. Participates in capacity planning and design initiatives. ● With minimal guidance, assesses infrastructure capacity needs, predicts growth trends, and plans for scalability. Ensures sufficient resources are allocated and infrastructure is properly scaled to handle increasing demands. Expands infrastructure/platform offerings to meet business and developer needs. Site Availability and Performance ● Acts as the first point of contact for user issues in the area of responsibility. Engages with other teams to diagnose and respond to broad incidents. Solicits information from customer to form an understanding of the nature of the outage and identify potential troubleshooting steps. ● Ensures the security and compliance of the infrastructure. Collaborates with security teams to implement and maintain robust security measures, conduct vulnerability assessments, and adhere to relevant regulatory standards. Performs timely upgrades to applications/open-source software (OSS)/operating systems used for operation of the infrastructure. ● Establishes appropriate observability and monitoring of infrastructure to proactively identify and address situations, including instructional playbooks. Researches and understands performance gaps or outages. Executes disaster recovery/failure test scenarios. Database Infrastructure and Management ● Identifies areas for optimization, implements innovative solutions, and drives initiatives to enhance system performance, reliability, and scalability. ● Stays updated with latest technologies, industry trends, and best practices in infrastructure engineering. Implements projects that incorporates these into GitHub platforms. Troubleshooting ● Understands how to read and assess common errors to form accurate diagnoses and create or direct fixes. Remains on-call to handle incidents and outages, investigating and resolving issues promptly to minimize the downtime and impact on services. Contributes to incident management processes, participates in incident report-out, identifies root causes, and implements preventive measures to avoid similar incidents in the future. Collaboration ● Contributes to open-source projects. Collaborates with broader open-source community to enhance existing tools, develop new features, and share best practices with other infrastructure engineers in the industry. ● Collaborates with software engineers and other infrastructure teams to troubleshoot issues and optimise infrastructure performance. Understands systems and writes technical design docs to drive shared understanding and alignment across partner teams and stakeholders. Collaborates with various teams to identify cross-team opportunities for new features and improvement and able to approach every development task with a \"How do I observe the impact of this\" mindset and similarly approach Production incidents with a thought to \"How could I have seen this earlier\"","posted_date":"2025-09-11T13:34:00+0000","posting_expiry_date":"2025-09-24T23:00:00+0000","apply_url":"https://globalcareers-githubinc.icims.com/jobs/4427/login","internal":false,"external":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"last_mod":"2025-09-11T13:40:31.625+00:00","icims":{"jps_is_public":true,"date_updated":"2025-09-11T13:39:47Z","primary_posted_site_object":{"site":"globalcareers-githubinc","validThrough":"2025-09-24T23:00:00+0000","siteId":"48855464-2bde-48e1-af86-f8c7872d8750","datePosted":"2025-09-11T13:34:00+0000"},"config_keys":null,"revision_int":2,"uuid":"708662c5-7eb3-4707-9d61-34a6da67ec2d"},"googlejobs":{"jobName":"projects/helpful-passage-853/jobs/89597208965325510","jobTitleSnippet":"","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","searchTextSnippet":"","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"radiusInMiles":0.21074204644792707,"postalAddress":{"regionCode":"DE","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["Germany"],"administrativeArea":"","languageCode":"","revision":0},"locationType":"COUNTRY","latLng":{"latitude":51.165691,"longitude":10.451526}}]},"jobHash":"72e7aa8c9640bae9254c346487b9fb92","jobSummary":"Infrastructure Development and Management ● Builds and enhances the physical and/or virtual frameworks and tools that are used to manage and maintain the infrastructure. Helps create scalable and efficient systems, automates processes, and improves overall infrastructure performance. Participates in capacity planning and design initiatives. ● With minimal guidance, assesses infrastructure capacity needs, predicts growth trends, and plans for scalability. Ensures sufficient resources are allocated and infrastructure is properly scaled to handle increasing demands. Expands infrastructure/platform offerings to meet business and developer needs. Site Availability and Performance ● Acts as the first point of contact for user issues in the area of responsibility. Engages with other teams to diagnose and respond to broad incidents. Solicits information from customer to form an understanding of the nature of the outage and identify potential troubleshooting steps. ● Ensures the security and compliance of the infrastructure. Collaborates with security teams to implement and maintain robust security measures, conduct vulnerability assessments, and adhere to relevant regulatory standards. Performs timely upgrades to applications/open-source software (OSS)/operating systems used for operation of the infrastructure. ● Establishes appropriate observability and monitoring of infrastructure to proactively identify and address situations, including instructional playbooks. Researches and understands performance gaps or outages. Executes disaster recovery/failure test scenarios. Database Infrastructure and Management ● Identifies areas for optimization, implements innovative solutions, and drives initiatives to enhance system performance, reliability, and scalability. ● Stays updated with latest technologies, industry trends, and best practices in infrastructure engineering. Implements projects that incorporates these into GitHub platforms. Troubleshooting ● Understands how to read and assess common errors to form accurate diagnoses and create or direct fixes. Remains on-call to handle incidents and outages, investigating and resolving issues promptly to minimize the downtime and impact on services. Contributes to incident management processes, participates in incident report-out, identifies root causes, and implements preventive measures to avoid similar incidents in the future. Collaboration ● Contributes to open-source projects. Collaborates with broader open-source community to enhance existing tools, develop new features, and share best practices with other infrastructure engineers in the industry. ● Collaborates with software engineers and other infrastructure teams to troubleshoot issues and optimise infrastructure performance. Understands systems and writes technical design docs to drive shared understanding and alignment across partner teams and stakeholders. Collaborates with various teams to identify cross-team opportunities for new features and improvement and able to approach every development task with a \"How do I observe the impact of this\" mindset and similarly approach Production incidents with a thought to \"How could I have seen this earlier\""},"import_id":"a5eee90c-a75c-49ea-b65c-99c51a76c08e","redirectOnApply":true,"import_source":"ImporterService","canonical_url":"https://githubinc.jibeapply.com/jobs/4427?lang=en-us","client_code":"githubinc","gdpr":true},"update_date":"2025-09-11T13:40:31+0000","create_date":"2025-09-11T13:34:31+0000","category":[" Engineering"],"full_location":"Germany","short_location":"Germany","multipleLocations":false}},{"data":{"slug":"4425","language":"en-us","languages":["en-us"],"req_id":"4425","title":"Senior Software Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is growing its Engineering team and we're seeking experienced professionals to elevate our Physical Infrastructure efforts. As a Senior Software Engineer, you will design, build, and enhance physical infrastructure frameworks and tools, ensuring scalable and efficient data centers. The ideal candidate will be a key contributor to enhancing GitHub’s physical infrastructure, ensuring scalability and efficiency while gaining valuable experience in data center architecture, hardware innovation, and cross-functional collaboration to support developers globally. As an Infrastructure Engineer, you will report into GitHub's larger Platform organization. Platform is a distributed group that owns internal services, tools, and infrastructure used to build, deploy, and operate the services that make up GitHub. Built in our own data centers with a variety of open source software, our services are used by dozens of engineering teams across the company. We strive to act as a productivity multiplier by offering our customers the tools they need to deliver their services, allowing them to focus more on product. Responsibilities Design, build, and enhance physical infrastructure systems, frameworks, and tools to manage and maintain data centers, ensuring systems are scalable and efficient while automating processes to improve performance. Lead capacity planning and design initiatives, predict growth trends, and ensure infrastructure is properly scaled to handle increasing demands. Implement and maintain robust security measures, conduct vulnerability assessments, and ensure compliance with relevant regulatory standards, focusing on the unique requirements of physical infrastructure. Establish observability and monitoring systems to proactively identify and address performance gaps or outages and execute disaster recovery and failure test scenarios specific to physical infrastructure. Act as a senior point of contact for diagnosing and resolving infrastructure issues promptly to minimize downtime, contribute to incident management processes, and implement preventive measures to avoid future incidents. Collaborate with cross-functional teams, including software engineers and data center vendors, to troubleshoot issues, optimize infrastructure performance, and identify opportunities for new features and improvements in the space. Lead initiatives within the open-source community to enhance existing tools, develop new features, and share best practices, with a focus on physical infrastructure technologies. Lead the design and integration of physical hardware at the rack/chassis level, ensuring compatibility and efficiency in data center deployments Participate in an on-call rotation and quickly respond to issues and work to prevent them in the future Qualifications Required Qualifications: 6+ years’ technical experience in one or more infrastructure domains (e.g., container orchestration engineering, platform engineering, database engineering, software engineering, network engineering, systems administration, or related field), OR bachelor's degree in Computer Science, Information Technology, or related field AND 4+ years’ technical experience in infrastructure domains (e.g., container orchestration engineering, platform engineering, database engineering, software engineering, network engineering, systems administration, or related field), OR equivalent experience. 3+ years' experience with physical hardware design at the rack/chassis level in the context of datacenter deployments. 2+ years' experience deploying infrastructure in a data center. Preferred Qualifications: 1+ year(s) technical leadership experience 3+ years' experience in one or more scripting languages (e.g., Bash, Python, or a similar language) 3+ years' experience using general purpose programming languages (e.g., Go, Ruby, or a similar language) Extensive experience in designing and deploying physical infrastructure in data centers, and proficiency in scripting languages like Bash or Python Compensation Range The base salary range for this job is USD $112,800.00 - USD $299,300.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"tags7":["US Careers (External)"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 6+ years’ technical experience in one or more infrastructure domains (e.g., container orchestration engineering, platform engineering, database engineering, software engineering, network engineering, systems administration, or related field), OR bachelor's degree in Computer Science, Information Technology, or related field AND 4+ years’ technical experience in infrastructure domains (e.g., container orchestration engineering, platform engineering, database engineering, software engineering, network engineering, systems administration, or related field), OR equivalent experience. 3+ years' experience with physical hardware design at the rack/chassis level in the context of datacenter deployments. 2+ years' experience deploying infrastructure in a data center. Preferred Qualifications: 1+ year(s) technical leadership experience 3+ years' experience in one or more scripting languages (e.g., Bash, Python, or a similar language) 3+ years' experience using general purpose programming languages (e.g., Go, Ruby, or a similar language) Extensive experience in designing and deploying physical infrastructure in data centers, and proficiency in scripting languages like Bash or Python","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Design, build, and enhance physical infrastructure systems, frameworks, and tools to manage and maintain data centers, ensuring systems are scalable and efficient while automating processes to improve performance. Lead capacity planning and design initiatives, predict growth trends, and ensure infrastructure is properly scaled to handle increasing demands. Implement and maintain robust security measures, conduct vulnerability assessments, and ensure compliance with relevant regulatory standards, focusing on the unique requirements of physical infrastructure. Establish observability and monitoring systems to proactively identify and address performance gaps or outages and execute disaster recovery and failure test scenarios specific to physical infrastructure. Act as a senior point of contact for diagnosing and resolving infrastructure issues promptly to minimize downtime, contribute to incident management processes, and implement preventive measures to avoid future incidents. Collaborate with cross-functional teams, including software engineers and data center vendors, to troubleshoot issues, optimize infrastructure performance, and identify opportunities for new features and improvements in the space. Lead initiatives within the open-source community to enhance existing tools, develop new features, and share best practices, with a focus on physical infrastructure technologies. Lead the design and integration of physical hardware at the rack/chassis level, ensuring compatibility and efficiency in data center deployments Participate in an on-call rotation and quickly respond to issues and work to prevent them in the future","posted_date":"2025-08-29T20:11:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/4425/login","internal":false,"external":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"last_mod":"2025-09-02T18:12:46.551+00:00","icims":{"jps_is_public":true,"date_updated":"2025-09-02T18:11:47Z","primary_posted_site_object":{"site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9","datePosted":"2025-08-29T20:11:00+0000"},"config_keys":null,"revision_int":2,"uuid":"f47ca290-c205-4f1f-824d-e948d6780793"},"googlejobs":{"jobName":"projects/helpful-passage-853/jobs/94767333829944006","jobTitleSnippet":"","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","searchTextSnippet":"","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"radiusInMiles":2.6691467883166546,"postalAddress":{"regionCode":"US","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["United States"],"administrativeArea":"","languageCode":"","revision":0},"locationType":"COUNTRY","latLng":{"latitude":38.7945952,"longitude":-106.5348379}}]},"jobHash":"1ca20040cb190f4d7637c63200cea54e","jobSummary":"Design, build, and enhance physical infrastructure systems, frameworks, and tools to manage and maintain data centers, ensuring systems are scalable and efficient while automating processes to improve performance. Lead capacity planning and design initiatives, predict growth trends, and ensure infrastructure is properly scaled to handle increasing demands. Implement and maintain robust security measures, conduct vulnerability assessments, and ensure compliance with relevant regulatory standards, focusing on the unique requirements of physical infrastructure. Establish observability and monitoring systems to proactively identify and address performance gaps or outages and execute disaster recovery and failure test scenarios specific to physical infrastructure. Act as a senior point of contact for diagnosing and resolving infrastructure issues promptly to minimize downtime, contribute to incident management processes, and implement preventive measures to avoid future incidents. Collaborate with cross-functional teams, including software engineers and data center vendors, to troubleshoot issues, optimize infrastructure performance, and identify opportunities for new features and improvements in the space. Lead initiatives within the open-source community to enhance existing tools, develop new features, and share best practices, with a focus on physical infrastructure technologies. Lead the design and integration of physical hardware at the rack/chassis level, ensuring compatibility and efficiency in data center deployments Participate in an on-call rotation and quickly respond to issues and work to prevent them in the future"},"import_id":"64b1491b-7cda-440b-a5d1-17b0746b3c46","redirectOnApply":true,"import_source":"ImporterService","canonical_url":"https://githubinc.jibeapply.com/jobs/4425?lang=en-us","client_code":"githubinc","gdpr":false},"update_date":"2025-09-02T18:12:46+0000","create_date":"2025-08-29T20:11:47+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"4424","language":"en-us","languages":["en-us"],"req_id":"4424","title":"Staff Software Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is growing its Engineering team and seeks experienced professionals to elevate our software engineering efforts. As a Staff Software Engineer at GitHub, you will architect and deliver high-performance systems that power collaboration for millions of developers. You will drive technical execution from design through production, leading initiatives across distributed teams. Within GitHub’s ecosystem, Actions powers automation for millions of developers worldwide, enabling them to build, test, and deploy code directly from their repositories. As the backbone of CI/CD workflows across GitHub, Actions processes billions of jobs monthly, from simple builds to complex deployment pipelines spanning multiple environments. Our team owns the core infrastructure and services that make this possible, ensuring reliability at massive scale. We're a group of engineers passionate about developer productivity, tackling challenges in distributed systems, container orchestration, security, and cloud infrastructure. You'll work alongside talented colleagues who value collaboration, operational excellence, and building products that developers love. Responsibilities Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services and become intimately familiar with the systems you build and take pride in writing maintainable code. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others; support teams in producing extensible and maintainable code, ensuring integration with downstream dependencies and adherence to quality standards. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call for first responder rotations and live incidents. Design and implement APIs to facilitate seamless integration between software components. Collaborate with cross-functional teams and partner with stakeholders and lead discussions for technical solutions, including design and cost considerations. Lead the team in developing comprehensive testing strategies, defining success metrics, and incorporating customer feedback to drive continuous improvement. Champion security across GitHub Actions by designing and implementing isolation mechanisms for untrusted code execution, ensuring compliance with enterprise security requirements, and partnering with Security teams to protect against vulnerabilities in our services. Champion operational excellence by improving system reliability, reducing incident response times, and establishing best practices for monitoring, alerting, and runbooks across Actions services. Drive and support technical roadmap that aligns with product goals, ensuring that engineering efforts are strategically prioritized and incorporating the adoption of new technologies and methodologies where applicable. Qualifications Required Qualifications: 9+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, Rust, Python, JavaScript, C, C++, C#, Java, OR associate’s degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 8+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, Rust, Python, JavaScript, C, C++, C#, Java, OR bachelor's degree in Computer Science or related field AND 7+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, Rust, Python, JavaScript, C, C++, C#, Java, OR master's degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, Rust, Python, JavaScript, C, C++, C#, Java, OR doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, Rust, Python, JavaScript, C, C++, C#, Java, OR equivalent experience. Preferred Qualifications: 2+ year(s) technical leadership experience 3+ years' experience using general purpose programming languages (e.g., Go, Ruby, or a similar language) 3+ years' experience in one or more scripting languages (e.g., Bash, Python, or a similar language) Experience building or operating CI/CD systems at scale Compensation Range The base salary range for this job is USD $127,600.00 - USD $338,500.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"tags7":["US Careers (External)"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 9+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, Rust, Python, JavaScript, C, C++, C#, Java, OR associate’s degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 8+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, Rust, Python, JavaScript, C, C++, C#, Java, OR bachelor's degree in Computer Science or related field AND 7+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, Rust, Python, JavaScript, C, C++, C#, Java, OR master's degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, Rust, Python, JavaScript, C, C++, C#, Java, OR doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, Rust, Python, JavaScript, C, C++, C#, Java, OR equivalent experience. Preferred Qualifications: 2+ year(s) technical leadership experience 3+ years' experience using general purpose programming languages (e.g., Go, Ruby, or a similar language) 3+ years' experience in one or more scripting languages (e.g., Bash, Python, or a similar language) Experience building or operating CI/CD systems at scale","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services and become intimately familiar with the systems you build and take pride in writing maintainable code. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others; support teams in producing extensible and maintainable code, ensuring integration with downstream dependencies and adherence to quality standards. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call for first responder rotations and live incidents. Design and implement APIs to facilitate seamless integration between software components. Collaborate with cross-functional teams and partner with stakeholders and lead discussions for technical solutions, including design and cost considerations. Lead the team in developing comprehensive testing strategies, defining success metrics, and incorporating customer feedback to drive continuous improvement. Champion security across GitHub Actions by designing and implementing isolation mechanisms for untrusted code execution, ensuring compliance with enterprise security requirements, and partnering with Security teams to protect against vulnerabilities in our services. Champion operational excellence by improving system reliability, reducing incident response times, and establishing best practices for monitoring, alerting, and runbooks across Actions services. Drive and support technical roadmap that aligns with product goals, ensuring that engineering efforts are strategically prioritized and incorporating the adoption of new technologies and methodologies where applicable.","posted_date":"2025-09-09T13:38:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/4424/login","internal":false,"external":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"last_mod":"2025-09-09T22:09:31.392+00:00","icims":{"jps_is_public":true,"date_updated":"2025-09-09T22:08:50Z","primary_posted_site_object":{"site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9","datePosted":"2025-09-09T13:38:00+0000"},"config_keys":null,"revision_int":2,"uuid":"3146e1e3-06aa-4af2-9465-0906bfeadd52"},"googlejobs":{"jobName":"projects/helpful-passage-853/jobs/112323375577080518","jobTitleSnippet":"","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","searchTextSnippet":"","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"radiusInMiles":2.6691467883166546,"postalAddress":{"regionCode":"US","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["United States"],"administrativeArea":"","languageCode":"","revision":0},"locationType":"COUNTRY","latLng":{"latitude":38.7945952,"longitude":-106.5348379}}]},"jobHash":"e252e603eb4eb016c187889a0c847a72","jobSummary":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services and become intimately familiar with the systems you build and take pride in writing maintainable code. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others; support teams in producing extensible and maintainable code, ensuring integration with downstream dependencies and adherence to quality standards. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call for first responder rotations and live incidents. Design and implement APIs to facilitate seamless integration between software components. Collaborate with cross-functional teams and partner with stakeholders and lead discussions for technical solutions, including design and cost considerations. Lead the team in developing comprehensive testing strategies, defining success metrics, and incorporating customer feedback to drive continuous improvement. Champion security across GitHub Actions by designing and implementing isolation mechanisms for untrusted code execution, ensuring compliance with enterprise security requirements, and partnering with Security teams to protect against vulnerabilities in our services. Champion operational excellence by improving system reliability, reducing incident response times, and establishing best practices for monitoring, alerting, and runbooks across Actions services. Drive and support technical roadmap that aligns with product goals, ensuring that engineering efforts are strategically prioritized and incorporating the adoption of new technologies and methodologies where applicable."},"import_id":"be360113-a3ce-4f6a-a81b-9d25e713e1f5","redirectOnApply":true,"import_source":"ImporterService","canonical_url":"https://githubinc.jibeapply.com/jobs/4424?lang=en-us","client_code":"githubinc","gdpr":false},"update_date":"2025-09-09T22:09:31+0000","create_date":"2025-09-09T13:38:32+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"4409","language":"en-us","languages":["en-us"],"req_id":"4409","title":"Software Engineer III, Runtime Platform","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is changing the way the world builds software, and we want you to help. At GitHub, we constantly strive to create an environment that allows our employees to do the best work of their lives. GitHub is looking for a talented Software Engineer III to join our Platform Team in the Development Experience department. Our team is working on multiple products all aimed to enable GitHub’s engineers to deliver value in a faster and secure way. We work on the entire delivery stack from chatops infra to PR linting and up to the actual deployments of Github’s services both to kubernetes and virtual machine environments. On this team, you’ll collaborate across functions and across teams to deliver the best possible developer experience for all engineers here at GitHub. In this role, you will be having the opportunity to work as an engineer with a globally distributed, diverse and passionate team where you will be expected to demonstrate independence and a drive to deliver. You will design, implement, rollout and support a highly performant, highly scalable and highly available host of services alongside a team of fellow software engineering professionals. This team and its parent Development Experience department are highly distributed across the globe and span a variety of diverse backgrounds. We recognize the value this diversity brings to our teams and our products, so creating and maintaining an environment where every individual feels safe to bring their unique perspective to the challenges we're solving is important to us. Responsibilities Demonstrate a strong commitment to high quality software development practices Actively design, develop, document and maintain our deployment infrastructure services with a product mindset Provide compassionate technical mentorship, pairing opportunities, and code reviews to encourage professional and technical growth of those around you Build tools and systems that empathetically and pragmatically meet real operability needs of GitHub developers Develop and maintain scalable infrastructure Use data to understand the availability, reliability, and sustainability of our infrastructure Work closely with other teams from around the organization Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary Qualifications Required Qualifications: 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field OR equivalent experience 2+ years experience with running, operating, and maintaining production systems 2+ years experience designing, building and running large scale and highly available cloud services or distributed systems Preferred Qualifications: Solid understanding of testing principles and high quality software Experience with Kubernetes or other container orchestration systems Experience building infrastructure automation Experience working with the Linux operating system Experience running, monitoring and troubleshooting issues in a production always-on service Excellent analytical skills and communication skills. Fluent in English both verbal and written. We are a global cross-countries team so we’re extra mindful about communication. Compensation Range The base salary range for this job is USD $97,900.00 - USD $259,900.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"tags7":["US Careers (External)"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field OR equivalent experience 2+ years experience with running, operating, and maintaining production systems 2+ years experience designing, building and running large scale and highly available cloud services or distributed systems Preferred Qualifications: Solid understanding of testing principles and high quality software Experience with Kubernetes or other container orchestration systems Experience building infrastructure automation Experience working with the Linux operating system Experience running, monitoring and troubleshooting issues in a production always-on service Excellent analytical skills and communication skills. Fluent in English both verbal and written. We are a global cross-countries team so we’re extra mindful about communication.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Demonstrate a strong commitment to high quality software development practices Actively design, develop, document and maintain our deployment infrastructure services with a product mindset Provide compassionate technical mentorship, pairing opportunities, and code reviews to encourage professional and technical growth of those around you Build tools and systems that empathetically and pragmatically meet real operability needs of GitHub developers Develop and maintain scalable infrastructure Use data to understand the availability, reliability, and sustainability of our infrastructure Work closely with other teams from around the organization Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary","posted_date":"2025-08-13T19:25:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/4409/login","internal":false,"external":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"last_mod":"2025-08-15T12:26:48.342+00:00","icims":{"jps_is_public":true,"date_updated":"2025-08-13T19:25:20Z","primary_posted_site_object":{"site":"careers-githubinc","tenantId":"13865","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9","datePosted":"2025-08-13T19:25:00+0000","siteType":"ATTRACT"},"config_keys":{"jobposting.external.company.name":"GitHub, Inc.","icims.external.xml.feeds":"icims.indeed.xml.enabled,icims.resume-library.xml.enabled,icims.direct-employers.xml.enabled,icims.monster.xml.enabled,icims.adzuna.xml.enabled,icims.careerbuilder.xml.enabled,icims.ziprecruiter.xml.enabled,icims.craigslist.xml.enabled,icims.itjobscafe.xml.enabled,icims.recruitnet.xml.enabled,icims.upward.xml.enabled,icims.jobbio.xml.enabled,icims.propellum.xml.enabled,icims.snagajob.xml.enabled,icims.inhersight.xml.enabled,icims.pallet-labs.xml.enabled,icims.qkly.xml.enabled,icims.cv-library.xml.enabled,icims.linkedin.xml.enabled,icims.zippia.xml.enabled,icims.puck.xml.enabled,icims.offerup.xml.enabled,icims.jobted.xml.enabled,icims.edtech.xml.enabled,icims.jobgether.xml.enabled,icims.referio.xml.enabled,icims.careerjet.xml.enabled,icims.advantageai.xml.enabled,icims.unpostedjobs.xml.enabled,icims.allyenergy.xml.enabled,icims.stealthstartup.xml.enabled,icims.hiringcafe.xml.enabled,icims.retailappointment.xml.enabled,icims.jobget.xml.enabled,icims.hirebase.xml.enabled,icims.shaker.xml.enabled,icims.tariangroup.xml.enabled,icims.flatworld.xml.enabled,icims.nexxt.xml.enabled,icims.intelycare.xml.enabled,icims.calibersourcing.xml.enabled,icims.almazlabs.xml.enabled,icims.dentalpost.xml.enabled,icims.nejoflexco.xml.enabled,icims.skillsire.xml.enabled","portal.id":"17","ccc.attract.portal.url":"https://www.github.careers","icims.config.web.indeed.easy.apply":"0"},"revision_int":1,"uuid":"e5d7b708-2be7-4e2a-9748-06c99fc139f9"},"googlejobs":{"jobName":"projects/helpful-passage-853/jobs/121606789547336390","jobTitleSnippet":"","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","searchTextSnippet":"","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"radiusInMiles":2.6691467883166546,"postalAddress":{"regionCode":"US","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["United States"],"administrativeArea":"","languageCode":"","revision":0},"locationType":"COUNTRY","latLng":{"latitude":38.7945952,"longitude":-106.5348379}}]},"jobHash":"7c65421cd42b1a0b4301f7ad75417c75","jobSummary":"Demonstrate a strong commitment to high quality software development practices Actively design, develop, document and maintain our deployment infrastructure services with a product mindset Provide compassionate technical mentorship, pairing opportunities, and code reviews to encourage professional and technical growth of those around you Build tools and systems that empathetically and pragmatically meet real operability needs of GitHub developers Develop and maintain scalable infrastructure Use data to understand the availability, reliability, and sustainability of our infrastructure Work closely with other teams from around the organization Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary"},"import_id":"9306d2fc-fe25-4cc4-b959-f0ea1bf17b13","redirectOnApply":true,"import_source":"ImporterService","canonical_url":"https://githubinc.jibeapply.com/jobs/4409?lang=en-us","client_code":"githubinc","gdpr":false},"update_date":"2025-08-15T12:26:48+0000","create_date":"2025-08-13T19:26:09+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"4455","language":"en-us","languages":["en-us"],"req_id":"4455","title":"Senior Software Engineer, Actions","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub Actions is looking for a great Senior Software Engineer to join our team! Actions powers automation for millions of developers worldwide, enabling them to build, test, and deploy code directly from their repositories. As the backbone of CI/CD workflows across GitHub, Actions processes billions of jobs monthly - from simple builds to complex deployment pipelines spanning multiple environments. Our Hosted Compute team builds services and infrastructure that enable those jobs to run on ephemeral Linux, Mac, and Windows runners reliably, securely, and starting in seconds. We're a group of engineers passionate about developer productivity, tackling challenges in distributed systems, container orchestration, and cloud infrastructure. You'll work alongside talented colleagues who value collaboration, operational excellence, and building products that developers love. We are looking for creative problem solvers and diverse thinkers, people who care about culture as well as customers and features. We believe that how we do things is as important as what we do. Big vision, a common purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what lead to great results. Great products reflect the teams that build them. Responsibilities Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code. Qualifications Required Qualifications: 6+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related fie OR equivalent experience. 2+ years experience developing and operating large-scale services or infrastructure Preferred Qualifications: 2+ years experience in one or more scripting languages (e.g., Bash, Python, or a similar language) 2+ years experience using general purpose programming languages (e.g., Go, Ruby, or a similar language). 3+ years experience with cloud environments and/or Cloud Native Compute Foundation (CNCF) concepts. Experience with MacOS or iOS development Compensation Range The base salary range for this job is USD $112,800.00 - USD $299,300.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"tags7":["US Careers (External)"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 6+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related fie OR equivalent experience. 2+ years experience developing and operating large-scale services or infrastructure Preferred Qualifications: 2+ years experience in one or more scripting languages (e.g., Bash, Python, or a similar language) 2+ years experience using general purpose programming languages (e.g., Go, Ruby, or a similar language). 3+ years experience with cloud environments and/or Cloud Native Compute Foundation (CNCF) concepts. Experience with MacOS or iOS development","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","posted_date":"2025-09-05T18:35:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/4455/login","internal":false,"external":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"last_mod":"2025-09-11T14:23:31.446+00:00","icims":{"jps_is_public":true,"date_updated":"2025-09-11T14:22:38Z","primary_posted_site_object":{"site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9","datePosted":"2025-09-05T18:35:00+0000"},"config_keys":null,"revision_int":3,"uuid":"c7936973-89a2-4777-82ed-8eefa18ae353"},"googlejobs":{"jobName":"projects/helpful-passage-853/jobs/143693863951704774","jobTitleSnippet":"","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","searchTextSnippet":"","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"radiusInMiles":2.6691467883166546,"postalAddress":{"regionCode":"US","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["United States"],"administrativeArea":"","languageCode":"","revision":0},"locationType":"COUNTRY","latLng":{"latitude":38.7945952,"longitude":-106.5348379}}]},"jobHash":"8aa3c9de6f838cc8538b9e690152d7c9","jobSummary":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code."},"import_id":"ef526fe1-8cdf-4bbe-a13c-ecaff7dafc07","redirectOnApply":true,"import_source":"ImporterService","canonical_url":"https://githubinc.jibeapply.com/jobs/4455?lang=en-us","client_code":"githubinc","gdpr":false},"update_date":"2025-09-11T14:23:31+0000","create_date":"2025-09-05T18:36:47+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"4417","language":"en-us","languages":["en-us"],"req_id":"4417","title":"Staff Software Engineer, Compute Platform","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States | Remote, United States Overview GitHub is looking for a Staff Software Engineer to join the Compute Platform team within our Developer Experience organization. You will focus on the systems and tools that enable our engineers to operate and scale the world's largest code hosting platform. You will plan, deploy, and maintain our Kubernetes clusters with a focus on making the Developer Experience the best it can be for our engineering and infrastructure teams. The Developer Experience team is highly distributed and you will thrive in an environment of remote work and asynchronous communication. You're expected to have strong written communication skills and be able to develop working relationships with coworkers in locations around the globe. As an engineer at GitHub you'll always be challenged to solve interesting and novel problems that have real impact on how the world builds software. Responsibilities Build and improve the frameworks and tools we use to build, test, configure our Kubernetes clusters. Ensure a reliable Kubernetes platform across bare-metal, virtual machines, and cloud environments. Cultivate open source projects developed by GitHub and build things you are proud to share. Work closely with other engineering and infrastructure teams to design solutions and support Kubernetes workloads. Qualifications Required Qualifications: 9+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 8+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science or related field AND 7+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR equivalent experience. 2+ years technical leadership experience. 9+ years of technical engineering experience in infrastructure domains 4+ years of experience with Kubernetes platform architecture, primitives, and experience with AWS or Azure cloud environments Preferred Qualifications: Experience operating Kubernetes in a high scale, production environment. Specific experience in managing/configuring AKS or EKS environments highly preferred. Competent in one or more scripting languages (e.g., Bash, Python, or a similar language). Knowledge of Hashicorp’s Terraform, Consul, and Vault products Experience with virtualization, bare metal deployment, or network engineering Experience with diagnosing and automating large, complex distributed systems with an eye toward reliability Compensation Range The base salary range for this job is USD $127,600.00 - USD $338,500.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"additional_locations":[{"location_name":"US Remote","country":"United States","country_code":"US","latitude":38.7945952,"longitude":-106.5348379}],"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"tags7":["US Careers (External)"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 9+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 8+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science or related field AND 7+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR equivalent experience. 2+ years technical leadership experience. 9+ years of technical engineering experience in infrastructure domains 4+ years of experience with Kubernetes platform architecture, primitives, and experience with AWS or Azure cloud environments Preferred Qualifications: Experience operating Kubernetes in a high scale, production environment. Specific experience in managing/configuring AKS or EKS environments highly preferred. Competent in one or more scripting languages (e.g., Bash, Python, or a similar language). Knowledge of Hashicorp’s Terraform, Consul, and Vault products Experience with virtualization, bare metal deployment, or network engineering Experience with diagnosing and automating large, complex distributed systems with an eye toward reliability","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Build and improve the frameworks and tools we use to build, test, configure our Kubernetes clusters. Ensure a reliable Kubernetes platform across bare-metal, virtual machines, and cloud environments. Cultivate open source projects developed by GitHub and build things you are proud to share. Work closely with other engineering and infrastructure teams to design solutions and support Kubernetes workloads.","posted_date":"2025-08-29T18:03:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/4417/login","internal":false,"external":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"last_mod":"2025-08-29T18:04:46.432+00:00","icims":{"jps_is_public":true,"date_updated":"2025-08-29T18:04:00Z","primary_posted_site_object":{"site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9","datePosted":"2025-08-29T18:03:00+0000"},"config_keys":null,"revision_int":1,"uuid":"0c672e4c-13db-494a-9d55-cf084be56095"},"googlejobs":{"jobName":"projects/helpful-passage-853/jobs/119856952225211078","jobTitleSnippet":"","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","searchTextSnippet":"","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"radiusInMiles":2.6691467883166546,"postalAddress":{"regionCode":"US","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["United States"],"administrativeArea":"","languageCode":"","revision":0},"locationType":"COUNTRY","latLng":{"latitude":38.7945952,"longitude":-106.5348379}},{"radiusInMiles":2.6691467883166546,"postalAddress":{"regionCode":"US","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["United States"],"administrativeArea":"","languageCode":"","revision":0},"locationType":"COUNTRY","latLng":{"latitude":38.7945952,"longitude":-106.5348379}}]},"jobHash":"05136aa644bf40598938fce4333ce165","jobSummary":"Build and improve the frameworks and tools we use to build, test, configure our Kubernetes clusters. Ensure a reliable Kubernetes platform across bare-metal, virtual machines, and cloud environments. Cultivate open source projects developed by GitHub and build things you are proud to share. Work closely with other engineering and infrastructure teams to design solutions and support Kubernetes workloads."},"import_id":"e1278182-c93f-49ef-9904-a0aaa2e1ca55","redirectOnApply":true,"import_source":"ImporterService","canonical_url":"https://githubinc.jibeapply.com/jobs/4417?lang=en-us","client_code":"githubinc","gdpr":false},"update_date":"2025-08-29T18:04:46+0000","create_date":"2025-08-29T18:04:46+0000","category":[" Engineering"],"full_location":"United States; United States","short_location":"United States","multipleLocations":true}}],"locations":[],"totalCount":15,"request_id":false,"count":15,"languageCounts":{"en-us":{"displayName":"English","count":15}},"filter":{"facetList":{"tags4":[{"term":"Experienced Professional","count":15}],"tags5":[{"term":"Individual Contributor","count":12},{"term":"Director","count":1},{"term":"Senior Director","count":1},{"term":"Senior Manager","count":1}],"tags6":[{"term":"Yes","count":15}]},"displayLimit":10,"brands":{"all":[],"shortlist":[]},"categories":{"all":[{"category":"Engineering","numJobs":15}],"shortlist":[{"category":"Engineering","numJobs":15}]},"locations":{"all":[{"city":null,"state":null,"country":"Germany","count":1},{"city":null,"state":null,"country":"United States","count":14}],"shortlist":[{"city":null,"state":null,"country":"Germany","count":1},{"city":null,"state":null,"country":"United States","count":14}]},"experienceLevels":{"all":[],"shortlist":[]}}}