{"jobs":[{"data":{"slug":"4303","language":"en-us","languages":["en-us"],"req_id":"4303","title":"Senior Manager, Software Engineering","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview GitHub is the home for software development, where we collaborate to build the world's leading AI-powered developer platform. In the GitHub code scanning team, we are passionate about ensuring the security and quality of the world’s software - from open source to the enterprise. We believe that the best way to secure and improve the quality of software is to detect actionable issues early in the development process, and actively facilitate their remediation as part of the developer workflow. Our team develops CodeQL and Copilot Autofix, detection and remediation engines that power the GitHub code scanning product, used by hundreds of thousands of developers and projects every day as part of GitHub's Advanced Security offering. CodeQL is GitHub's semantic code analysis engine that uses world-class static analysis research and technology to deeply analyze code, enabling the early detection of security vulnerabilities and correctness errors in software. CodeQL supports a wide range of programming languages, including C/C++, C#, Go, Java, JavaScript/TypeScript, Kotlin, Python, Ruby, and Swift. Copilot Autofix is GitHub's LLM-powered remediation engine that produces high-quality fix suggestions for code scanning alerts, empowering developers to fix alerts as soon as they are found or that already exist in their codebase. We work as a distributed group within a distributed company. The majority of our team members live across Europe, the US, and Canada, and while we do have some offices, all our meetings are location-agnostic and happen online. We operate with a high degree of autonomy and trust, and we have a significant level of influence on the product and technical direction of CodeQL, code scanning, and the broader set of security products at GitHub. We value learning, introspection and reflection, and we’re always looking for ways to improve as a team and as individuals, so candor and a culture that values safety to speak up are highly important to us. Responsibilities We are looking for a Senior Engineering Manager to lead one of the distributed software engineering teams responsible for building and expanding CodeQL. In this role you will lead a team working in one of the following areas, selected based on your own experience and interests, and the needs of the organization at the time of hiring: Code analysis: Maintaining detection support for multiple programming languages, including: building source code extractors that translate code written in each language into data that CodeQL can understand, keeping up with the latest version of each supported languag writing and maintaining queries in the CodeQL query language that accurately detect security vulnerabilities and undesirable coding patterns ensuring the quality of LLM-powered Copilot Autofix suggestions for fixing the alerts found building analysis libraries in the CodeQL query language that reason precisely about the semantics of programming languages, supporting the development of queries across all languages experimenting with and robustly evaluating LLM-powered detection engines and integration between LLMs and traditional static analysis. Foundations: Developing QL, the query language powering CodeQL analysis, and its underlying query compiler and evaluator within the CodeQL CLI. Expanding the expressive power of the CodeQL query language and speeding up the performance of the underlying query engine, empowering other teams to write high-quality analysis, and ensuring that CodeQL scales to the largest codebases in the world. Experiences: Developing the CodeQL CLI and the CodeQL Action, integrating CodeQL as a code scanning tool running in production in GitHub Actions, third-party CI systems, the command line, and the IDE. As a manager and leader, you’ll coach and develop the team, providing regular feedback, and helping each individual to learn, grow and develop their career. You will work closely with various engineering teams, product managers, designers, and technical writers that build different aspects of the code scanning product, to influence product direction and deliver features to users, with clear focus on quality, reliability, and user experience. You will engage with internal users and external users (both from enterprise customers and the open-source community) to help them succeed with the product. You’ll help shape an environment of psychological safety which values experimentation and continuous learning. You’ll influence and provide feedback on the organizational culture and processes, always looking for opportunities to improve in a continuous pursuit for excellence. Qualifications Required Qualifications 6+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript/TypeScript, Go, Ruby, Rust, or Python. OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript/TypeScript, Go, Ruby, Rust, or Python. OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript/TypeScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript/TypeScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field. OR equivalent experience. 1+ year(s) direct and/or indirect people management or leadership experience. 2+ years of experience with one or more of the following areas: Software security, including static analysis, dynamic analysis, software supply chain security, and best practices in creating high-quality, secure code. Experience building developer tools that operate on source code, such as compilers, parsers, linters, static analyzers, debuggers, CLI tools, or IDE extensions. Machine learning applied to understanding source code or other structured data, specifically using prompt engineering with large language models (LLMs) and systematic benchmarking and evaluation of AI-based systems. Preferred Qualifications Excellent written and verbal communication skills. Passionate about fostering good engineering practices, tools, and processes. Experience working in and leading a distributed team, including operating effectively across multiple time zones (our teams span a wide time zone range from Pacific time to Central European time), recruiting, retaining team members, managing performance, calibrating expectations, providing feedback, and teaching/mentoring others. Ability to work with multiple stakeholders and teams across engineering, product, and design, and create a shared understanding of decision making, direction, priorities, and progress between the team, the org, and the broader company. Experience operating user-facing software at scale, including availability, observability, and security fundamentals. Industry or research knowledge of compilers, program analysis, programming language design and implementation. Knowledge of logic programming or database query languages (e.g. SQL, Prolog, Datalog, Kusto Query Language). Experience building integrations with CI/CD systems, such as GitHub Actions or Jenkins. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. Equal Employment Opportunity GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"United Kingdom Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Senior Manager"],"tags6":["Yes"],"tags7":["Global Careers (External)"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications 6+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript/TypeScript, Go, Ruby, Rust, or Python. OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript/TypeScript, Go, Ruby, Rust, or Python. OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript/TypeScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript/TypeScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field. OR equivalent experience. 1+ year(s) direct and/or indirect people management or leadership experience. 2+ years of experience with one or more of the following areas: Software security, including static analysis, dynamic analysis, software supply chain security, and best practices in creating high-quality, secure code. Experience building developer tools that operate on source code, such as compilers, parsers, linters, static analyzers, debuggers, CLI tools, or IDE extensions. Machine learning applied to understanding source code or other structured data, specifically using prompt engineering with large language models (LLMs) and systematic benchmarking and evaluation of AI-based systems. Preferred Qualifications Excellent written and verbal communication skills. Passionate about fostering good engineering practices, tools, and processes. Experience working in and leading a distributed team, including operating effectively across multiple time zones (our teams span a wide time zone range from Pacific time to Central European time), recruiting, retaining team members, managing performance, calibrating expectations, providing feedback, and teaching/mentoring others. Ability to work with multiple stakeholders and teams across engineering, product, and design, and create a shared understanding of decision making, direction, priorities, and progress between the team, the org, and the broader company. Experience operating user-facing software at scale, including availability, observability, and security fundamentals. Industry or research knowledge of compilers, program analysis, programming language design and implementation. Knowledge of logic programming or database query languages (e.g. SQL, Prolog, Datalog, Kusto Query Language). Experience building integrations with CI/CD systems, such as GitHub Actions or Jenkins.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"We are looking for a Senior Engineering Manager to lead one of the distributed software engineering teams responsible for building and expanding CodeQL. In this role you will lead a team working in one of the following areas, selected based on your own experience and interests, and the needs of the organization at the time of hiring: Code analysis: Maintaining detection support for multiple programming languages, including: building source code extractors that translate code written in each language into data that CodeQL can understand, keeping up with the latest version of each supported languag writing and maintaining queries in the CodeQL query language that accurately detect security vulnerabilities and undesirable coding patterns ensuring the quality of LLM-powered Copilot Autofix suggestions for fixing the alerts found building analysis libraries in the CodeQL query language that reason precisely about the semantics of programming languages, supporting the development of queries across all languages experimenting with and robustly evaluating LLM-powered detection engines and integration between LLMs and traditional static analysis. Foundations: Developing QL, the query language powering CodeQL analysis, and its underlying query compiler and evaluator within the CodeQL CLI. Expanding the expressive power of the CodeQL query language and speeding up the performance of the underlying query engine, empowering other teams to write high-quality analysis, and ensuring that CodeQL scales to the largest codebases in the world. Experiences: Developing the CodeQL CLI and the CodeQL Action, integrating CodeQL as a code scanning tool running in production in GitHub Actions, third-party CI systems, the command line, and the IDE. As a manager and leader, you’ll coach and develop the team, providing regular feedback, and helping each individual to learn, grow and develop their career. You will work closely with various engineering teams, product managers, designers, and technical writers that build different aspects of the code scanning product, to influence product direction and deliver features to users, with clear focus on quality, reliability, and user experience. You will engage with internal users and external users (both from enterprise customers and the open-source community) to help them succeed with the product. You’ll help shape an environment of psychological safety which values experimentation and continuous learning. You’ll influence and provide feedback on the organizational culture and processes, always looking for opportunities to improve in a continuous pursuit for excellence.","posted_date":"2025-07-18T19:14:00+0000","apply_url":"https://globalcareers-githubinc.icims.com/jobs/4303/login","internal":false,"external":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"last_mod":"2025-07-18T19:17:29.669+00:00","icims":{"jps_is_public":true,"date_updated":"2025-07-18T19:17:24Z","primary_posted_site_object":{"site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750","datePosted":"2025-07-18T19:14:00+0000"},"config_keys":null,"revision_int":2,"uuid":"8c08a3db-9175-4aa6-8d70-3435b2234ba1"},"googlejobs":{"jobName":"projects/helpful-passage-853/jobs/118879895752188614","jobTitleSnippet":"","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","searchTextSnippet":"","derivedInfo":{"jobCategories":["COMPUTER_AND_IT","MANAGEMENT"],"locations":[{"radiusInMiles":0.5229118491937161,"postalAddress":{"regionCode":"GB","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","revision":0},"locationType":"COUNTRY","latLng":{"latitude":55.378051,"longitude":-3.435973}}]},"jobHash":"4ed9020325aef1611870b7f7ee7983a0","jobSummary":"We are looking for a Senior Engineering Manager to lead one of the distributed software engineering teams responsible for building and expanding CodeQL. In this role you will lead a team working in one of the following areas, selected based on your own experience and interests, and the needs of the organization at the time of hiring: Code analysis: Maintaining detection support for multiple programming languages, including: building source code extractors that translate code written in each language into data that CodeQL can understand, keeping up with the latest version of each supported languag writing and maintaining queries in the CodeQL query language that accurately detect security vulnerabilities and undesirable coding patterns ensuring the quality of LLM-powered Copilot Autofix suggestions for fixing the alerts found building analysis libraries in the CodeQL query language that reason precisely about the semantics of programming languages, supporting the development of queries across all languages experimenting with and robustly evaluating LLM-powered detection engines and integration between LLMs and traditional static analysis. Foundations: Developing QL, the query language powering CodeQL analysis, and its underlying query compiler and evaluator within the CodeQL CLI. Expanding the expressive power of the CodeQL query language and speeding up the performance of the underlying query engine, empowering other teams to write high-quality analysis, and ensuring that CodeQL scales to the largest codebases in the world. Experiences: Developing the CodeQL CLI and the CodeQL Action, integrating CodeQL as a code scanning tool running in production in GitHub Actions, third-party CI systems, the command line, and the IDE. As a manager and leader, you’ll coach and develop the team, providing regular feedback, and helping each individual to learn, grow and develop their career. You will work closely with various engineering teams, product managers, designers, and technical writers that build different aspects of the code scanning product, to influence product direction and deliver features to users, with clear focus on quality, reliability, and user experience. You will engage with internal users and external users (both from enterprise customers and the open-source community) to help them succeed with the product. You’ll help shape an environment of psychological safety which values experimentation and continuous learning. You’ll influence and provide feedback on the organizational culture and processes, always looking for opportunities to improve in a continuous pursuit for excellence."},"import_id":"08d24fbd-57a3-4c18-a52a-0c78d9c8a808","redirectOnApply":true,"import_source":"ImporterService","canonical_url":"https://githubinc.jibeapply.com/jobs/4303?lang=en-us","client_code":"githubinc","gdpr":true},"update_date":"2025-07-18T19:17:29+0000","create_date":"2025-07-18T19:14:29+0000","category":[" Engineering"],"full_location":"United Kingdom","short_location":"United Kingdom","multipleLocations":false}},{"data":{"slug":"4312","language":"en-us","languages":["en-us"],"req_id":"4312","title":"Staff Technical Program Manager","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview At GitHub, Technical Program Managers (TPMs) are at the heart of building and launching products that inspire our users and propel our business forward. As a Staff TPM focused on Copilot, you will drive the strategy and execution of critical initiatives at the intersection of AI and developer productivity. This is a highly visible, high-impact role that partners with engineering, product, and cross-functional stakeholders to solve complex technical challenges, identify and unblock bottlenecks, and ensure Copilot maintains its industry leadership. You’ll operate with a strong bias for action, proactively manage risk, foster seamless collaboration, and continuously evolve our ways of working to accelerate delivery in a fast-paced, competitive market. Responsibilities What You’ll Do Drive Program Strategy \u0026 Execution: Partner with product, engineering, and business leaders to define program vision, develop roadmaps, and execute against strategic milestones. Cross-Functional Orchestration: Proactively identify dependencies and manage complex integrations across engineering, go-to-market, legal, and customer-facing teams to deliver cohesive solutions. Transparent Communication: Provide crisp, actionable updates on program status, risks, and mitigations to stakeholders at all levels including the GitHub executive team. Technical \u0026 Business Leadership: Combine deep technical understanding with business savvy to influence priorities, anticipate challenges, and make data-driven trade-offs. Continuous Process Optimization: Design and implement scalable processes, tools, and frameworks that enable the TPM function and empower teams to move with speed and rigor. Executive Engagement: Facilitate executive-level discussions, aligning stakeholders, and driving decisions that unlock program success. Who You Are Strategic Program Leader: You’re a hands-on leader, equally comfortable in the weeds and presenting to executives. Connector \u0026 Mobilizer: You build trust and alignment across diverse, globally distributed teams to deliver ambitious results. Team Empowerer: You champion autonomy, growth, and accountability—removing roadblocks and inspiring high performance. Detail-Oriented Operator: You spot risks early, sweat the details, and hold the bar high for quality and customer impact. Change Agent: You thrive in ambiguity, adapting quickly and guiding teams through complexity and rapid change. Collaborative by Nature: You foster a culture of openness, inclusion, and shared success. Qualifications Required Qualifications 8+ years experience in engineering, product/technical program management, data analysis, or product development OR Bachelor's Degree in Computer Science, Engineering, Data Science, Math, Business, or related field AND 6+ years experience in engineering, product/technical program management, data analysis, or product development OR Master's Degree in Computer Science, Engineering, Data Science, Math, Business, or related field AND 4+ years experience in engineering, product/technical program management, data analysis, or product development OR equivalent experience. 7+ years working directly with engineering, product, and business teams to deliver new products at scale. 5+ years experience in managing cross-functional and/or cross-team projects. Preferred Qualifications 12+ years experience in engineering, product/technical program management, data analysis, or product development OR Bachelor's Degree in Computer Science, Engineering, Data Science, Math, Business, or related field AND 10+ years experience in engineering, product/technical program management, data analysis, or product development OR Master's Degree in Computer Science, Engineering, Data Science, Math, Business, or related field AND 8+ years experience in engineering, product/technical program management, data analysis, or product development OR Doctorate in Computer Science, Engineering, Data Science, Math, Business, or related field AND 6+ years experience in engineering, product/technical program management, data analysis, or product development OR equivalent experience. 8+ years experience in managing cross-functional and/or cross-team projects. 4+ years experience designing, building, or supporting software systems. Why GitHub, Why Now? This is a unique opportunity to help shape the future of AI-powered development, working alongside world-class talent at the company that’s redefining software. If you’re ready to make an outsized impact at scale, we’d love to hear from you. Compensation Range The base salary range for this job is USD $127,600.00 - USD $338,500.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"tags7":["US Careers (External)"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications 8+ years experience in engineering, product/technical program management, data analysis, or product development OR Bachelor's Degree in Computer Science, Engineering, Data Science, Math, Business, or related field AND 6+ years experience in engineering, product/technical program management, data analysis, or product development OR Master's Degree in Computer Science, Engineering, Data Science, Math, Business, or related field AND 4+ years experience in engineering, product/technical program management, data analysis, or product development OR equivalent experience. 7+ years working directly with engineering, product, and business teams to deliver new products at scale. 5+ years experience in managing cross-functional and/or cross-team projects. Preferred Qualifications 12+ years experience in engineering, product/technical program management, data analysis, or product development OR Bachelor's Degree in Computer Science, Engineering, Data Science, Math, Business, or related field AND 10+ years experience in engineering, product/technical program management, data analysis, or product development OR Master's Degree in Computer Science, Engineering, Data Science, Math, Business, or related field AND 8+ years experience in engineering, product/technical program management, data analysis, or product development OR Doctorate in Computer Science, Engineering, Data Science, Math, Business, or related field AND 6+ years experience in engineering, product/technical program management, data analysis, or product development OR equivalent experience. 8+ years experience in managing cross-functional and/or cross-team projects. 4+ years experience designing, building, or supporting software systems. Why GitHub, Why Now? This is a unique opportunity to help shape the future of AI-powered development, working alongside world-class talent at the company that’s redefining software. If you’re ready to make an outsized impact at scale, we’d love to hear from you.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"What You’ll Do Drive Program Strategy \u0026 Execution: Partner with product, engineering, and business leaders to define program vision, develop roadmaps, and execute against strategic milestones. Cross-Functional Orchestration: Proactively identify dependencies and manage complex integrations across engineering, go-to-market, legal, and customer-facing teams to deliver cohesive solutions. Transparent Communication: Provide crisp, actionable updates on program status, risks, and mitigations to stakeholders at all levels including the GitHub executive team. Technical \u0026 Business Leadership: Combine deep technical understanding with business savvy to influence priorities, anticipate challenges, and make data-driven trade-offs. Continuous Process Optimization: Design and implement scalable processes, tools, and frameworks that enable the TPM function and empower teams to move with speed and rigor. Executive Engagement: Facilitate executive-level discussions, aligning stakeholders, and driving decisions that unlock program success. Who You Are Strategic Program Leader: You’re a hands-on leader, equally comfortable in the weeds and presenting to executives. Connector \u0026 Mobilizer: You build trust and alignment across diverse, globally distributed teams to deliver ambitious results. Team Empowerer: You champion autonomy, growth, and accountability—removing roadblocks and inspiring high performance. Detail-Oriented Operator: You spot risks early, sweat the details, and hold the bar high for quality and customer impact. Change Agent: You thrive in ambiguity, adapting quickly and guiding teams through complexity and rapid change. Collaborative by Nature: You foster a culture of openness, inclusion, and shared success.","posted_date":"2025-07-25T17:47:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/4312/login","internal":false,"external":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"last_mod":"2025-07-25T17:53:59.495+00:00","icims":{"jps_is_public":true,"date_updated":"2025-07-25T17:53:05Z","primary_posted_site_object":{"site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9","datePosted":"2025-07-25T17:47:00+0000"},"config_keys":null,"revision_int":2,"uuid":"ae4e335e-ae51-45ae-b5b6-06ee9aec9ebe"},"googlejobs":{"jobName":"projects/helpful-passage-853/jobs/111215800416641734","jobTitleSnippet":"","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","searchTextSnippet":"","derivedInfo":{"jobCategories":["MANAGEMENT","COMPUTER_AND_IT"],"locations":[{"radiusInMiles":2.6691467883166546,"postalAddress":{"regionCode":"US","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["United States"],"administrativeArea":"","languageCode":"","revision":0},"locationType":"COUNTRY","latLng":{"latitude":38.7945952,"longitude":-106.5348379}}]},"jobHash":"373b6afe21063b2d453e09783dd60751","jobSummary":"What You’ll Do Drive Program Strategy \u0026 Execution: Partner with product, engineering, and business leaders to define program vision, develop roadmaps, and execute against strategic milestones. Cross-Functional Orchestration: Proactively identify dependencies and manage complex integrations across engineering, go-to-market, legal, and customer-facing teams to deliver cohesive solutions. Transparent Communication: Provide crisp, actionable updates on program status, risks, and mitigations to stakeholders at all levels including the GitHub executive team. Technical \u0026 Business Leadership: Combine deep technical understanding with business savvy to influence priorities, anticipate challenges, and make data-driven trade-offs. Continuous Process Optimization: Design and implement scalable processes, tools, and frameworks that enable the TPM function and empower teams to move with speed and rigor. Executive Engagement: Facilitate executive-level discussions, aligning stakeholders, and driving decisions that unlock program success. Who You Are Strategic Program Leader: You’re a hands-on leader, equally comfortable in the weeds and presenting to executives. Connector \u0026 Mobilizer: You build trust and alignment across diverse, globally distributed teams to deliver ambitious results. Team Empowerer: You champion autonomy, growth, and accountability—removing roadblocks and inspiring high performance. Detail-Oriented Operator: You spot risks early, sweat the details, and hold the bar high for quality and customer impact. Change Agent: You thrive in ambiguity, adapting quickly and guiding teams through complexity and rapid change. Collaborative by Nature: You foster a culture of openness, inclusion, and shared success."},"import_id":"af6f51f8-05d4-49ab-80ed-753d39267178","redirectOnApply":true,"import_source":"ImporterService","canonical_url":"https://githubinc.jibeapply.com/jobs/4312?lang=en-us","client_code":"githubinc","gdpr":false},"update_date":"2025-07-25T17:53:59+0000","create_date":"2025-07-25T17:48:58+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"4265","language":"en-us","languages":["en-us"],"req_id":"4265","title":"Senior Software Engineer, Supply Chain Security","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview As an engineer at GitHub, you will work with a distributed, diverse and passionate team delivering the services that millions of developers rely on to build their own software. The Dependabot team is looking for a Senior Software Engineer to help us create a world-class offering in the Software Composition Analysis (SCA) space. The ideal candidate will have a background in large distributed systems, high-throughput cloud architectures, and an obsession with getting genuine accuracy in squishy domains. You’re an outside-the-box thinker with an interest in the cutting edge, but a strong pragmatic streak. People tend to follow your lead because you go to sensible places. Responsibilities Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Mentor junior engineers Provide technical leadership, mentorship, pairing opportunities, and code reviews Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code. Qualifications Required Qualifications: 6+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related fie OR equivalent experience. 6+ years of experience with relational databases (MySQL, PSQL, MSSQL, etc) 1+ year experience shipping production software on a big 3 cloud platform (AWS, GCP, Azure) Preferred Qualifications: At least one year of experience as a non-management team lead Previous experience working at a senior level on a cyber security product working at a relatively large scale (billions of writes/day) building ETL pipelines and succeeding with asynchronous architectures building with frontier AI models maintaining non-obscure open source projects Interest in Software Composition Analysis Strong passion for Ruby and/or Go An understanding of GitHub’s place in the open source software world Deep opinions on Dependabot An unshakable belief that winners ship Compensation Range The base salary range for this job is USD $112,800.00 - USD $299,300.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"tags7":["US Careers (External)"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 6+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related fie OR equivalent experience. 6+ years of experience with relational databases (MySQL, PSQL, MSSQL, etc) 1+ year experience shipping production software on a big 3 cloud platform (AWS, GCP, Azure) Preferred Qualifications: At least one year of experience as a non-management team lead Previous experience working at a senior level on a cyber security product working at a relatively large scale (billions of writes/day) building ETL pipelines and succeeding with asynchronous architectures building with frontier AI models maintaining non-obscure open source projects Interest in Software Composition Analysis Strong passion for Ruby and/or Go An understanding of GitHub’s place in the open source software world Deep opinions on Dependabot An unshakable belief that winners ship","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Mentor junior engineers Provide technical leadership, mentorship, pairing opportunities, and code reviews Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","posted_date":"2025-07-30T19:56:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/4265/login","internal":false,"external":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"last_mod":"2025-08-12T22:08:09.718+00:00","icims":{"jps_is_public":true,"date_updated":"2025-08-12T22:07:49Z","primary_posted_site_object":{"site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9","datePosted":"2025-07-30T19:56:00+0000"},"config_keys":null,"revision_int":11,"uuid":"b68bc8dd-5670-44ef-8697-45dd995896bf"},"googlejobs":{"jobName":"projects/helpful-passage-853/jobs/100091278921736902","jobTitleSnippet":"","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","searchTextSnippet":"","derivedInfo":{"jobCategories":["COMPUTER_AND_IT","TRANSPORTATION_AND_LOGISTICS","BUSINESS_OPERATIONS"],"locations":[{"radiusInMiles":2.6691467883166546,"postalAddress":{"regionCode":"US","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["United States"],"administrativeArea":"","languageCode":"","revision":0},"locationType":"COUNTRY","latLng":{"latitude":38.7945952,"longitude":-106.5348379}}]},"jobHash":"d4c299dc4daa0956eb6705d85374d67f","jobSummary":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Mentor junior engineers Provide technical leadership, mentorship, pairing opportunities, and code reviews Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code."},"import_id":"d7313d94-7286-4217-bf92-c9ed3865b726","redirectOnApply":true,"import_source":"ImporterService","canonical_url":"https://githubinc.jibeapply.com/jobs/4265?lang=en-us","client_code":"githubinc","gdpr":false},"update_date":"2025-08-12T22:08:09+0000","create_date":"2025-07-30T19:57:13+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"4401","language":"en-us","languages":["en-us"],"req_id":"4401","title":"Software Engineer III","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is changing the way the world builds software, and we want you to help. At GitHub, we constantly strive to create an environment that allows our employees to do the best work of their lives. GitHub is looking for a talented Software Engineer III to join our Platform Team in the Development Experience department. Our team is working on a new, exciting product that will enable all GitHubs engineers to maintain and orchestrate their deployment process in one single app. We’re looking for creative problem solvers and diverse thinkers who value culture as much as customers and features. We believe how we work is just as important as what we deliver. Big vision, shared purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what drive great results. Great products reflect the teams that build them—come join us! Responsibilities Build tools and systems that empathetically and pragmatically meet real operability needs of GitHub developers. Develop and maintain scalable infrastructure. Use data to understand the availability, reliability, and sustainability of our infrastructure. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary. Collaborates with appropriate stakeholders (e.g., project manager, technical lead) to determine requirements for a scenario. Leverages a variety of feedback channels to incorporate insights into future designs or solution fixes. Leads discussions for the technical solutions of products/features within the team's area of responsibility and creates proposals for architecture by testing design hypotheses and helping to refine code plans. Participates in code reviews to ensure coding standards are followed and that it meets the team's and GitHub's quality standards, is reliable and accurate, and is appropriate for the scale of the product/solution area. Qualifications Required Qualifications 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field OR equivalent experience. 1+ years of experience in Go and Javascript. Preferred Qualifications Coding project leadership experience. Proficiency in programming languages such as Ruby and TypeScript. Proven incident response experience including an ability to mitigate impact under pressure. Experience with various DevSecOps and CI/CD tools. Excellent written and verbal communication skills. Prior experience with best practices when working and communicating with a remote team. Other Requirements Ability to meet GitHub, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft, GitHub’s parent company, Cloud Screen upon hire/transfer and every two years thereafter. Compensation Range The base salary range for this job is USD $97,900.00 - USD $259,900.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"tags7":["US Careers (External)"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field OR equivalent experience. 1+ years of experience in Go and Javascript. Preferred Qualifications Coding project leadership experience. Proficiency in programming languages such as Ruby and TypeScript. Proven incident response experience including an ability to mitigate impact under pressure. Experience with various DevSecOps and CI/CD tools. Excellent written and verbal communication skills. Prior experience with best practices when working and communicating with a remote team. Other Requirements Ability to meet GitHub, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft, GitHub’s parent company, Cloud Screen upon hire/transfer and every two years thereafter.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Build tools and systems that empathetically and pragmatically meet real operability needs of GitHub developers. Develop and maintain scalable infrastructure. Use data to understand the availability, reliability, and sustainability of our infrastructure. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary. Collaborates with appropriate stakeholders (e.g., project manager, technical lead) to determine requirements for a scenario. Leverages a variety of feedback channels to incorporate insights into future designs or solution fixes. Leads discussions for the technical solutions of products/features within the team's area of responsibility and creates proposals for architecture by testing design hypotheses and helping to refine code plans. Participates in code reviews to ensure coding standards are followed and that it meets the team's and GitHub's quality standards, is reliable and accurate, and is appropriate for the scale of the product/solution area.","posted_date":"2025-08-12T17:26:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/4401/login","internal":false,"external":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"last_mod":"2025-08-12T17:27:09.716+00:00","icims":{"jps_is_public":true,"date_updated":"2025-08-12T17:27:00Z","primary_posted_site_object":{"site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9","datePosted":"2025-08-12T17:26:00+0000"},"config_keys":null,"revision_int":1,"uuid":"6fd42997-c6d2-4117-8f86-f13bcad3a28a"},"googlejobs":{"jobName":"projects/helpful-passage-853/jobs/115100850396766918","jobTitleSnippet":"","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","searchTextSnippet":"","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"radiusInMiles":2.6691467883166546,"postalAddress":{"regionCode":"US","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["United States"],"administrativeArea":"","languageCode":"","revision":0},"locationType":"COUNTRY","latLng":{"latitude":38.7945952,"longitude":-106.5348379}}]},"jobHash":"f832c1faaa719475b4ae098f3573cf0a","jobSummary":"Build tools and systems that empathetically and pragmatically meet real operability needs of GitHub developers. Develop and maintain scalable infrastructure. Use data to understand the availability, reliability, and sustainability of our infrastructure. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary. Collaborates with appropriate stakeholders (e.g., project manager, technical lead) to determine requirements for a scenario. Leverages a variety of feedback channels to incorporate insights into future designs or solution fixes. Leads discussions for the technical solutions of products/features within the team's area of responsibility and creates proposals for architecture by testing design hypotheses and helping to refine code plans. Participates in code reviews to ensure coding standards are followed and that it meets the team's and GitHub's quality standards, is reliable and accurate, and is appropriate for the scale of the product/solution area."},"import_id":"66702c75-3e8b-481d-bf8d-7e29c9fec2a0","redirectOnApply":true,"import_source":"ImporterService","canonical_url":"https://githubinc.jibeapply.com/jobs/4401?lang=en-us","client_code":"githubinc","gdpr":false},"update_date":"2025-08-12T17:27:09+0000","create_date":"2025-08-12T17:27:09+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"4317","language":"en-us","languages":["en-us"],"req_id":"4317","title":"Staff Mgr, Software Engineering, Actions MacOS Platform","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is growing its Engineering team and seeks experienced professionals to elevate our software engineering efforts. As a Staff Manager of Software Engineering, you will lead teams in developing cost-effective, secure technical solutions and ensure system architecture aligns with business goals. The ideal candidate will drive strategic initiatives, enhance team collaboration, and gain insights into innovative engineering practices while shaping technology offerings within a dynamic and inclusive environment. Actions is a core part of GitHub and enables developers around the world. Millions of GitHub customers will rely on your team's work every single day. Actions Mac Cloud owns the end to end lifecycle of the fleet of machines that power all our hosted Mac runners for GitHub Actions. This includes: Obtaining and provisioning hardware Working with data centers to deploy our hardware Building deployment and runtime software to provision and manage Mac hardware and virtual machines Interfacing with multiple vendors and engineering teams to accomplish the above You’ll be supporting engineers distributed across the United States working closely with the teams building Actions. You’ll help set business and product direction, and you’ll be involved in implementation, scaling, reliability and customer success to ensure we’re setting our teams and customers up for success. The people on our teams believe that creating great products for GitHub users is a ton of fun, and you’ll be inspired by the opportunity to help enable developers all over the world to build world-changing things with our tools. Responsibilities Partner with your team, other engineering teams, and product partners to enable the macOS runner capabilities needed by our customers. Lead the team to meet the service's high availability and scale requirements. Partner closely with Product and external stakeholders and vendors on planning, execution, and communication of long-term initiatives, delivering against our business objectives Hire, coach, and retain top engineering talent, fostering a culture of innovation and continuous learning. Lead and manage team performance, driving employee development and career growth through mentorship, knowledge sharing, and delegation of work. Think creatively while balancing technical constraints and customer needs to enable your team to build architecturally consistent, high quality software to reliably meet customer needs and exceed their expectations Own and advocate for the health and quality of the systems that the team builds, participate in a manager on-call rotation, and respond to incidents as necessary Drive data driven improvements to both product quality and engineering efficiency Qualifications Required Qualifications: 9+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR associate’s degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 8+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR bachelor's degree in Computer Science or related field AND 7+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR master's degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR equivalent experience. 3+ years people management experience 5+ years of experience developing backend services for large scale systems. 1+ years of experience working with data centers and vendors Preferred Qualifications: Experience leading engineering teams delivering high-availability enterprise-grade services Passionate about fostering good engineering practices and processes Experience developing a strategy and roadmap for your teams Experience with hiring \u0026 building teams Experience with maintaining production systems including: monitoring, observability and diagnosing problems Excellent analytical skills as well as communication skills both verbal and written. We’re a distributed team so we’re extra mindful about communication. MacOS Strong customer focus and data driven approach At least 1 year of remote work experience leading a distributed software team 2+ years of experience on teams building infra as code Compensation Range The base salary range for this job is USD $127,600.00 - USD $338,500.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Director"],"tags6":["Yes"],"tags7":["US Careers (External)"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 9+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR associate’s degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 8+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR bachelor's degree in Computer Science or related field AND 7+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR master's degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR equivalent experience. 3+ years people management experience 5+ years of experience developing backend services for large scale systems. 1+ years of experience working with data centers and vendors Preferred Qualifications: Experience leading engineering teams delivering high-availability enterprise-grade services Passionate about fostering good engineering practices and processes Experience developing a strategy and roadmap for your teams Experience with hiring \u0026 building teams Experience with maintaining production systems including: monitoring, observability and diagnosing problems Excellent analytical skills as well as communication skills both verbal and written. We’re a distributed team so we’re extra mindful about communication. MacOS Strong customer focus and data driven approach At least 1 year of remote work experience leading a distributed software team 2+ years of experience on teams building infra as code","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Partner with your team, other engineering teams, and product partners to enable the macOS runner capabilities needed by our customers. Lead the team to meet the service's high availability and scale requirements. Partner closely with Product and external stakeholders and vendors on planning, execution, and communication of long-term initiatives, delivering against our business objectives Hire, coach, and retain top engineering talent, fostering a culture of innovation and continuous learning. Lead and manage team performance, driving employee development and career growth through mentorship, knowledge sharing, and delegation of work. Think creatively while balancing technical constraints and customer needs to enable your team to build architecturally consistent, high quality software to reliably meet customer needs and exceed their expectations Own and advocate for the health and quality of the systems that the team builds, participate in a manager on-call rotation, and respond to incidents as necessary Drive data driven improvements to both product quality and engineering efficiency","posted_date":"2025-07-30T15:25:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/4317/login","internal":false,"external":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"last_mod":"2025-08-04T20:32:13.366+00:00","icims":{"jps_is_public":true,"date_updated":"2025-08-04T20:31:53Z","primary_posted_site_object":{"site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9","datePosted":"2025-07-30T15:25:00+0000"},"config_keys":null,"revision_int":2,"uuid":"f909ccf9-bc57-43f9-b0dc-3795d50a2dfc"},"googlejobs":{"jobName":"projects/helpful-passage-853/jobs/90571020053684934","jobTitleSnippet":"","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","searchTextSnippet":"","derivedInfo":{"jobCategories":["COMPUTER_AND_IT","MANAGEMENT"],"locations":[{"radiusInMiles":2.6691467883166546,"postalAddress":{"regionCode":"US","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["United States"],"administrativeArea":"","languageCode":"","revision":0},"locationType":"COUNTRY","latLng":{"latitude":38.7945952,"longitude":-106.5348379}}]},"jobHash":"1bf45b6fcac35ea88be5532970903205","jobSummary":"Partner with your team, other engineering teams, and product partners to enable the macOS runner capabilities needed by our customers. Lead the team to meet the service's high availability and scale requirements. Partner closely with Product and external stakeholders and vendors on planning, execution, and communication of long-term initiatives, delivering against our business objectives Hire, coach, and retain top engineering talent, fostering a culture of innovation and continuous learning. Lead and manage team performance, driving employee development and career growth through mentorship, knowledge sharing, and delegation of work. Think creatively while balancing technical constraints and customer needs to enable your team to build architecturally consistent, high quality software to reliably meet customer needs and exceed their expectations Own and advocate for the health and quality of the systems that the team builds, participate in a manager on-call rotation, and respond to incidents as necessary Drive data driven improvements to both product quality and engineering efficiency"},"import_id":"dbc8b0ad-1bfe-4ff0-89d2-276f3eec5dae","redirectOnApply":true,"import_source":"ImporterService","canonical_url":"https://githubinc.jibeapply.com/jobs/4317?lang=en-us","client_code":"githubinc","gdpr":false},"update_date":"2025-08-04T20:32:13+0000","create_date":"2025-07-30T15:26:11+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"4369","language":"en-us","languages":["en-us"],"req_id":"4369","title":"Senior Software Engineer, Data","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview Senior Software Engineer, Data As a software engineer at GitHub, you will enhance the collaboration experience at GitHub by working closely with a community of engineers and designers with a distributed, diverse and passionate team delivering the services that millions of developers depend on. In this role you will design, prototype, implement, ship and support highly performant and inspiring user experiences with your team. We are looking for creative problem solvers and diverse thinkers, people who care about culture as well as customers and features. We believe that how we do things is as important as what we do. Big vision, a common purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what lead to great results. Great products reflect the teams that build them. Responsibilities Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Mentor junior engineers Provide technical leadership, mentorship, pairing opportunities, and code reviews Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code. Qualifications Required Qualifications: 6+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related fie OR equivalent experience. Preferred Qualifications: Some experience in one or more scripting languages (e.g., Bash, Python, or a similar language) Some experience with cloud environments and/or Cloud Native Compute Foundation (CNCF) concepts Experience working with both relational (e.g. mysql) and most importantly non-relational datastores (e.g. Cosmos) Some experience with Golang Experience working with Azure resource such as Azure Storage (blob and table particularly), Azure Redis Cache, Azure Data Explorer Clusters. Experience operating Cosmos DB clusters at scale. Compensation Range The base salary range for this job is USD $112,800.00 - USD $299,300.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"tags7":["US Careers (External)"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 6+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related fie OR equivalent experience. Preferred Qualifications: Some experience in one or more scripting languages (e.g., Bash, Python, or a similar language) Some experience with cloud environments and/or Cloud Native Compute Foundation (CNCF) concepts Experience working with both relational (e.g. mysql) and most importantly non-relational datastores (e.g. Cosmos) Some experience with Golang Experience working with Azure resource such as Azure Storage (blob and table particularly), Azure Redis Cache, Azure Data Explorer Clusters. Experience operating Cosmos DB clusters at scale.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Mentor junior engineers Provide technical leadership, mentorship, pairing opportunities, and code reviews Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","posted_date":"2025-08-11T19:11:00+0000","posting_expiry_date":"2025-08-16T19:01:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/4369/login","internal":false,"external":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"last_mod":"2025-08-13T16:31:10.376+00:00","icims":{"jps_is_public":true,"date_updated":"2025-08-13T16:30:41Z","primary_posted_site_object":{"site":"careers-githubinc","validThrough":"2025-08-16T19:01:00+0000","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9","datePosted":"2025-08-11T19:11:00+0000"},"config_keys":null,"revision_int":4,"uuid":"a145da9f-4447-415a-a235-58c20da3ac9e"},"googlejobs":{"jobName":"projects/helpful-passage-853/jobs/117514673556726470","jobTitleSnippet":"","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","searchTextSnippet":"","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"radiusInMiles":2.6691467883166546,"postalAddress":{"regionCode":"US","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["United States"],"administrativeArea":"","languageCode":"","revision":0},"locationType":"COUNTRY","latLng":{"latitude":38.7945952,"longitude":-106.5348379}}]},"jobHash":"17ff27ac392b1d66b2f40668b7156eea","jobSummary":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Mentor junior engineers Provide technical leadership, mentorship, pairing opportunities, and code reviews Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code."},"import_id":"ff88ae0d-b451-42a7-af5f-f0348510bf81","redirectOnApply":true,"import_source":"ImporterService","canonical_url":"https://githubinc.jibeapply.com/jobs/4369?lang=en-us","client_code":"githubinc","gdpr":false},"update_date":"2025-08-13T16:31:10+0000","create_date":"2025-08-11T19:12:09+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"4308","language":"en-us","languages":["en-us"],"req_id":"4308","title":"Senior Software Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview We’re expanding our Copilot engineering team within the Copilot Intelligence Platform organization, seeking a Senior Software Engineer to lead the development of scalable telemetry infrastructure, including APIs and data solutions for external customers. In this role, you will drive high-impact engineering projects, ensure data completeness and quality, and collaborate with cross-functional stakeholders to deliver secure, reliable data products. The ideal candidate brings strong technical expertise, clear communication, and a passion for building systems that support data-driven decisions in a fast-paced, collaborative environment Responsibilities Partners with appropriate stakeholders (e.g., product manager, technical lead) to determine user requirements for a set of scenarios. Leverages a variety of feedback channels to incorporate insights into future designs or solution fixes. Understands the customer need via data interpretation (e.g., metrics, bugs, customer feedback) provided and proactively identifies problems and/or trends for resolution. Begins to determine additional critical metrics. Leads efforts and discussions for the technical solutions of products/features (e.g., design, cost). Creates proposals for architecture and design documents, and leads testing of hypotheses and proposed design solutions. Shares and acts on findings from investigations, owns design decisions, and oversees the less experienced team members. Leads the development of design documents for initiatives, determines the technology that will be leveraged, and how that technology will interact. Leads design discussions with internal, interdisciplinary, and crossfunctional teams and shares findings/learnings from investigations, holding ownership for design decisions. Leads efforts to ensure system architecture meets security and compliance requirements and expectations. Independently creates and mentors others for a clear and articulated plan for testing and assuring the quality of solutions, and defines success for metrics of quality. Leads complex technical acquisition and integration of internal/external customer feedback into necessary changes to ensure a quality customer experience. Plans for the availability and scalability of technical features and changes in production with consideration for server health. Monitors the health of the services to make data driven projections on scalability. Leads efforts to apply knowledge of debugging tools, logs, telemetry, and other methods, and leads verification of assumptions. Writes and develops code proactively against issues before they occur and reinforce code as issues are identified across products. Leverages minimal telemetry data, triangulates issues, and resolves with minimal iterations. Leads retrospective debugging of solutions to identify patterns in root causes of problems, prevents future bugs across service areas, and reviews impact on other services for resolution. Provides technical leadership during code reviews for a solution/product area to ensure it meets the team's and GitHub's quality standards, is reliable and accurate, and is appropriate for the scale of the product feature. Understands the impact of the reviewed code and drafts proposals for code revisions beyond the assigned Service Area. Qualifications Required Qualifications: 6+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field. OR equivalent experience. Preferred Qualifications: Experience in one or more programming languages, technologies and software platforms, such as Ruby on Rails, MySQL, Kubernetes, or Kusto. Demonstrated experience with large-scale system architecture and design, particularly in cloud-based environments, with a strong understanding of distributed systems and microservices. Experience working closely with product management, design, and other engineering teams to drive cross-functional projects and deliver high-quality products. Professional experience in Golang. Compensation Range The base salary range for this job is USD $112,800.00 - USD $299,300.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"tags7":["US Careers (External)"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 6+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field. OR equivalent experience. Preferred Qualifications: Experience in one or more programming languages, technologies and software platforms, such as Ruby on Rails, MySQL, Kubernetes, or Kusto. Demonstrated experience with large-scale system architecture and design, particularly in cloud-based environments, with a strong understanding of distributed systems and microservices. Experience working closely with product management, design, and other engineering teams to drive cross-functional projects and deliver high-quality products. Professional experience in Golang.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Partners with appropriate stakeholders (e.g., product manager, technical lead) to determine user requirements for a set of scenarios. Leverages a variety of feedback channels to incorporate insights into future designs or solution fixes. Understands the customer need via data interpretation (e.g., metrics, bugs, customer feedback) provided and proactively identifies problems and/or trends for resolution. Begins to determine additional critical metrics. Leads efforts and discussions for the technical solutions of products/features (e.g., design, cost). Creates proposals for architecture and design documents, and leads testing of hypotheses and proposed design solutions. Shares and acts on findings from investigations, owns design decisions, and oversees the less experienced team members. Leads the development of design documents for initiatives, determines the technology that will be leveraged, and how that technology will interact. Leads design discussions with internal, interdisciplinary, and crossfunctional teams and shares findings/learnings from investigations, holding ownership for design decisions. Leads efforts to ensure system architecture meets security and compliance requirements and expectations. Independently creates and mentors others for a clear and articulated plan for testing and assuring the quality of solutions, and defines success for metrics of quality. Leads complex technical acquisition and integration of internal/external customer feedback into necessary changes to ensure a quality customer experience. Plans for the availability and scalability of technical features and changes in production with consideration for server health. Monitors the health of the services to make data driven projections on scalability. Leads efforts to apply knowledge of debugging tools, logs, telemetry, and other methods, and leads verification of assumptions. Writes and develops code proactively against issues before they occur and reinforce code as issues are identified across products. Leverages minimal telemetry data, triangulates issues, and resolves with minimal iterations. Leads retrospective debugging of solutions to identify patterns in root causes of problems, prevents future bugs across service areas, and reviews impact on other services for resolution. Provides technical leadership during code reviews for a solution/product area to ensure it meets the team's and GitHub's quality standards, is reliable and accurate, and is appropriate for the scale of the product feature. Understands the impact of the reviewed code and drafts proposals for code revisions beyond the assigned Service Area.","posted_date":"2025-08-13T17:32:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/4308/login","internal":false,"external":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"last_mod":"2025-08-13T17:33:11.097+00:00","icims":{"jps_is_public":true,"date_updated":"2025-08-13T17:32:37Z","primary_posted_site_object":{"site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9","datePosted":"2025-08-13T17:32:00+0000"},"config_keys":null,"revision_int":4,"uuid":"23f5cf79-12fb-43f4-b009-c9b155de8b2b"},"googlejobs":{"jobName":"projects/helpful-passage-853/jobs/80946986991133382","jobTitleSnippet":"","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","searchTextSnippet":"","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"radiusInMiles":2.6691467883166546,"postalAddress":{"regionCode":"US","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["United States"],"administrativeArea":"","languageCode":"","revision":0},"locationType":"COUNTRY","latLng":{"latitude":38.7945952,"longitude":-106.5348379}}]},"jobHash":"c77f28dad2c9b9d10a95c7c9afd202a1","jobSummary":"Partners with appropriate stakeholders (e.g., product manager, technical lead) to determine user requirements for a set of scenarios. Leverages a variety of feedback channels to incorporate insights into future designs or solution fixes. Understands the customer need via data interpretation (e.g., metrics, bugs, customer feedback) provided and proactively identifies problems and/or trends for resolution. Begins to determine additional critical metrics. Leads efforts and discussions for the technical solutions of products/features (e.g., design, cost). Creates proposals for architecture and design documents, and leads testing of hypotheses and proposed design solutions. Shares and acts on findings from investigations, owns design decisions, and oversees the less experienced team members. Leads the development of design documents for initiatives, determines the technology that will be leveraged, and how that technology will interact. Leads design discussions with internal, interdisciplinary, and crossfunctional teams and shares findings/learnings from investigations, holding ownership for design decisions. Leads efforts to ensure system architecture meets security and compliance requirements and expectations. Independently creates and mentors others for a clear and articulated plan for testing and assuring the quality of solutions, and defines success for metrics of quality. Leads complex technical acquisition and integration of internal/external customer feedback into necessary changes to ensure a quality customer experience. Plans for the availability and scalability of technical features and changes in production with consideration for server health. Monitors the health of the services to make data driven projections on scalability. Leads efforts to apply knowledge of debugging tools, logs, telemetry, and other methods, and leads verification of assumptions. Writes and develops code proactively against issues before they occur and reinforce code as issues are identified across products. Leverages minimal telemetry data, triangulates issues, and resolves with minimal iterations. Leads retrospective debugging of solutions to identify patterns in root causes of problems, prevents future bugs across service areas, and reviews impact on other services for resolution. Provides technical leadership during code reviews for a solution/product area to ensure it meets the team's and GitHub's quality standards, is reliable and accurate, and is appropriate for the scale of the product feature. Understands the impact of the reviewed code and drafts proposals for code revisions beyond the assigned Service Area."},"import_id":"931160cc-4619-442c-9bb2-ddf7076a9853","redirectOnApply":true,"import_source":"ImporterService","canonical_url":"https://githubinc.jibeapply.com/jobs/4308?lang=en-us","client_code":"githubinc","gdpr":false},"update_date":"2025-08-13T17:33:11+0000","create_date":"2025-08-13T17:33:11+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}}],"locations":[],"totalCount":7,"request_id":false,"count":7,"languageCounts":{"en-us":{"displayName":"English","count":7}},"filter":{"facetList":{"tags4":[{"term":"Experienced Professional","count":7}],"tags5":[{"term":"Individual Contributor","count":5},{"term":"Director","count":1},{"term":"Senior Manager","count":1}],"tags6":[{"term":"Yes","count":7}]},"displayLimit":10,"brands":{"all":[],"shortlist":[]},"categories":{"all":[{"category":"Engineering","numJobs":7}],"shortlist":[{"category":"Engineering","numJobs":7}]},"locations":{"all":[{"city":null,"state":null,"country":"United Kingdom","count":1},{"city":null,"state":null,"country":"United States","count":6}],"shortlist":[{"city":null,"state":null,"country":"United Kingdom","count":1},{"city":null,"state":null,"country":"United States","count":6}]},"experienceLevels":{"all":[],"shortlist":[]}}}