{"jobs":[{"data":{"slug":"3704","language":"en-us","languages":["en-us"],"req_id":"3704","title":"Sr. Mgr, Software Engineering, Copilot Workspace","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview Over the past two years, generative AI has transformed the developer landscape, integrating deeply into the development process. GitHub Copilot, launched in 2022 as an AI-powered pair programmer, boosts developer productivity by up to 55% and has become the most widely adopted AI developer tool. In 2023, GitHub Copilot Chat expanded capabilities, enabling developers to use natural language for coding, debugging, and testing in real time. Now, we’re reimagining the developer experience with GitHub Copilot Workspace—a Copilot-native environment in technical preview. This task-centric workspace allows developers to brainstorm, plan, build, test, and run code using natural language, powered by Copilot agents. Copilot Workspace enhances developer creativity, simplifies workflows, and lowers barriers to software development, empowering both experienced developers and newcomers alike. We are seeking a Senior Engineering Manager to lead this innovative team, drive the vision for AI-powered developer tools, and shape the future of software development. Responsibilities Problem Solving: Identifying and addressing complex challenges and providing creative solutions to advance the organization's goals. Engineering Excellence: Fostering strong engineering practices and processes, growing generational teams that value excellence. Team Leadership: Leading and managing a team of engineers, which may include hiring, mentoring, and providing guidance to team members to help them excel in their roles. Conducting performance evaluations, setting goals, and providing feedback to team members to help them grow and develop in their roles. Project Management: Overseeing the planning, execution, and successful completion of projects, ensuring they align with the organization's goals and objectives. Strategy: Developing and implementing a strategic roadmap that supports our organization's long-term vision and objectives, including identifying areas of focus and setting priorities. At times this will mean charting the strategic path through ambiguity and uncertainty. Collaboration: Collaborating with cross-functional teams, including engineers, product managers, designers, and data scientists to integrate solutions into product development and business strategies. Innovation: Driving innovation within the team by exploring new methodologies, tools, and technologies that can enhance research capabilities and outcomes. Communication: Effectively communicating status, findings, insights, and recommendations to the leadership team. Demonstration and encouragement around the importance of strong written and verbal communication skills. Quality Assurance: Ensuring that work conducted by the team meets high-quality standards and adheres to ethical guidelines and industry best practices. Qualifications Required/Minimum Qualifications: 6+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python o OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python o OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python o OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python o OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field o OR equivalent experience 2+ years experience managing engineering teams 2+ years experience designing, building, scaling and maintaining distributed systems Preferred Qualifications: Demonstrated expertise as a thought leader in AI, with a proven track record of driving innovation, influencing the direction of AI-powered technologies, and applying LLM techniques such as retrieval-augmented generation (RAG) and prompt engineering Strong customer focus and a data-driven approach to decision-making, with a passion for fostering good engineering practices, processes, and maintaining high-quality standards Significant experience with open-source software, testing principles, and the systems and communities used for collaboration, software delivery, and troubleshooting production systems across various layers (e.g., network, application, caching, queuing, load-balancing, storage, distributed services) Proficiency in backend technologies, including server-side environments, compute, datastores, networking, infrastructure, DevOps, security, and programming languages Strong analytical and problem-solving skills, paired with excellent verbal and written communication abilities to collaborate effectively across distributed teams Proven ability to manage multiple projects and priorities in fast-paced environments, with prior experience leading and managing remote teams Expertise in production system monitoring, observability, and evaluation through both online and offline methodologies Other Qualifications: Ability to meet GitHub, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft, GitHub’s parent company, Cloud Screen upon hire/transfer and every two years thereafter. Compensation Range The base salary range for this job is USD $112,800.00 - USD $299,300.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Senior Manager"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required/Minimum Qualifications: 6+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python o OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python o OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python o OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python o OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field o OR equivalent experience 2+ years experience managing engineering teams 2+ years experience designing, building, scaling and maintaining distributed systems Preferred Qualifications: Demonstrated expertise as a thought leader in AI, with a proven track record of driving innovation, influencing the direction of AI-powered technologies, and applying LLM techniques such as retrieval-augmented generation (RAG) and prompt engineering Strong customer focus and a data-driven approach to decision-making, with a passion for fostering good engineering practices, processes, and maintaining high-quality standards Significant experience with open-source software, testing principles, and the systems and communities used for collaboration, software delivery, and troubleshooting production systems across various layers (e.g., network, application, caching, queuing, load-balancing, storage, distributed services) Proficiency in backend technologies, including server-side environments, compute, datastores, networking, infrastructure, DevOps, security, and programming languages Strong analytical and problem-solving skills, paired with excellent verbal and written communication abilities to collaborate effectively across distributed teams Proven ability to manage multiple projects and priorities in fast-paced environments, with prior experience leading and managing remote teams Expertise in production system monitoring, observability, and evaluation through both online and offline methodologies Other Qualifications: Ability to meet GitHub, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft, GitHub’s parent company, Cloud Screen upon hire/transfer and every two years thereafter.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Problem Solving: Identifying and addressing complex challenges and providing creative solutions to advance the organization's goals. Engineering Excellence: Fostering strong engineering practices and processes, growing generational teams that value excellence. Team Leadership: Leading and managing a team of engineers, which may include hiring, mentoring, and providing guidance to team members to help them excel in their roles. Conducting performance evaluations, setting goals, and providing feedback to team members to help them grow and develop in their roles. Project Management: Overseeing the planning, execution, and successful completion of projects, ensuring they align with the organization's goals and objectives. Strategy: Developing and implementing a strategic roadmap that supports our organization's long-term vision and objectives, including identifying areas of focus and setting priorities. At times this will mean charting the strategic path through ambiguity and uncertainty. Collaboration: Collaborating with cross-functional teams, including engineers, product managers, designers, and data scientists to integrate solutions into product development and business strategies. Innovation: Driving innovation within the team by exploring new methodologies, tools, and technologies that can enhance research capabilities and outcomes. Communication: Effectively communicating status, findings, insights, and recommendations to the leadership team. Demonstration and encouragement around the importance of strong written and verbal communication skills. Quality Assurance: Ensuring that work conducted by the team meets high-quality standards and adheres to ethical guidelines and industry best practices.","posted_date":"2024-12-10T22:02:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/3704/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/119577000435163846","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"7c7f42e4104d8338eda6a528b0126317","derivedInfo":{"jobCategories":["COMPUTER_AND_IT","MANAGEMENT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"Problem Solving: Identifying and addressing complex challenges and providing creative solutions to advance the organization's goals. Engineering Excellence: Fostering strong engineering practices and processes, growing generational teams that value excellence. Team Leadership: Leading and managing a team of engineers, which may include hiring, mentoring, and providing guidance to team members to help them excel in their roles. Conducting performance evaluations, setting goals, and providing feedback to team members to help them grow and develop in their roles. Project Management: Overseeing the planning, execution, and successful completion of projects, ensuring they align with the organization's goals and objectives. Strategy: Developing and implementing a strategic roadmap that supports our organization's long-term vision and objectives, including identifying areas of focus and setting priorities. At times this will mean charting the strategic path through ambiguity and uncertainty. Collaboration: Collaborating with cross-functional teams, including engineers, product managers, designers, and data scientists to integrate solutions into product development and business strategies. Innovation: Driving innovation within the team by exploring new methodologies, tools, and technologies that can enhance research capabilities and outcomes. Communication: Effectively communicating status, findings, insights, and recommendations to the leadership team. Demonstration and encouragement around the importance of strong written and verbal communication skills. Quality Assurance: Ensuring that work conducted by the team meets high-quality standards and adheres to ethical guidelines and industry best practices.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2025-01-27T22:24:39Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-12-10T22:02:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9"},"revision_int":5,"uuid":"cde26d3a-3794-443f-95f6-c4e7e8ee024d"},"import_id":"daf4b1c1-2887-4c6c-aa39-78db60687386","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3704?lang=en-us","last_mod":"2025-01-27T22:25:18+0000","gdpr":false},"update_date":"2025-01-27T22:25:18+0000","create_date":"2024-12-10T22:08:28+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"3650","language":"en-us","languages":["en-us"],"req_id":"3650","title":"Software Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview As a software engineer at GitHub, you will enhance the collaboration experience at GitHub by working closely with a community of engineers and designers with a distributed, diverse and passionate team delivering the services that millions of developers depend on. In this role you will design, prototype, implement, ship and support highly performant and inspiring user experiences with your team. We are looking for creative problem solvers and diverse thinkers, people who care about culture as well as customers and features. We believe that how we do things is as important as what we do. Big vision, a common purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what lead to great results. Great products reflect the teams that build them. Responsibilities Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Receive technical mentorship, collaborate and pair with others, provide code reviews, and communicate clearly to your leadership about progress, blockers, and gaps. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code. Qualifications Required Qualifications 1+ year(s) experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, or related field OR equivalent experience. Preferred Qualifications Experience with Git and GitHub Experience using Azure technologies is a bonus Experience using front-end frameworks like React.js Understanding of REST principles and experience with backend APIs Strong written and verbal communication skill Passionate about healthy team culture and collaboration Comfortable working transparently in an agile environment and soliciting feedback from peers Compensation Range The base salary range for this job is USD $66,900.00 - USD $177,600.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications 1+ year(s) experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, or related field OR equivalent experience. Preferred Qualifications Experience with Git and GitHub Experience using Azure technologies is a bonus Experience using front-end frameworks like React.js Understanding of REST principles and experience with backend APIs Strong written and verbal communication skill Passionate about healthy team culture and collaboration Comfortable working transparently in an agile environment and soliciting feedback from peers","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Receive technical mentorship, collaborate and pair with others, provide code reviews, and communicate clearly to your leadership about progress, blockers, and gaps. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","posted_date":"2024-10-28T20:31:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/3650/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/90968746054558406","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"adc67b03aeecd958ee32149ce4d742dd","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Receive technical mentorship, collaborate and pair with others, provide code reviews, and communicate clearly to your leadership about progress, blockers, and gaps. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2025-02-03T17:17:38Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-10-28T20:31:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9"},"revision_int":28,"uuid":"4f25647c-49c0-4a73-bb00-de60ba92bc3c"},"import_id":"a3f3b758-ec55-4f74-8d90-c5c0db1ef5ba","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3650?lang=en-us","last_mod":"2025-02-03T17:18:31+0000","gdpr":false},"update_date":"2025-02-03T17:18:31+0000","create_date":"2024-10-28T20:36:34+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"3742","language":"en-us","languages":["en-us"],"req_id":"3742","title":"Principal Software Engineer, Web UI Platform","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview GitHub is revolutionizing the way developers collaborate and build software, and we are seeking a Principal Software Engineer to pioneer the UI Platform space, which entails areas of frontend performance, accessibility, consistency, and availability. This role is an opportunity to define GitHub's future UI architecture, positioning GitHub as an industry leader in UI innovation. You will be responsible for empowering millions of developers worldwide by delivering exceptional and accessible user experiences. Responsibilities Lead UI Architecture at Scale: Own the architecture and development of GitHub's Web UI platform, ensuring scalability, reliability, accessibility, and performance for millions of users worldwide. Cross-Functional Leadership: Collaborate with cross-functional teams in engineering, product, and design to drive key frontend initiatives that optimize the user experience for our users, balancing frontend performance with complex backend APIs. Mentorship and Technical Leadership: Provide technical mentorship to engineering teams, guiding best practices, establishing coding standards, and driving continuous improvement across the Web UI platform. Architect for Scale, Performance and Accessibility: Champion accessibility and performance, ensuring GitHub’s frontend systems meet the highest standards and continue to perform at scale. Lead efforts to make the platform fast, accessible, and consistent across all products. Balance Strategic and Hands-On Work: Drive architectural decision-making while remaining hands-on with coding and problem-solving where needed. Balance technical leadership with executing large-scale initiatives from concept to delivery. Advocate for Platform Priorities: Drive the strategic vision for the Web UI platform by securing leadership support and resources, ensuring alignment with company-wide goals. Build at Global Scale: Develop frontend solutions that power a platform supporting a large and distributed user base of millions of daily active users and billions of requests, ensuring GitHub’s frontend experiences remain fast, reliable, and accessible under high loads. What Success Looks Like in the First Year Ramping Up and Understanding GitHub’s Systems: In the first few months, you’ll be expected to gain a deep understanding of GitHub’s systems, including the Web UI platform, backend services, and key dependencies. Success will come from applying this knowledge to drive informed decisions and impactful initiatives. Leading Initiatives for Scalability: Deliver a robust UI platform that enhances the performance and accessibility of GitHub’s frontend systems, ensuring they scale effectively to meet the needs of millions of developers globally. Driving Frontend Strategy: Collaborating with engineering, product, and design teams to create and execute strategic initiatives that drive the evolution of GitHub’s Web UI platform. Mentoring Engineering Teams: Mentoring engineering teams to adopt best practices for scalable, high-performance frontend development, ensuring consistent delivery of high-quality solutions. Qualifications Required Qualifications: Many years of experience in Software Engineering, Computer Science, or a related technical discipline, with proven experience maintaining and delivering production software in languages including, but not limited to, JavaScript, Go, or Ruby OR Associate’s Degree in a related field (e.g., Computer Science, Electrical Engineering, Math, Physics) and numerous years of experience in the same areas with proficiency in the listed languages. OR Bachelor’s Degree in a related field and multiple years of experience with the same languages and technologies. OR Master’s Degree in a related field and several years of experience with the same languages and technologies. OR Doctorate in a related field and some years of experience with the same languages and technologies. OR equivalent experience. Numerous years of experience in designing, building, and maintaining large-scale frontend applications and the backend systems that support these with an emphasis on performance, scalability, and maintainability at the scale of hundreds of millions of users Numerous years of providing technical leadership and mentorship, guiding teams to deliver software solutions, demonstrating timely execution of projects and initiatives. A few years of experience leading work implemented across multiple teams, frequently coordinating and collaborating with backend services, API teams, or infrastructure teams outside of your core area of responsibility. Preferred Qualifications: Experience navigating how different concerns within the frontend engineering space overlap (e.g. accessibility, performance, UX consistency) and crafting execution strategies that successfully take these areas into consideration and lead to meaningful and impactful deliverables. Deep expertise and knowledge of the internals of React and related technologies Passionate and active in the evolution of current front-end architecture trends and best practices, encompassing performance, accessibility, security, and usability. Extensive experience with TypeScript and other statically typed languages, Node.js, the Web platform, and UI architecture Experience with large-scale codebases with contributors that span teams, offices and time zones Experience managing complex interactions between frontend and backend services Prior experience with Ruby on Rails or other backend technologies. Proficiency in using and customizing build tools and automation frameworks, such as Webpack. Prior experience articulating complex technical concepts to both technical (engineers at all levels) and non-technical (stakeholders and executives) audiences GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. Equal Employment Opportunity GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"United Kingdom Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications: Many years of experience in Software Engineering, Computer Science, or a related technical discipline, with proven experience maintaining and delivering production software in languages including, but not limited to, JavaScript, Go, or Ruby OR Associate’s Degree in a related field (e.g., Computer Science, Electrical Engineering, Math, Physics) and numerous years of experience in the same areas with proficiency in the listed languages. OR Bachelor’s Degree in a related field and multiple years of experience with the same languages and technologies. OR Master’s Degree in a related field and several years of experience with the same languages and technologies. OR Doctorate in a related field and some years of experience with the same languages and technologies. OR equivalent experience. Numerous years of experience in designing, building, and maintaining large-scale frontend applications and the backend systems that support these with an emphasis on performance, scalability, and maintainability at the scale of hundreds of millions of users Numerous years of providing technical leadership and mentorship, guiding teams to deliver software solutions, demonstrating timely execution of projects and initiatives. A few years of experience leading work implemented across multiple teams, frequently coordinating and collaborating with backend services, API teams, or infrastructure teams outside of your core area of responsibility. Preferred Qualifications: Experience navigating how different concerns within the frontend engineering space overlap (e.g. accessibility, performance, UX consistency) and crafting execution strategies that successfully take these areas into consideration and lead to meaningful and impactful deliverables. Deep expertise and knowledge of the internals of React and related technologies Passionate and active in the evolution of current front-end architecture trends and best practices, encompassing performance, accessibility, security, and usability. Extensive experience with TypeScript and other statically typed languages, Node.js, the Web platform, and UI architecture Experience with large-scale codebases with contributors that span teams, offices and time zones Experience managing complex interactions between frontend and backend services Prior experience with Ruby on Rails or other backend technologies. Proficiency in using and customizing build tools and automation frameworks, such as Webpack. Prior experience articulating complex technical concepts to both technical (engineers at all levels) and non-technical (stakeholders and executives) audiences","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Lead UI Architecture at Scale: Own the architecture and development of GitHub's Web UI platform, ensuring scalability, reliability, accessibility, and performance for millions of users worldwide. Cross-Functional Leadership: Collaborate with cross-functional teams in engineering, product, and design to drive key frontend initiatives that optimize the user experience for our users, balancing frontend performance with complex backend APIs. Mentorship and Technical Leadership: Provide technical mentorship to engineering teams, guiding best practices, establishing coding standards, and driving continuous improvement across the Web UI platform. Architect for Scale, Performance and Accessibility: Champion accessibility and performance, ensuring GitHub’s frontend systems meet the highest standards and continue to perform at scale. Lead efforts to make the platform fast, accessible, and consistent across all products. Balance Strategic and Hands-On Work: Drive architectural decision-making while remaining hands-on with coding and problem-solving where needed. Balance technical leadership with executing large-scale initiatives from concept to delivery. Advocate for Platform Priorities: Drive the strategic vision for the Web UI platform by securing leadership support and resources, ensuring alignment with company-wide goals. Build at Global Scale: Develop frontend solutions that power a platform supporting a large and distributed user base of millions of daily active users and billions of requests, ensuring GitHub’s frontend experiences remain fast, reliable, and accessible under high loads. What Success Looks Like in the First Year Ramping Up and Understanding GitHub’s Systems: In the first few months, you’ll be expected to gain a deep understanding of GitHub’s systems, including the Web UI platform, backend services, and key dependencies. Success will come from applying this knowledge to drive informed decisions and impactful initiatives. Leading Initiatives for Scalability: Deliver a robust UI platform that enhances the performance and accessibility of GitHub’s frontend systems, ensuring they scale effectively to meet the needs of millions of developers globally. Driving Frontend Strategy: Collaborating with engineering, product, and design teams to create and execute strategic initiatives that drive the evolution of GitHub’s Web UI platform. Mentoring Engineering Teams: Mentoring engineering teams to adopt best practices for scalable, high-performance frontend development, ensuring consistent delivery of high-quality solutions.","posted_date":"2024-12-18T22:09:00+0000","apply_url":"https://globalcareers-githubinc.icims.com/jobs/3742/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/128451034698654406","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"55e1fc035fb0376c427fa2dfbc222271","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"Lead UI Architecture at Scale: Own the architecture and development of GitHub's Web UI platform, ensuring scalability, reliability, accessibility, and performance for millions of users worldwide. Cross-Functional Leadership: Collaborate with cross-functional teams in engineering, product, and design to drive key frontend initiatives that optimize the user experience for our users, balancing frontend performance with complex backend APIs. Mentorship and Technical Leadership: Provide technical mentorship to engineering teams, guiding best practices, establishing coding standards, and driving continuous improvement across the Web UI platform. Architect for Scale, Performance and Accessibility: Champion accessibility and performance, ensuring GitHub’s frontend systems meet the highest standards and continue to perform at scale. Lead efforts to make the platform fast, accessible, and consistent across all products. Balance Strategic and Hands-On Work: Drive architectural decision-making while remaining hands-on with coding and problem-solving where needed. Balance technical leadership with executing large-scale initiatives from concept to delivery. Advocate for Platform Priorities: Drive the strategic vision for the Web UI platform by securing leadership support and resources, ensuring alignment with company-wide goals. Build at Global Scale: Develop frontend solutions that power a platform supporting a large and distributed user base of millions of daily active users and billions of requests, ensuring GitHub’s frontend experiences remain fast, reliable, and accessible under high loads. What Success Looks Like in the First Year Ramping Up and Understanding GitHub’s Systems: In the first few months, you’ll be expected to gain a deep understanding of GitHub’s systems, including the Web UI platform, backend services, and key dependencies. Success will come from applying this knowledge to drive informed decisions and impactful initiatives. Leading Initiatives for Scalability: Deliver a robust UI platform that enhances the performance and accessibility of GitHub’s frontend systems, ensuring they scale effectively to meet the needs of millions of developers globally. Driving Frontend Strategy: Collaborating with engineering, product, and design teams to create and execute strategic initiatives that drive the evolution of GitHub’s Web UI platform. Mentoring Engineering Teams: Mentoring engineering teams to adopt best practices for scalable, high-performance frontend development, ensuring consistent delivery of high-quality solutions.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2025-01-17T19:10:32Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-12-18T22:09:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":8,"uuid":"b595703c-71ab-4e63-be60-83cbce9b16ca"},"import_id":"23a14fed-4820-4622-9a3b-7e8ac8d8feda","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3742?lang=en-us","last_mod":"2025-01-17T19:10:39+0000","gdpr":true},"update_date":"2025-01-17T19:10:39+0000","create_date":"2025-01-03T15:46:37+0000","category":[" Engineering"],"full_location":"United Kingdom","short_location":"United Kingdom","multipleLocations":false}},{"data":{"slug":"3905","language":"en-us","languages":["en-us"],"req_id":"3905","title":"Software Engineer II - Copilot Agent Services","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview GitHub Copilot has changed the way software is built, and we have a unique opportunity to look further ahead to identify how software development can be faster, safer, easier, and more accessible. We’re looking for a talented and experienced Software Engineer to join us in this mission! GitHub Copilot Agent Services owns the platform that expands Copilot's abilities with powerful AI agents in a rich ecosystem of developer tools and services as part of our industry-leading experiences. As a Software Engineer on the Copilot Agent Services Team, you will work closely with a distributed, diverse, and passionate team of engineers and product managers with multiple teams across GitHub and Microsoft to improve and maintain our platform that integrators depend on in their software development cycle. Together, we are dedicated to shaping the future of software development by continuously enhancing AI-powered capabilities in GitHub and beyond. The Copilot team is highly distributed and you will thrive in an environment of remote work and asynchronous communication. You're expected to have strong written communication skills and be able to develop working relationships with coworkers in locations around the globe. As an engineer at GitHub you'll always be challenged to solve interesting and novel problems that have real impact on how the world builds software. Responsibilities Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code. Qualifications Required/Minimum Qualifications: A few years of experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience OR Bachelor's Degree in Computer Science or related field OR equivalent experience Preferred Qualifications: Experience with distributed systems at global scale Experience working with a remote, distributed team Excellent written and verbal communication skills Interest or prior experience in modern AI/machine learning technologies, Large Language Models or similar Passionate about fostering good API Design practices and processes GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. Equal Employment Opportunity GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"United Kingdom Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required/Minimum Qualifications: A few years of experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience OR Bachelor's Degree in Computer Science or related field OR equivalent experience Preferred Qualifications: Experience with distributed systems at global scale Experience working with a remote, distributed team Excellent written and verbal communication skills Interest or prior experience in modern AI/machine learning technologies, Large Language Models or similar Passionate about fostering good API Design practices and processes","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","posted_date":"2025-01-07T14:54:00+0000","apply_url":"https://globalcareers-githubinc.icims.com/jobs/3905/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/76305352500355782","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"e8906b2b19027b5235c068b3292ff6b2","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2025-01-27T22:33:30Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2025-01-07T14:54:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":3,"uuid":"4a7b9050-0e28-4346-8de1-d8a08b34cc43"},"import_id":"48e904e3-0ce4-4327-8f7e-d52e1e5a9f66","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3905?lang=en-us","last_mod":"2025-01-27T22:34:18+0000","gdpr":true},"update_date":"2025-01-27T22:34:18+0000","create_date":"2025-01-07T15:00:43+0000","category":[" Engineering"],"full_location":"United Kingdom","short_location":"United Kingdom","multipleLocations":false}},{"data":{"slug":"3939","language":"en-us","languages":["en-us"],"req_id":"3939","title":"Software Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, Ontario Canada | Remote, British Columbia Canada | Remote, Alberta Canada Overview As a software engineer at GitHub, you will enhance the collaboration experience at GitHub by working closely with a community of engineers and designers with a distributed, diverse and passionate team delivering the services that millions of developers depend on. In this role you will design, prototype, implement, ship and support highly performant and inspiring user experiences with your team. We are looking for creative problem solvers and diverse thinkers, people who care about culture as well as customers and features. We believe that how we do things is as important as what we do. Big vision, a common purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what lead to great results. Great products reflect the teams that build them. Responsibilities Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code. Qualifications Required Qualifications 1+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience OR equivalent experience. Preferred Qualifications Experience with Git and GitHub Experience using Azure technologies is a bonus Experience using front-end frameworks like React.js Understanding of REST principles and experience with backend APIs Strong written and verbal communication skill Passionate about healthy team culture and collaboration Comfortable working transparently in an agile environment and soliciting feedback from peers. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. Equal Employment Opportunity GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"Ontario Remote","state":"Ontario","country":"Canada","country_code":"CA","location_type":"ANY","latitude":51.253775,"longitude":-85.3232139,"additional_locations":[{"location_name":"British Columbia Remote","state":"British Columbia","country":"CAN","country_code":"CA","latitude":53.7266683,"longitude":-127.6476206},{"location_name":"Alberta Remote","state":"Alberta","country":"CAN","country_code":"CA","latitude":53.9332706,"longitude":-116.5765035}],"categories":[{"name":"Engineering"}],"tags2":["CAN-ON-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications 1+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience OR equivalent experience. Preferred Qualifications Experience with Git and GitHub Experience using Azure technologies is a bonus Experience using front-end frameworks like React.js Understanding of REST principles and experience with backend APIs Strong written and verbal communication skill Passionate about healthy team culture and collaboration Comfortable working transparently in an agile environment and soliciting feedback from peers.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","posted_date":"2025-01-21T16:06:00+0000","apply_url":"https://globalcareers-githubinc.icims.com/jobs/3939/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/100677349371978438","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"551b7a4d2db7cad9b73968960b616cc3","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":51.253775,"longitude":-85.3232139},"locationType":"ADMINISTRATIVE_AREA","postalAddress":{"addressLines":["Ontario, Canada"],"administrativeArea":"ON","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"CA","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5023275006040222},{"latLng":{"latitude":53.7266683,"longitude":-127.6476206},"locationType":"ADMINISTRATIVE_AREA","postalAddress":{"addressLines":["British Columbia, Canada"],"administrativeArea":"BC","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"CA","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.4159475213072899},{"latLng":{"latitude":53.9332706,"longitude":-116.5765035},"locationType":"ADMINISTRATIVE_AREA","postalAddress":{"addressLines":["Alberta, Canada"],"administrativeArea":"AB","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"CA","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.30202952465811467}]},"jobSummary":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2025-01-21T16:14:01Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2025-01-21T16:06:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":2,"uuid":"d942e707-50f6-47b3-92dc-28cf31811c62"},"import_id":"a5a9fdbc-d1cd-44c6-a1c0-c9b20d716be2","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3939?lang=en-us","last_mod":"2025-01-21T16:14:40+0000","gdpr":false},"update_date":"2025-01-21T16:14:40+0000","create_date":"2025-01-21T16:12:39+0000","category":[" Engineering"],"full_location":"Ontario, Canada; British Columbia, CAN; Alberta, CAN","short_location":"Ontario, Canada","multipleLocations":true}},{"data":{"slug":"3513","language":"en-us","languages":["en-us"],"req_id":"3513","title":"Staff Research Engineer, GitHub Next","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub has changed the way software is built, and we have a unique opportunity to look further ahead to identify how software development can be faster, safer, easier, and more accessible. We’re looking for talented, experienced polymaths to join us in this mission! This is the rare role that affords both startup-level agency and a larger company’s resources. GitHub Next has incubated genre-defining products like Copilot, Copilot Workspace, and more. You’ll work closely with a small group of experienced and talented researchers to explore the future of software development. Our team’s prototypes inform GitHub’s leadership and roadmap. Each exploration represents a risky bet that GitHub might want to make, and we have to support those bets with working prototypes. Please note that this is not an academic research role. Our job is to dream big about the future of software development — and then build it. Our team feels like a permanent startup: every time we succeed, we hand off our prototypes and return to the drawing board to do it all over again. You can see many of our projects at githubnext.com. Responsibilities Research Engineers build prototypes. Sometimes, we have an interesting technological idea but need to figure out how to turn it into a reliable product. Other times, we dream of an experience, but we’re not sure how to make that experience a reality. With few constraints on our solution space, our hardest task is figuring out how to scope our bets and deliver value. We will have more ideas than we can possibly pursue; choosing wisely is part of the job. The exploration domains are varied and will require an ability to understand, investigate, and implement prototypes across a wide range of technologies. Our team has a lot of different skills under one roof, and we work together in squads to identify and debate ideas, then execute everything needed for a working prototype. For this role, we are seeking an individual with exceptional frontend and design skills. Next’s prototypes grapple with difficult UX challenges in domains with little prior art to guide us. You may be a good fit if: You are a generalist with some areas of deeper knowledge. Hybrids will feel at home on this team. We will also consider candidates who have specialized in a relevant field. You are an effective and inclusive communicator, comfortable with remote communication practices. Next’s currency is ideas; the health of our team, our execution, and our results rests on our ability to communicate well. You are comfortable collaborating with teammates to figure out what work needs doing, then splitting up that work and doing it. Ideating alone is natural and common, but projects staffed by one individual don’t tend to survive. Your teammates are the first ones you must persuade with your ideas. You are comfortable reading source code. You are comfortable picking up new technology stacks in the normal course of work. This is a senior engineering role! While we do have some technologies that we generally like to use, we are not indexing on a specific stack. Experience is more than your ability to write code in language X or framework Y. Qualifications Required Qualifications: 9+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 8+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science or related field AND 7+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR equivalent experience. Experience creating rapid prototypes that demonstrate a concept to stakeholders and enable decision making Experience identifying and justifying research goals in situations of ambiguity and executing towards those goals without explicit direction Preferred Qualifications: These are more specific abilities we’re looking for, but it is the rare human who possesses them all. Think of this as a descriptive sketch, not a checklist of requirements. Be comfortable applying even if you don’t have all of them. A deep understanding of GitHub’s industry and business context and the ability to articulate topics related to our product and audience Has held roles that deal with topics at the boundary of human knowledge regarding software development and developers Have significant experience with one or more frontend technologies. We currently default to Typescript and React for the web, but we also have some efforts underway with Svelte and SvelteKit. “Whatever enables us to ship” is the top concern Have significant experience with machine learning, LLMs, and the rapidly-evolving landscape of techniques and tools used to build intelligence into products Have significant experience with one or more backend technologies: server-side environments, compute, datastores, networking, infrastructure, devops, security, and programming languages Have significant experience with open-source software, communities, and the systems these communities use to self-organize and ship software for others Have significant experience operating production systems at a nontrivial scale and are familiar with the common patterns and pitfalls of that work Have significant experience in another area of computing that is relevant to our mission. Human-computer interaction, distributed systems, $YOURTHING Compensation Range The base salary range for this job is USD $118,100.00 - USD $313,300.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 9+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 8+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science or related field AND 7+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR equivalent experience. Experience creating rapid prototypes that demonstrate a concept to stakeholders and enable decision making Experience identifying and justifying research goals in situations of ambiguity and executing towards those goals without explicit direction Preferred Qualifications: These are more specific abilities we’re looking for, but it is the rare human who possesses them all. Think of this as a descriptive sketch, not a checklist of requirements. Be comfortable applying even if you don’t have all of them. A deep understanding of GitHub’s industry and business context and the ability to articulate topics related to our product and audience Has held roles that deal with topics at the boundary of human knowledge regarding software development and developers Have significant experience with one or more frontend technologies. We currently default to Typescript and React for the web, but we also have some efforts underway with Svelte and SvelteKit. “Whatever enables us to ship” is the top concern Have significant experience with machine learning, LLMs, and the rapidly-evolving landscape of techniques and tools used to build intelligence into products Have significant experience with one or more backend technologies: server-side environments, compute, datastores, networking, infrastructure, devops, security, and programming languages Have significant experience with open-source software, communities, and the systems these communities use to self-organize and ship software for others Have significant experience operating production systems at a nontrivial scale and are familiar with the common patterns and pitfalls of that work Have significant experience in another area of computing that is relevant to our mission. Human-computer interaction, distributed systems, $YOURTHING","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Research Engineers build prototypes. Sometimes, we have an interesting technological idea but need to figure out how to turn it into a reliable product. Other times, we dream of an experience, but we’re not sure how to make that experience a reality. With few constraints on our solution space, our hardest task is figuring out how to scope our bets and deliver value. We will have more ideas than we can possibly pursue; choosing wisely is part of the job. The exploration domains are varied and will require an ability to understand, investigate, and implement prototypes across a wide range of technologies. Our team has a lot of different skills under one roof, and we work together in squads to identify and debate ideas, then execute everything needed for a working prototype. For this role, we are seeking an individual with exceptional frontend and design skills. Next’s prototypes grapple with difficult UX challenges in domains with little prior art to guide us. You may be a good fit if: You are a generalist with some areas of deeper knowledge. Hybrids will feel at home on this team. We will also consider candidates who have specialized in a relevant field. You are an effective and inclusive communicator, comfortable with remote communication practices. Next’s currency is ideas; the health of our team, our execution, and our results rests on our ability to communicate well. You are comfortable collaborating with teammates to figure out what work needs doing, then splitting up that work and doing it. Ideating alone is natural and common, but projects staffed by one individual don’t tend to survive. Your teammates are the first ones you must persuade with your ideas. You are comfortable reading source code. You are comfortable picking up new technology stacks in the normal course of work. This is a senior engineering role! While we do have some technologies that we generally like to use, we are not indexing on a specific stack. Experience is more than your ability to write code in language X or framework Y.","posted_date":"2024-09-27T21:14:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/3513/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/142007571425698502","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"c910a4fb76248c11c1959302c408119e","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"Research Engineers build prototypes. Sometimes, we have an interesting technological idea but need to figure out how to turn it into a reliable product. Other times, we dream of an experience, but we’re not sure how to make that experience a reality. With few constraints on our solution space, our hardest task is figuring out how to scope our bets and deliver value. We will have more ideas than we can possibly pursue; choosing wisely is part of the job. The exploration domains are varied and will require an ability to understand, investigate, and implement prototypes across a wide range of technologies. Our team has a lot of different skills under one roof, and we work together in squads to identify and debate ideas, then execute everything needed for a working prototype. For this role, we are seeking an individual with exceptional frontend and design skills. Next’s prototypes grapple with difficult UX challenges in domains with little prior art to guide us. You may be a good fit if: You are a generalist with some areas of deeper knowledge. Hybrids will feel at home on this team. We will also consider candidates who have specialized in a relevant field. You are an effective and inclusive communicator, comfortable with remote communication practices. Next’s currency is ideas; the health of our team, our execution, and our results rests on our ability to communicate well. You are comfortable collaborating with teammates to figure out what work needs doing, then splitting up that work and doing it. Ideating alone is natural and common, but projects staffed by one individual don’t tend to survive. Your teammates are the first ones you must persuade with your ideas. You are comfortable reading source code. You are comfortable picking up new technology stacks in the normal course of work. This is a senior engineering role! While we do have some technologies that we generally like to use, we are not indexing on a specific stack. Experience is more than your ability to write code in language X or framework Y.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2025-01-28T15:04:01Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-09-27T21:14:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9"},"revision_int":7,"uuid":"6cb1a55f-cb25-4320-86bb-26632f0a5afe"},"import_id":"a82321d9-c3cd-472d-a269-4d2b274d67bd","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3513?lang=en-us","last_mod":"2025-01-28T15:04:18+0000","gdpr":false},"update_date":"2025-01-28T15:04:18+0000","create_date":"2024-09-27T21:21:31+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"3932","language":"en-us","languages":["en-us"],"req_id":"3932","title":"Software Engineer III Compute Platform","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview GitHub is looking for a Software Engineer III to join the Compute Platform team within our Developer Experience organisation. You will focus on the systems and tools that enable our engineers to operate and scale the world’s largest code hosting platform. You will deploy and maintain our Kubernetes clusters with a focus on making the Developer Experience the best it can be for our engineering and infrastructure teams. The Developer Experience team is highly distributed and you will thrive in an environment of remote work and asynchronous communication. You’re expected to have strong written communication skills and be able to develop working relationships with coworkers in locations around the globe. As an engineer at GitHub you’ll always be challenged to solve interesting and novel problems that have real impact on how the world builds software. Responsibilities Build and improve the frameworks and tools we use to build, test, configure our Kubernetes clusters. Ensure a reliable Kubernetes platform across bare-metal, virtual machines, and cloud environments. Cultivate open source projects developed by GitHub and build things you are proud to share. Work closely with other engineering and infrastructure teams to design solutions and support Kubernetes workloads. Collaborate with teams from across the company to respond to incidents Participate in on-call rotations to ensure service reliability Qualifications Required Qualifications: Minimum 4 years technical experience in infrastructure domains (e.g., container orchestration engineering, platform engineering, database engineering, software engineering, network engineering, systems administration, or related field) OR Bachelor's Degree in Computer Science, Information Technology, or related field AND minimum 2 years technical experience in infrastructure domains (e.g., container orchestration engineering, platform engineering, database engineering, software engineering, network engineering, systems administration, or related field) Minimum of 4 years experience of testing, building and configuring Kubernetes clusters. Preferred Qualifications: Minimum 2 years experience in one or more scripting languages (e.g., Bash, Python, or a similar language) Minimum 2 years experience using general purpose programming languages (e.g., Go, Ruby, or a similar language). Minimum 3 years experience with cloud environments and/or Cloud Native Compute Foundation (CNCF) concepts. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. Equal Employment Opportunity GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"United Kingdom Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: Minimum 4 years technical experience in infrastructure domains (e.g., container orchestration engineering, platform engineering, database engineering, software engineering, network engineering, systems administration, or related field) OR Bachelor's Degree in Computer Science, Information Technology, or related field AND minimum 2 years technical experience in infrastructure domains (e.g., container orchestration engineering, platform engineering, database engineering, software engineering, network engineering, systems administration, or related field) Minimum of 4 years experience of testing, building and configuring Kubernetes clusters. Preferred Qualifications: Minimum 2 years experience in one or more scripting languages (e.g., Bash, Python, or a similar language) Minimum 2 years experience using general purpose programming languages (e.g., Go, Ruby, or a similar language). Minimum 3 years experience with cloud environments and/or Cloud Native Compute Foundation (CNCF) concepts.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Build and improve the frameworks and tools we use to build, test, configure our Kubernetes clusters. Ensure a reliable Kubernetes platform across bare-metal, virtual machines, and cloud environments. Cultivate open source projects developed by GitHub and build things you are proud to share. Work closely with other engineering and infrastructure teams to design solutions and support Kubernetes workloads. Collaborate with teams from across the company to respond to incidents Participate in on-call rotations to ensure service reliability","posted_date":"2025-01-30T14:08:00+0000","apply_url":"https://globalcareers-githubinc.icims.com/jobs/3932/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2025-01-30T14:13:20Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2025-01-30T14:08:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":1,"uuid":"d772ae53-2bbe-4648-b1e3-99b87ec124bc"},"import_id":"be44f7a1-c8dc-4493-9725-f48384fbd802","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/jobs/93773562032071366","jobHash":"31f98244bf41276289328ca7101e46d1","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"Build and improve the frameworks and tools we use to build, test, configure our Kubernetes clusters. Ensure a reliable Kubernetes platform across bare-metal, virtual machines, and cloud environments. Cultivate open source projects developed by GitHub and build things you are proud to share. Work closely with other engineering and infrastructure teams to design solutions and support Kubernetes workloads. Collaborate with teams from across the company to respond to incidents Participate in on-call rotations to ensure service reliability","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/3932?lang=en-us","last_mod":"2025-01-30T14:14:18+0000","gdpr":true},"update_date":"2025-01-30T14:14:18+0000","create_date":"2025-01-30T14:14:18+0000","category":[" Engineering"],"full_location":"United Kingdom","short_location":"United Kingdom","multipleLocations":false}},{"data":{"slug":"3802","language":"en-us","languages":["en-us"],"req_id":"3802","title":"Senior Software Engineer, Codespaces \u0026 Copilot Workspace","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview We’re building the future of cloud development with Codespaces: instant-on, container-based cloud environments tailored to specific projects, enabling developers to focus on writing code rather than managing setups. As a Senior Engineer on the compute team, you’ll design and implement a secure, reliable, and efficient platform that powers Codespaces, Copilot Workspace, and our LLM-based tooling. Your work will directly impact developers worldwide, ensuring these tools are always available, performant, cost-effective, and delightful to use. At GitHub, you’ll collaborate with a distributed, diverse, and passionate team of engineers and designers, delivering services that millions of developers depend on daily. In this role, you’ll design, prototype, implement, ship, and support highly performant, inspiring experiences that enhance collaboration and productivity for developers everywhere. We’re looking for creative problem solvers and diverse thinkers who value culture as much as customers and features. We believe how we work is just as important as what we deliver. Big vision, shared purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what drive great results. Great products reflect the teams that build them—come join us! Responsibilities Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary. Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code. Qualifications Required Qualifications: Experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field. OR equivalent experience. Experience in cloud-native development, including designing, building, and deploying scalable applications using microservices architecture, containers (e.g., Docker), and orchestration tools like Kubernetes. Proficiency in leveraging cloud platforms (e.g., AWS, Azure, or GCP) for optimizing application performance and scalability. Experience with on-call rotations, incident response and site reliability, including diagnosing and resolving complex production issues under pressure. Experience implementing and maintaining compliance and security practices in software development, including secure coding, vulnerability management, data privacy, and regulatory standards (e.g., GDPR, SOC 2, HIPAA). Proficiency in designing systems with robust security measures and ensuring adherence to organizational and industry compliance requirements. Preferred Qualifications: Proficiency in modern programming languages such as C#, TypeScript, Go, and Rust. Excellent written and verbal communication via async collaboration, documentation, and visibility of work. Experience working with a remote, distributed team. Passionate about fostering effective Engineering practices and processes. Proficiency in Git and GitHub for version control and collaborative development and branching strategies. Experience with CI/CD Tools: Strong knowledge of CI/CD concepts and best practices. Experience with GitHub actions and workflows platform, familiar with other tools like Jenkins Contribute to open source software, engage with maintainers, and actively participate in community curation. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. Equal Employment Opportunity GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"United Kingdom Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: Experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field. OR equivalent experience. Experience in cloud-native development, including designing, building, and deploying scalable applications using microservices architecture, containers (e.g., Docker), and orchestration tools like Kubernetes. Proficiency in leveraging cloud platforms (e.g., AWS, Azure, or GCP) for optimizing application performance and scalability. Experience with on-call rotations, incident response and site reliability, including diagnosing and resolving complex production issues under pressure. Experience implementing and maintaining compliance and security practices in software development, including secure coding, vulnerability management, data privacy, and regulatory standards (e.g., GDPR, SOC 2, HIPAA). Proficiency in designing systems with robust security measures and ensuring adherence to organizational and industry compliance requirements. Preferred Qualifications: Proficiency in modern programming languages such as C#, TypeScript, Go, and Rust. Excellent written and verbal communication via async collaboration, documentation, and visibility of work. Experience working with a remote, distributed team. Passionate about fostering effective Engineering practices and processes. Proficiency in Git and GitHub for version control and collaborative development and branching strategies. Experience with CI/CD Tools: Strong knowledge of CI/CD concepts and best practices. Experience with GitHub actions and workflows platform, familiar with other tools like Jenkins Contribute to open source software, engage with maintainers, and actively participate in community curation.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary. Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","posted_date":"2024-12-02T13:08:00+0000","apply_url":"https://globalcareers-githubinc.icims.com/jobs/3802/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/142255712423027398","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"a1a8bc027f6945becc8123d64f497554","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary. Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2025-01-28T16:21:12Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-12-02T13:08:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":6,"uuid":"378704ac-7119-4628-84f6-8a3b0355f232"},"import_id":"48e432e1-307a-4aae-80c8-8c8270072515","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3802?lang=en-us","last_mod":"2025-01-28T16:21:19+0000","gdpr":true},"update_date":"2025-01-28T16:21:19+0000","create_date":"2025-01-03T15:46:37+0000","category":[" Engineering"],"full_location":"United Kingdom","short_location":"United Kingdom","multipleLocations":false}},{"data":{"slug":"3916","language":"en-us","languages":["en-us"],"req_id":"3916","title":"Software Engineer III Compute Platform","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, Germany Overview GitHub is looking for a Software Engineer III to join the Compute Platform team within our Developer Experience organisation. You will focus on the systems and tools that enable our engineers to operate and scale the world’s largest code hosting platform. You will deploy and maintain our Kubernetes clusters with a focus on making the Developer Experience the best it can be for our engineering and infrastructure teams. The Developer Experience team is highly distributed and you will thrive in an environment of remote work and asynchronous communication. You’re expected to have strong written communication skills and be able to develop working relationships with coworkers in locations around the globe. As an engineer at GitHub you’ll always be challenged to solve interesting and novel problems that have real impact on how the world builds software. Responsibilities Build and improve the frameworks and tools we use to build, test, configure our Kubernetes clusters. Ensure a reliable Kubernetes platform across bare-metal, virtual machines, and cloud environments. Cultivate open source projects developed by GitHub and build things you are proud to share. Work closely with other engineering and infrastructure teams to design solutions and support Kubernetes workloads. Collaborate with teams from across the company to respond to incidents Participate in on-call rotations to ensure service reliability Qualifications Required Qualifications: Minimum 4 years technical experience in infrastructure domains (e.g., container orchestration engineering, platform engineering, database engineering, software engineering, network engineering, systems administration, or related field) OR Bachelor's Degree in Computer Science, Information Technology, or related field AND minimum 2 years technical experience in infrastructure domains (e.g., container orchestration engineering, platform engineering, database engineering, software engineering, network engineering, systems administration, or related field) Minimum of 4 years experience of testing, building and configuring Kubernetes clusters. Preferred Qualifications: Minimum 2 years experience in one or more scripting languages (e.g., Bash, Python, or a similar language) Minimum 2 years experience using general purpose programming languages (e.g., Go, Ruby, or a similar language). Minimum 3 years experience with cloud environments and/or Cloud Native Compute Foundation (CNCF) concepts. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. Equal Employment Opportunity GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"Germany Remote","country":"Germany","country_code":"DE","location_type":"ANY","latitude":51.165691,"longitude":10.451526,"categories":[{"name":"Engineering"}],"tags2":["DE-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: Minimum 4 years technical experience in infrastructure domains (e.g., container orchestration engineering, platform engineering, database engineering, software engineering, network engineering, systems administration, or related field) OR Bachelor's Degree in Computer Science, Information Technology, or related field AND minimum 2 years technical experience in infrastructure domains (e.g., container orchestration engineering, platform engineering, database engineering, software engineering, network engineering, systems administration, or related field) Minimum of 4 years experience of testing, building and configuring Kubernetes clusters. Preferred Qualifications: Minimum 2 years experience in one or more scripting languages (e.g., Bash, Python, or a similar language) Minimum 2 years experience using general purpose programming languages (e.g., Go, Ruby, or a similar language). Minimum 3 years experience with cloud environments and/or Cloud Native Compute Foundation (CNCF) concepts.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Build and improve the frameworks and tools we use to build, test, configure our Kubernetes clusters. Ensure a reliable Kubernetes platform across bare-metal, virtual machines, and cloud environments. Cultivate open source projects developed by GitHub and build things you are proud to share. Work closely with other engineering and infrastructure teams to design solutions and support Kubernetes workloads. Collaborate with teams from across the company to respond to incidents Participate in on-call rotations to ensure service reliability","posted_date":"2025-01-30T14:06:00+0000","apply_url":"https://globalcareers-githubinc.icims.com/jobs/3916/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2025-01-30T14:11:54Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2025-01-30T14:06:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":1,"uuid":"69d10a9a-d66a-4ab5-b8a6-46a2ea196b84"},"import_id":"409732cc-8d2e-42a6-b8c0-15634305104d","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/jobs/97434385996751558","jobHash":"02a409cce95218ae665031478123b900","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":51.165691,"longitude":10.451526},"locationType":"COUNTRY","postalAddress":{"addressLines":["Germany"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"DE","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.21074204644792707}]},"jobSummary":"Build and improve the frameworks and tools we use to build, test, configure our Kubernetes clusters. Ensure a reliable Kubernetes platform across bare-metal, virtual machines, and cloud environments. Cultivate open source projects developed by GitHub and build things you are proud to share. Work closely with other engineering and infrastructure teams to design solutions and support Kubernetes workloads. Collaborate with teams from across the company to respond to incidents Participate in on-call rotations to ensure service reliability","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/3916?lang=en-us","last_mod":"2025-01-30T14:12:18+0000","gdpr":true},"update_date":"2025-01-30T14:12:18+0000","create_date":"2025-01-30T14:12:18+0000","category":[" Engineering"],"full_location":"Germany","short_location":"Germany","multipleLocations":false}},{"data":{"slug":"3918","language":"en-us","languages":["en-us"],"req_id":"3918","title":"Senior Technical Program Manager","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is the developer company and the home of open source. We make it easier for developers to be developers: to work together, to solve challenging problems, and to create the world’s most important technologies. We foster a collaborative community that can come together—as individuals and in teams—to create the future of software and make a difference in the world. The Technical Program Management (TPM) organization is chartered with managing the launch of new GitHub products and offerings that delight our superfans and accelerate the growth of GitHub. Responsibilities The Technical Program Manager partners with the product manager, engineering lead, and other internal stakeholders to develop and manage a comprehensive program plan including schedule, cross - functional dependencies, risk elements, and communicating status/progress and risks to all the program stakeholders, including the GitHub leadership team. The TPM is technically adept and well versed in agile program management to engage with the GitHub engineering team while also has business breadth across go-to-market, marketing, sales, support, legal, finance and other functional areas to deliver an exceptional experience for GitHub’s customers. The TPM has a passion for program management, exceptional leadership skills to be able to mobilize engagement across multiple functions and be able to align all these efforts to deliver a high impact business outcome. In this role, the TPM will be as comfortable offering recommendations across both technical and business domains. The TPM is comfortable making trade-off recommendations that optimize for the overall program success over individual functional success. The TPM is adept at developing processes and tools to help scale the TPM function at GitHub and drive continuous improvements in the practice. This opportunity is well-suited for an experienced TPM who loves enabling teams to solve complex technical and business problems, has the attention to detail to deliver outstanding experiences for our customers and superfans, works collaboratively across a global organization, and thrives in a dynamic, fast-paced, completely distributed organization. The TPM should also be comfortable interacting with senior executives across the program partners articulating status, dependencies and navigating discussions towards impactful decisions. Qualifications Required Qualifications: 6+ years experience in engineering, product/technical program management, data analysis, or product development OR Bachelor's Degree in Computer Science, Engineering, Data Science, Math, Business, or related field AND 4+ years experience in engineering, product/technical program management, data analysis, or product development OR Master's Degree in Computer Science, Engineering, Data Science, Math, Business, or related field AND 2+ years experience in engineering, product/technical program management, data analysis, or product development OR equivalent experience. 3+ years experience in managing cross-functional and/or cross-team projects. Preferred Qualifications: 6+ years experience in managing cross-functional and/or cross-team projects. 2+ years experience designing, building, or supporting software systems. Comfortable working in a 100% remote and globally distributed team and willing to travel as/when needed in support of program goals Have a flair for software development projects, can quickly absorb new technologies and proven experience in creating clarity in the midst of complexity; experience in understanding the technical architecture and design of a product/ feature(s) Expert level knowledge in agile as well as traditional project management methodologies, with the ability to combine and develop hybrid tools to drive program success Ability to clearly identify and articulate program status, identify complex blockers, and work with a sense of urgency to mitigate unexpected issues, when they arise Demonstrated success in working in a boundaryless manner and delivering results through cross functional, cross organizational collaboration Intellectually curious with a passion for learning and development for yourself and others Compensation Range The base salary range for this job is USD $112,800.00 - USD $299,300.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 6+ years experience in engineering, product/technical program management, data analysis, or product development OR Bachelor's Degree in Computer Science, Engineering, Data Science, Math, Business, or related field AND 4+ years experience in engineering, product/technical program management, data analysis, or product development OR Master's Degree in Computer Science, Engineering, Data Science, Math, Business, or related field AND 2+ years experience in engineering, product/technical program management, data analysis, or product development OR equivalent experience. 3+ years experience in managing cross-functional and/or cross-team projects. Preferred Qualifications: 6+ years experience in managing cross-functional and/or cross-team projects. 2+ years experience designing, building, or supporting software systems. Comfortable working in a 100% remote and globally distributed team and willing to travel as/when needed in support of program goals Have a flair for software development projects, can quickly absorb new technologies and proven experience in creating clarity in the midst of complexity; experience in understanding the technical architecture and design of a product/ feature(s) Expert level knowledge in agile as well as traditional project management methodologies, with the ability to combine and develop hybrid tools to drive program success Ability to clearly identify and articulate program status, identify complex blockers, and work with a sense of urgency to mitigate unexpected issues, when they arise Demonstrated success in working in a boundaryless manner and delivering results through cross functional, cross organizational collaboration Intellectually curious with a passion for learning and development for yourself and others","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"The Technical Program Manager partners with the product manager, engineering lead, and other internal stakeholders to develop and manage a comprehensive program plan including schedule, cross - functional dependencies, risk elements, and communicating status/progress and risks to all the program stakeholders, including the GitHub leadership team. The TPM is technically adept and well versed in agile program management to engage with the GitHub engineering team while also has business breadth across go-to-market, marketing, sales, support, legal, finance and other functional areas to deliver an exceptional experience for GitHub’s customers. The TPM has a passion for program management, exceptional leadership skills to be able to mobilize engagement across multiple functions and be able to align all these efforts to deliver a high impact business outcome. In this role, the TPM will be as comfortable offering recommendations across both technical and business domains. The TPM is comfortable making trade-off recommendations that optimize for the overall program success over individual functional success. The TPM is adept at developing processes and tools to help scale the TPM function at GitHub and drive continuous improvements in the practice. This opportunity is well-suited for an experienced TPM who loves enabling teams to solve complex technical and business problems, has the attention to detail to deliver outstanding experiences for our customers and superfans, works collaboratively across a global organization, and thrives in a dynamic, fast-paced, completely distributed organization. The TPM should also be comfortable interacting with senior executives across the program partners articulating status, dependencies and navigating discussions towards impactful decisions.","posted_date":"2025-01-16T21:16:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/3918/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/101835308659548870","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"0c94d28889e65f9c7a508b31efe95ce0","derivedInfo":{"jobCategories":["MANAGEMENT","COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"The Technical Program Manager partners with the product manager, engineering lead, and other internal stakeholders to develop and manage a comprehensive program plan including schedule, cross - functional dependencies, risk elements, and communicating status/progress and risks to all the program stakeholders, including the GitHub leadership team. The TPM is technically adept and well versed in agile program management to engage with the GitHub engineering team while also has business breadth across go-to-market, marketing, sales, support, legal, finance and other functional areas to deliver an exceptional experience for GitHub’s customers. The TPM has a passion for program management, exceptional leadership skills to be able to mobilize engagement across multiple functions and be able to align all these efforts to deliver a high impact business outcome. In this role, the TPM will be as comfortable offering recommendations across both technical and business domains. The TPM is comfortable making trade-off recommendations that optimize for the overall program success over individual functional success. The TPM is adept at developing processes and tools to help scale the TPM function at GitHub and drive continuous improvements in the practice. This opportunity is well-suited for an experienced TPM who loves enabling teams to solve complex technical and business problems, has the attention to detail to deliver outstanding experiences for our customers and superfans, works collaboratively across a global organization, and thrives in a dynamic, fast-paced, completely distributed organization. The TPM should also be comfortable interacting with senior executives across the program partners articulating status, dependencies and navigating discussions towards impactful decisions.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2025-01-31T20:51:35Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2025-01-16T21:16:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9"},"revision_int":3,"uuid":"c7258a8b-2013-4e77-b27f-ce2ecfc32cd2"},"import_id":"8b7daf94-f93b-427b-9668-3bc1462cad12","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3918?lang=en-us","last_mod":"2025-01-31T20:52:18+0000","gdpr":false},"update_date":"2025-01-31T20:52:18+0000","create_date":"2025-01-16T21:22:39+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}}],"locations":[],"totalCount":35,"request_id":false,"count":35,"languageCounts":{"en-us":{"displayName":"English","count":35}},"filter":{"facetList":{"tags4":[{"term":"Experienced Professional","count":35}],"tags5":[{"term":"Individual Contributor","count":28},{"term":"Senior Manager","count":5},{"term":"Director","count":2}],"tags6":[{"term":"Yes","count":35}]},"displayLimit":10,"brands":{"all":[],"shortlist":[]},"categories":{"all":[{"category":"Engineering","numJobs":35}],"shortlist":[{"category":"Engineering","numJobs":35}]},"locations":{"all":[{"city":null,"state":"Alberta","country":"CAN","count":2},{"city":null,"state":"British Columbia","country":"CAN","count":1},{"city":null,"state":"British Columbia","country":"Canada","count":1},{"city":null,"state":"Ontario","country":"CAN","count":1},{"city":null,"state":"Ontario","country":"Canada","count":1},{"city":null,"state":null,"country":"Canada","count":1},{"city":null,"state":null,"country":"Germany","count":4},{"city":null,"state":null,"country":"United Kingdom","count":10},{"city":null,"state":null,"country":"United States","count":18}],"shortlist":[{"city":null,"state":"Alberta","country":"CAN","count":2},{"city":null,"state":"British Columbia","country":"CAN","count":1},{"city":null,"state":"British Columbia","country":"Canada","count":1},{"city":null,"state":"Ontario","country":"CAN","count":1},{"city":null,"state":"Ontario","country":"Canada","count":1},{"city":null,"state":null,"country":"Canada","count":1},{"city":null,"state":null,"country":"Germany","count":4},{"city":null,"state":null,"country":"United Kingdom","count":10},{"city":null,"state":null,"country":"United States","count":18}]},"experienceLevels":{"all":[],"shortlist":[]}}}