{"jobs":[{"data":{"slug":"3827","language":"en-us","languages":["en-us"],"req_id":"3827","title":"Principal Software Engineer, Copilot Experiences","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview We’re looking for an experienced Principal Software Engineer to lead cross-functional AI innovation and deliver high-impact contributions to the capabilities and quality of Copilot experiences. In this role, you'll be responsible for driving AI innovation, working closely with engineering, product management, design, and leadership to drive innovation. You'll play a key role in shaping the future of Copilot experiences by improving AI-driven developer tools used by millions globally, directly influencing the product's features, performance, and user experience. This role requires a deep understanding of LLM retrieval augmented generation (RAG), prompt engineering and evaluation, development of end-to-end AI features using cutting-edge technologies, and a solid ability to lead cross-functional teams on complex technical projects. If you have a foundation in AI and machine learning, a deep skillset in shipping software at scale, and an empathetic approach to mentoring and collaborating with a diverse team then this might be the role for you. Responsibilities Guide organizational AI technical direction (~80 engineers) for Copilot experiences, driving innovation through engineering mentorship. Leverage and integrate existing AI research approaches to solve immediate product challenges and bring long-term AI innovations into production. Lead cross-functional collaboration to ensure that advanced technologies are applied practically to meet business objectives. Collaborate with engineering, product, stakeholders, and leadership to drive informed, strategic decision-making, ensuring that the org's work contributes to the success of Copilot experiences and aligns with broader organizational goals. Communicate progress, risks, and successes to stakeholders, ensuring consistent progress toward goals and managing high-impact outcomes. May include technical leadership in scaling software and cloud architecture. Communicate effectively with a wide range of stakeholders including executives, cross-functional partners, and early in career engineers. Qualifications Required Qualifications: 11+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, JavaScript, C#, Rust, Python, Java, C or C++ OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 10+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science or related field AND 9+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 7+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR equivalent experience. 4+ years experience delivering highly available enterprise grade services, including monitoring, observability and diagnosing problems. 2+ years building and maintaining AI applications in production. Preferred Qualifications: Experience with building Ruby, Go, and JavaScript applications in production at scale. Experience in LLM retrieval augmented generation (RAG), prompt engineering, online and offline evaluation. Experience in search at scale, search index internals, and information retrieval. Experience in cloud-native development, including designing, building, and deploying scalable applications using microservices architecture, containers (e.g., Docker), and orchestration tools like Kubernetes. Proficiency in leveraging cloud platforms (e.g., AWS, Azure, or GCP) for optimizing application performance and scalability. Experience with Azure. A passion for fostering good engineering practices, tools, and processes and experience with and passion for mentoring engineers. Excellent analytical skills as well as communication skills both verbal and written. We’re a distributed team so we’re extra mindful about communication. Other Qualifications: Ability to meet GitHub, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft, GitHub’s parent company, Cloud Screen upon hire/transfer and every two years thereafter. Compensation Range The base salary range for this job is USD $145,600.00 - USD $386,400.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 11+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, JavaScript, C#, Rust, Python, Java, C or C++ OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 10+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science or related field AND 9+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 7+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR equivalent experience. 4+ years experience delivering highly available enterprise grade services, including monitoring, observability and diagnosing problems. 2+ years building and maintaining AI applications in production. Preferred Qualifications: Experience with building Ruby, Go, and JavaScript applications in production at scale. Experience in LLM retrieval augmented generation (RAG), prompt engineering, online and offline evaluation. Experience in search at scale, search index internals, and information retrieval. Experience in cloud-native development, including designing, building, and deploying scalable applications using microservices architecture, containers (e.g., Docker), and orchestration tools like Kubernetes. Proficiency in leveraging cloud platforms (e.g., AWS, Azure, or GCP) for optimizing application performance and scalability. Experience with Azure. A passion for fostering good engineering practices, tools, and processes and experience with and passion for mentoring engineers. Excellent analytical skills as well as communication skills both verbal and written. We’re a distributed team so we’re extra mindful about communication. Other Qualifications: Ability to meet GitHub, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft, GitHub’s parent company, Cloud Screen upon hire/transfer and every two years thereafter.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Guide organizational AI technical direction (~80 engineers) for Copilot experiences, driving innovation through engineering mentorship. Leverage and integrate existing AI research approaches to solve immediate product challenges and bring long-term AI innovations into production. Lead cross-functional collaboration to ensure that advanced technologies are applied practically to meet business objectives. Collaborate with engineering, product, stakeholders, and leadership to drive informed, strategic decision-making, ensuring that the org's work contributes to the success of Copilot experiences and aligns with broader organizational goals. Communicate progress, risks, and successes to stakeholders, ensuring consistent progress toward goals and managing high-impact outcomes. May include technical leadership in scaling software and cloud architecture. Communicate effectively with a wide range of stakeholders including executives, cross-functional partners, and early in career engineers.","posted_date":"2024-12-06T18:14:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/3827/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"last_mod":"2025-03-17T20:19:56.005+00:00","icims":{"jps_is_public":true,"date_updated":"2025-03-03T19:05:21Z","primary_posted_site_object":{"site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9","datePosted":"2024-12-06T18:14:00+0000"},"config_keys":null,"revision_int":13,"uuid":"bf6fdb9e-6cf1-49c2-9dc4-52392d64a7ce"},"googlejobs":{"jobName":"projects/helpful-passage-853/jobs/115347039197242054","jobTitleSnippet":"","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","searchTextSnippet":"","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"radiusInMiles":2.6691467883166546,"postalAddress":{"regionCode":"US","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["United States"],"administrativeArea":"","languageCode":"","revision":0},"locationType":"COUNTRY","latLng":{"latitude":38.7945952,"longitude":-106.5348379}}]},"jobHash":"fbf71ccc1da800839f51ac39d50f5427","jobSummary":"Guide organizational AI technical direction (~80 engineers) for Copilot experiences, driving innovation through engineering mentorship. Leverage and integrate existing AI research approaches to solve immediate product challenges and bring long-term AI innovations into production. Lead cross-functional collaboration to ensure that advanced technologies are applied practically to meet business objectives. Collaborate with engineering, product, stakeholders, and leadership to drive informed, strategic decision-making, ensuring that the org's work contributes to the success of Copilot experiences and aligns with broader organizational goals. Communicate progress, risks, and successes to stakeholders, ensuring consistent progress toward goals and managing high-impact outcomes. May include technical leadership in scaling software and cloud architecture. Communicate effectively with a wide range of stakeholders including executives, cross-functional partners, and early in career engineers."},"import_id":"5a8f2547-6e1a-474d-9fc8-291acd406d80","redirectOnApply":true,"import_source":"ImporterService","canonical_url":"https://githubinc.jibeapply.com/jobs/3827?lang=en-us","client_code":"githubinc","gdpr":false},"update_date":"2025-03-17T20:19:56+0000","create_date":"2025-03-17T20:19:56+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"3736","language":"en-us","languages":["en-us"],"req_id":"3736","title":"Sr. Mgr, Software Engineering, GraphQL Platform","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview We are seeking a Senior Engineering manager for the GraphQL platform team in the Extensibility group. The GraphQL Platform team is responsible for maintaining and improving GitHub’s GraphQL platform. GitHub’s GraphQL platform serves more than 3.8B requests per week, with GitHub’s GraphQL APIs driving internal (e.g. Actions, GitHub mobile) and external integrations. Lead a team to execute 10x API architecture for GitHub while running crisp platform operations to keep our GraphQL platform running smoothly and highly available. Responsibilities Problem Solving: Identifying and addressing complex challenges and providing creative solutions to advance the organization's goals. Engineering Excellence: Fostering strong engineering practices and processes, growing generational teams that value excellence. Team Leadership: Leading and managing a team of engineers, which may include hiring, mentoring, and providing guidance to team members to help them excel in their roles. Conducting performance evaluations, setting goals, and providing feedback to team members to help them grow and develop in their roles. Project Management: Overseeing the planning, execution, and successful completion of projects, ensuring they align with the organization's goals and objectives. Strategy: Developing and implementing a strategic roadmap that supports our organization's long-term vision and objectives, including identifying areas of focus and setting priorities. At times this will mean charting the strategic path through ambiguity and uncertainty. Collaboration: Collaborating with cross-functional teams, including engineers, product managers, designers, and data scientists to integrate solutions into product development and business strategies. Innovation: Driving innovation within the team by exploring new methodologies, tools, and technologies that can enhance research capabilities and outcomes. Communication: Effectively communicating status, findings, insights, and recommendations to the leadership team. Demonstration and encouragement around the importance of strong written and verbal communication skills. Quality Assurance: Ensuring that work conducted by the team meets high-quality standards and adheres to ethical guidelines and industry best practices. Qualifications Required/Minimum Qualifications: 6+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python o OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python o OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python o OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python o OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field o OR equivalent experience 1+ years of direct and/or indirect people management or leadership experience 2+ years experience designing, building, scaling and maintaining distributed systems Experience in testing, production system monitoring, and observability Preferred Qualifications: Experience in GraphQL API development and architecture Experience in Golang Track record of leading teams in lean and effective operational practices Track record of strong analytical skills as well as communication skills both verbal and written Candidates located in EST (Eastern Standard Time) are strongly preferred Compensation Range The base salary range for this job is USD $112,800.00 - USD $299,300.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Senior Manager"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required/Minimum Qualifications: 6+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python o OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python o OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python o OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python o OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field o OR equivalent experience 1+ years of direct and/or indirect people management or leadership experience 2+ years experience designing, building, scaling and maintaining distributed systems Experience in testing, production system monitoring, and observability Preferred Qualifications: Experience in GraphQL API development and architecture Experience in Golang Track record of leading teams in lean and effective operational practices Track record of strong analytical skills as well as communication skills both verbal and written Candidates located in EST (Eastern Standard Time) are strongly preferred","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Problem Solving: Identifying and addressing complex challenges and providing creative solutions to advance the organization's goals. Engineering Excellence: Fostering strong engineering practices and processes, growing generational teams that value excellence. Team Leadership: Leading and managing a team of engineers, which may include hiring, mentoring, and providing guidance to team members to help them excel in their roles. Conducting performance evaluations, setting goals, and providing feedback to team members to help them grow and develop in their roles. Project Management: Overseeing the planning, execution, and successful completion of projects, ensuring they align with the organization's goals and objectives. Strategy: Developing and implementing a strategic roadmap that supports our organization's long-term vision and objectives, including identifying areas of focus and setting priorities. At times this will mean charting the strategic path through ambiguity and uncertainty. Collaboration: Collaborating with cross-functional teams, including engineers, product managers, designers, and data scientists to integrate solutions into product development and business strategies. Innovation: Driving innovation within the team by exploring new methodologies, tools, and technologies that can enhance research capabilities and outcomes. Communication: Effectively communicating status, findings, insights, and recommendations to the leadership team. Demonstration and encouragement around the importance of strong written and verbal communication skills. Quality Assurance: Ensuring that work conducted by the team meets high-quality standards and adheres to ethical guidelines and industry best practices.","posted_date":"2025-01-08T00:06:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/3736/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"last_mod":"2025-03-18T16:21:34.095+00:00","icims":{"jps_is_public":true,"date_updated":"2025-03-18T16:20:46Z","primary_posted_site_object":{"site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9","datePosted":"2025-01-08T00:06:00+0000"},"config_keys":null,"revision_int":12,"uuid":"08cbc355-0e02-4118-b1a0-de05afbac28a"},"googlejobs":{"jobName":"projects/helpful-passage-853/jobs/141972263019651782","jobTitleSnippet":"","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","searchTextSnippet":"","derivedInfo":{"jobCategories":["COMPUTER_AND_IT","MANAGEMENT"],"locations":[{"radiusInMiles":2.6691467883166546,"postalAddress":{"regionCode":"US","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["United States"],"administrativeArea":"","languageCode":"","revision":0},"locationType":"COUNTRY","latLng":{"latitude":38.7945952,"longitude":-106.5348379}}]},"jobHash":"7110962a58c1dfda05ab4102108f9bed","jobSummary":"Problem Solving: Identifying and addressing complex challenges and providing creative solutions to advance the organization's goals. Engineering Excellence: Fostering strong engineering practices and processes, growing generational teams that value excellence. Team Leadership: Leading and managing a team of engineers, which may include hiring, mentoring, and providing guidance to team members to help them excel in their roles. Conducting performance evaluations, setting goals, and providing feedback to team members to help them grow and develop in their roles. Project Management: Overseeing the planning, execution, and successful completion of projects, ensuring they align with the organization's goals and objectives. Strategy: Developing and implementing a strategic roadmap that supports our organization's long-term vision and objectives, including identifying areas of focus and setting priorities. At times this will mean charting the strategic path through ambiguity and uncertainty. Collaboration: Collaborating with cross-functional teams, including engineers, product managers, designers, and data scientists to integrate solutions into product development and business strategies. Innovation: Driving innovation within the team by exploring new methodologies, tools, and technologies that can enhance research capabilities and outcomes. Communication: Effectively communicating status, findings, insights, and recommendations to the leadership team. Demonstration and encouragement around the importance of strong written and verbal communication skills. Quality Assurance: Ensuring that work conducted by the team meets high-quality standards and adheres to ethical guidelines and industry best practices."},"import_id":"7e53c875-e410-4c45-8d36-887a2726cbec","redirectOnApply":true,"import_source":"ImporterService","canonical_url":"https://githubinc.jibeapply.com/jobs/3736?lang=en-us","client_code":"githubinc","gdpr":false},"update_date":"2025-03-18T16:21:34+0000","create_date":"2025-03-17T20:19:56+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"3804","language":"en-us","languages":["en-us"],"req_id":"3804","title":"Software Engineer III, Codespaces \u0026 Copilot Workspace","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview We’re building the future of cloud development with Codespaces: instant-on, container-based cloud environments tailored to specific projects, enabling developers to focus on writing code rather than managing setups. As a Senior Engineer on the compute team, you’ll design and implement a secure, reliable, and efficient platform that powers Codespaces, Copilot Workspace, and our LLM-based tooling. Your work will directly impact developers worldwide, ensuring these tools are always available, performant, cost-effective, and delightful to use. At GitHub, you’ll collaborate with a distributed, diverse, and passionate team of engineers and designers, delivering services that millions of developers depend on daily. In this role, you’ll design, prototype, implement, ship, and support highly performant, inspiring experiences that enhance collaboration and productivity for developers everywhere. We’re looking for creative problem solvers and diverse thinkers who value culture as much as customers and features. We believe how we work is just as important as what we deliver. Big vision, shared purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what drive great results. Great products reflect the teams that build them—come join us! Responsibilities Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary. Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code. Qualifications Required Qualifications: Experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR equivalent experience. Experience in cloud-native development, including designing, building, and deploying scalable applications using microservices architecture, containers (e.g., Docker), and orchestration tools like Kubernetes. Proficiency in leveraging cloud platforms (e.g., AWS, Azure, or GCP) for optimizing application performance and scalability. Experience with on-call rotations, incident response and site reliability, including diagnosing and resolving complex production issues under pressure. Experience implementing and maintaining compliance and security practices in software development, including secure coding, vulnerability management, data privacy, and regulatory standards (e.g., GDPR, SOC 2, HIPAA). Proficiency in designing systems with robust security measures and ensuring adherence to organizational and industry compliance requirements. Preferred Qualifications: Proficiency in modern programming languages such as C#, TypeScript, Go, and Rust. Excellent written and verbal communication via async collaboration, documentation, and visibility of work. Experience working with a remote, distributed team. Passionate about fostering effective Engineering practices and processes. Proficiency in Git and GitHub for version control and collaborative development and branching strategies. Experience with CI/CD Tools: Strong knowledge of CI/CD concepts and best practices. Experience with GitHub actions and workflows platform, familiar with other tools like Jenkins Contribute to open source software, engage with maintainers, and actively participate in community curation. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. Equal Employment Opportunity GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"United Kingdom Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: Experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR equivalent experience. Experience in cloud-native development, including designing, building, and deploying scalable applications using microservices architecture, containers (e.g., Docker), and orchestration tools like Kubernetes. Proficiency in leveraging cloud platforms (e.g., AWS, Azure, or GCP) for optimizing application performance and scalability. Experience with on-call rotations, incident response and site reliability, including diagnosing and resolving complex production issues under pressure. Experience implementing and maintaining compliance and security practices in software development, including secure coding, vulnerability management, data privacy, and regulatory standards (e.g., GDPR, SOC 2, HIPAA). Proficiency in designing systems with robust security measures and ensuring adherence to organizational and industry compliance requirements. Preferred Qualifications: Proficiency in modern programming languages such as C#, TypeScript, Go, and Rust. Excellent written and verbal communication via async collaboration, documentation, and visibility of work. Experience working with a remote, distributed team. Passionate about fostering effective Engineering practices and processes. Proficiency in Git and GitHub for version control and collaborative development and branching strategies. Experience with CI/CD Tools: Strong knowledge of CI/CD concepts and best practices. Experience with GitHub actions and workflows platform, familiar with other tools like Jenkins Contribute to open source software, engage with maintainers, and actively participate in community curation.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary. Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","posted_date":"2024-12-03T17:41:00+0000","apply_url":"https://globalcareers-githubinc.icims.com/jobs/3804/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"last_mod":"2025-03-17T20:20:02.423+00:00","icims":{"jps_is_public":true,"date_updated":"2025-03-07T19:40:13Z","primary_posted_site_object":{"site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750","datePosted":"2024-12-03T17:41:00+0000"},"config_keys":null,"revision_int":18,"uuid":"3e7fa172-294a-46f5-946b-96c3900abbe8"},"googlejobs":{"jobName":"projects/helpful-passage-853/jobs/82434481469694662","jobTitleSnippet":"","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","searchTextSnippet":"","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"radiusInMiles":0.5229118491937161,"postalAddress":{"regionCode":"GB","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","revision":0},"locationType":"COUNTRY","latLng":{"latitude":55.378051,"longitude":-3.435973}}]},"jobHash":"e8aa026cfe708555edf935cfbe02dfb2","jobSummary":"Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary. Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code."},"import_id":"9985a098-25ef-45e5-844d-a979dc8077d8","redirectOnApply":true,"import_source":"ImporterService","canonical_url":"https://githubinc.jibeapply.com/jobs/3804?lang=en-us","client_code":"githubinc","gdpr":true},"update_date":"2025-03-17T20:20:02+0000","create_date":"2025-03-17T20:20:02+0000","category":[" Engineering"],"full_location":"United Kingdom","short_location":"United Kingdom","multipleLocations":false}},{"data":{"slug":"3938","language":"en-us","languages":["en-us"],"req_id":"3938","title":"Software Engineer II","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, British Columbia Canada | Remote, Alberta Canada | Remote, Ontario Canada Overview As a software engineer at GitHub, you will enhance the collaboration experience at GitHub by working closely with a community of engineers and designers with a distributed, diverse and passionate team delivering the services that millions of developers depend on. In this role you will design, prototype, implement, ship and support highly performant and inspiring user experiences with your team. We are looking for creative problem solvers and diverse thinkers, people who care about culture as well as customers and features. We believe that how we do things is as important as what we do. Big vision, a common purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what lead to great results. Great products reflect the teams that build them. Responsibilities Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code. Qualifications Required Qualifications 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience OR Bachelor's Degree in Computer Science or related field OR equivalent experience. Preferred Qualifications Experience with Git and GitHub Experience using Azure technologies is a bonus Experience using front-end frameworks like React.js Understanding of REST principles and experience with backend APIs Strong written and verbal communication skill Passionate about healthy team culture and collaboration Comfortable working transparently in an agile environment and soliciting feedback from peers. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. Equal Employment Opportunity GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"British Columbia Remote","state":"British Columbia","country":"Canada","country_code":"CA","location_type":"ANY","latitude":53.7266683,"longitude":-127.6476206,"additional_locations":[{"location_name":"Alberta Remote","state":"Alberta","country":"Canada","country_code":"CA","latitude":53.9332706,"longitude":-116.5765035},{"location_name":"Ontario Remote","state":"Ontario","country":"Canada","country_code":"CA","latitude":51.253775,"longitude":-85.3232139}],"categories":[{"name":"Engineering"}],"tags2":["CA-BC-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience OR Bachelor's Degree in Computer Science or related field OR equivalent experience. Preferred Qualifications Experience with Git and GitHub Experience using Azure technologies is a bonus Experience using front-end frameworks like React.js Understanding of REST principles and experience with backend APIs Strong written and verbal communication skill Passionate about healthy team culture and collaboration Comfortable working transparently in an agile environment and soliciting feedback from peers.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","posted_date":"2025-01-21T16:10:00+0000","posting_expiry_date":"2025-07-21T15:10:00+0000","apply_url":"https://globalcareers-githubinc.icims.com/jobs/3938/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"last_mod":"2025-03-19T18:46:37.570+00:00","icims":{"jps_is_public":true,"date_updated":"2025-03-19T18:46:01Z","primary_posted_site_object":{"site":"globalcareers-githubinc","validThrough":"2025-07-21T15:10:00+0000","siteId":"48855464-2bde-48e1-af86-f8c7872d8750","datePosted":"2025-01-21T16:10:00+0000"},"config_keys":null,"revision_int":14,"uuid":"4ea19a6e-0b56-4a0c-a81e-d26e995413c6"},"googlejobs":{"jobName":"projects/helpful-passage-853/jobs/93389242234741446","jobTitleSnippet":"","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","searchTextSnippet":"","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"radiusInMiles":0.4159475213072899,"postalAddress":{"regionCode":"CA","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["British Columbia, Canada"],"administrativeArea":"BC","languageCode":"","revision":0},"locationType":"ADMINISTRATIVE_AREA","latLng":{"latitude":53.7266683,"longitude":-127.6476206}},{"radiusInMiles":0.30202952465811467,"postalAddress":{"regionCode":"CA","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["Alberta, Canada"],"administrativeArea":"AB","languageCode":"","revision":0},"locationType":"ADMINISTRATIVE_AREA","latLng":{"latitude":53.9332706,"longitude":-116.5765035}},{"radiusInMiles":0.5023275006040222,"postalAddress":{"regionCode":"CA","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["Ontario, Canada"],"administrativeArea":"ON","languageCode":"","revision":0},"locationType":"ADMINISTRATIVE_AREA","latLng":{"latitude":51.253775,"longitude":-85.3232139}}]},"jobHash":"2c14f16d19e2880833859854cb5def43","jobSummary":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code."},"import_id":"9f784fa6-1265-495e-a4ac-5b46072495f3","redirectOnApply":true,"import_source":"ImporterService","canonical_url":"https://githubinc.jibeapply.com/jobs/3938?lang=en-us","client_code":"githubinc","gdpr":false},"update_date":"2025-03-19T18:46:37+0000","create_date":"2025-03-17T20:20:06+0000","category":[" Engineering"],"full_location":"British Columbia, Canada; Alberta, Canada; Ontario, Canada","short_location":"British Columbia, Canada","multipleLocations":true}},{"data":{"slug":"3741","language":"en-us","languages":["en-us"],"req_id":"3741","title":"Principal Software Engineer, Web UI Platform","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is revolutionizing the way developers collaborate and build software, and we are seeking a Principal Software Engineer to pioneer the UI Platform space, which entails areas of frontend performance, accessibility, consistency, and availability. This role is an opportunity to define GitHub's future UI architecture, positioning GitHub as an industry leader in UI innovation. You will be responsible for empowering millions of developers worldwide by delivering exceptional and accessible user experiences. Responsibilities Lead UI Architecture at Scale: Own the architecture and development of GitHub's Web UI platform, ensuring scalability, reliability, accessibility, and performance for millions of users worldwide. Cross-Functional Leadership: Collaborate with cross-functional teams in engineering, product, and design to drive key frontend initiatives that optimize the user experience for our users, balancing frontend performance with complex backend APIs. Mentorship and Technical Leadership: Provide technical mentorship to engineering teams, guiding best practices, establishing coding standards, and driving continuous improvement across the Web UI platform. Architect for Scale, Performance and Accessibility: Champion accessibility and performance, ensuring GitHub’s frontend systems meet the highest standards and continue to perform at scale. Lead efforts to make the platform fast, accessible, and consistent across all products. Balance Strategic and Hands-On Work: Drive architectural decision-making while remaining hands-on with coding and problem-solving where needed. Balance technical leadership with executing large-scale initiatives from concept to delivery. Advocate for Platform Priorities: Drive the strategic vision for the Web UI platform by securing leadership support and resources, ensuring alignment with company-wide goals. Build at Global Scale: Develop frontend solutions that power a platform supporting a large and distributed user base of millions of daily active users and billions of requests, ensuring GitHub’s frontend experiences remain fast, reliable, and accessible under high loads. What Success Looks Like in the First Year Ramping Up and Understanding GitHub’s Systems: In the first few months, you’ll be expected to gain a deep understanding of GitHub’s systems, including the Web UI platform, backend services, and key dependencies. Success will come from applying this knowledge to drive informed decisions and impactful initiatives. Leading Initiatives for Scalability: Deliver a robust UI platform that enhances the performance and accessibility of GitHub’s frontend systems, ensuring they scale effectively to meet the needs of millions of developers globally. Driving Frontend Strategy: Collaborating with engineering, product, and design teams to create and execute strategic initiatives that drive the evolution of GitHub’s Web UI platform. Mentoring Engineering Teams: Mentoring engineering teams to adopt best practices for scalable, high-performance frontend development, ensuring consistent delivery of high-quality solutions. Qualifications Required Qualifications: 11+ years of experience in Software Engineering, Computer Science, or a related technical discipline, with proven experience maintaining and delivering production software in languages including, but not limited to, JavaScript, Go, or Ruby OR Associate’s Degree in a related field (e.g., Computer Science, Electrical Engineering, Math, Physics) and 10+ years of experience in the same areas with proficiency in the listed languages. OR Bachelor’s Degree in a related field and 9+ years of experience with the same languages and technologies. OR Master’s Degree in a related field and 7+ years of experience with the same languages and technologies. OR Doctorate in a related field and 5+ years of experience with the same languages and technologies. OR equivalent experience 7+ years of experience in designing, building, and maintaining large-scale frontend applications and the backend systems that support these with an emphasis on performance, scalability, and maintainability at the scale of hundreds of millions of users 7+ years of providing technical leadership and mentorship, guiding teams to deliver software solutions, demonstrating timely execution of projects and initiatives. 3+ years of experience leading work implemented across multiple teams, frequently coordinating and collaborating with backend services, API teams, or infrastructure teams outside of your core area of responsibility. Preferred Qualifications: Experience navigating how different concerns within the frontend engineering space overlap (e.g. accessibility, performance, UX consistency) and crafting execution strategies that successfully take these areas into consideration and lead to meaningful and impactful deliverables. Deep expertise and knowledge of the internals of React and related technologies Passionate and active in the evolution of current front-end architecture trends and best practices, encompassing performance, accessibility, security, and usability. Extensive experience with TypeScript and other statically typed languages, Node.js, the Web platform, and UI architecture Experience with large-scale codebases with contributors that span teams, offices and time zones Experience managing complex interactions between frontend and backend services Prior experience with Ruby on Rails or other backend technologies. Proficiency in using and customizing build tools and automation frameworks, such as Webpack. Prior experience articulating complex technical concepts to both technical (engineers at all levels) and non-technical (stakeholders and executives) audiences Compensation Range The base salary range for this job is USD $145,600.00 - USD $386,400.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications: 11+ years of experience in Software Engineering, Computer Science, or a related technical discipline, with proven experience maintaining and delivering production software in languages including, but not limited to, JavaScript, Go, or Ruby OR Associate’s Degree in a related field (e.g., Computer Science, Electrical Engineering, Math, Physics) and 10+ years of experience in the same areas with proficiency in the listed languages. OR Bachelor’s Degree in a related field and 9+ years of experience with the same languages and technologies. OR Master’s Degree in a related field and 7+ years of experience with the same languages and technologies. OR Doctorate in a related field and 5+ years of experience with the same languages and technologies. OR equivalent experience 7+ years of experience in designing, building, and maintaining large-scale frontend applications and the backend systems that support these with an emphasis on performance, scalability, and maintainability at the scale of hundreds of millions of users 7+ years of providing technical leadership and mentorship, guiding teams to deliver software solutions, demonstrating timely execution of projects and initiatives. 3+ years of experience leading work implemented across multiple teams, frequently coordinating and collaborating with backend services, API teams, or infrastructure teams outside of your core area of responsibility. Preferred Qualifications: Experience navigating how different concerns within the frontend engineering space overlap (e.g. accessibility, performance, UX consistency) and crafting execution strategies that successfully take these areas into consideration and lead to meaningful and impactful deliverables. Deep expertise and knowledge of the internals of React and related technologies Passionate and active in the evolution of current front-end architecture trends and best practices, encompassing performance, accessibility, security, and usability. Extensive experience with TypeScript and other statically typed languages, Node.js, the Web platform, and UI architecture Experience with large-scale codebases with contributors that span teams, offices and time zones Experience managing complex interactions between frontend and backend services Prior experience with Ruby on Rails or other backend technologies. Proficiency in using and customizing build tools and automation frameworks, such as Webpack. Prior experience articulating complex technical concepts to both technical (engineers at all levels) and non-technical (stakeholders and executives) audiences","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Lead UI Architecture at Scale: Own the architecture and development of GitHub's Web UI platform, ensuring scalability, reliability, accessibility, and performance for millions of users worldwide. Cross-Functional Leadership: Collaborate with cross-functional teams in engineering, product, and design to drive key frontend initiatives that optimize the user experience for our users, balancing frontend performance with complex backend APIs. Mentorship and Technical Leadership: Provide technical mentorship to engineering teams, guiding best practices, establishing coding standards, and driving continuous improvement across the Web UI platform. Architect for Scale, Performance and Accessibility: Champion accessibility and performance, ensuring GitHub’s frontend systems meet the highest standards and continue to perform at scale. Lead efforts to make the platform fast, accessible, and consistent across all products. Balance Strategic and Hands-On Work: Drive architectural decision-making while remaining hands-on with coding and problem-solving where needed. Balance technical leadership with executing large-scale initiatives from concept to delivery. Advocate for Platform Priorities: Drive the strategic vision for the Web UI platform by securing leadership support and resources, ensuring alignment with company-wide goals. Build at Global Scale: Develop frontend solutions that power a platform supporting a large and distributed user base of millions of daily active users and billions of requests, ensuring GitHub’s frontend experiences remain fast, reliable, and accessible under high loads. What Success Looks Like in the First Year Ramping Up and Understanding GitHub’s Systems: In the first few months, you’ll be expected to gain a deep understanding of GitHub’s systems, including the Web UI platform, backend services, and key dependencies. Success will come from applying this knowledge to drive informed decisions and impactful initiatives. Leading Initiatives for Scalability: Deliver a robust UI platform that enhances the performance and accessibility of GitHub’s frontend systems, ensuring they scale effectively to meet the needs of millions of developers globally. Driving Frontend Strategy: Collaborating with engineering, product, and design teams to create and execute strategic initiatives that drive the evolution of GitHub’s Web UI platform. Mentoring Engineering Teams: Mentoring engineering teams to adopt best practices for scalable, high-performance frontend development, ensuring consistent delivery of high-quality solutions.","posted_date":"2025-02-11T17:39:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/3741/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"last_mod":"2025-03-24T14:24:22.155+00:00","icims":{"jps_is_public":true,"date_updated":"2025-03-24T14:24:01Z","primary_posted_site_object":{"site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9","datePosted":"2025-02-11T17:39:00+0000"},"config_keys":null,"revision_int":20,"uuid":"371c2ab8-fd99-49a9-8676-ba09e13e7906"},"googlejobs":{"jobName":"projects/helpful-passage-853/jobs/81157609972736710","jobTitleSnippet":"","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","searchTextSnippet":"","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"radiusInMiles":2.6691467883166546,"postalAddress":{"regionCode":"US","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["United States"],"administrativeArea":"","languageCode":"","revision":0},"locationType":"COUNTRY","latLng":{"latitude":38.7945952,"longitude":-106.5348379}}]},"jobHash":"493da01816a09e0e6207efc39dd0f6ae","jobSummary":"Lead UI Architecture at Scale: Own the architecture and development of GitHub's Web UI platform, ensuring scalability, reliability, accessibility, and performance for millions of users worldwide. Cross-Functional Leadership: Collaborate with cross-functional teams in engineering, product, and design to drive key frontend initiatives that optimize the user experience for our users, balancing frontend performance with complex backend APIs. Mentorship and Technical Leadership: Provide technical mentorship to engineering teams, guiding best practices, establishing coding standards, and driving continuous improvement across the Web UI platform. Architect for Scale, Performance and Accessibility: Champion accessibility and performance, ensuring GitHub’s frontend systems meet the highest standards and continue to perform at scale. Lead efforts to make the platform fast, accessible, and consistent across all products. Balance Strategic and Hands-On Work: Drive architectural decision-making while remaining hands-on with coding and problem-solving where needed. Balance technical leadership with executing large-scale initiatives from concept to delivery. Advocate for Platform Priorities: Drive the strategic vision for the Web UI platform by securing leadership support and resources, ensuring alignment with company-wide goals. Build at Global Scale: Develop frontend solutions that power a platform supporting a large and distributed user base of millions of daily active users and billions of requests, ensuring GitHub’s frontend experiences remain fast, reliable, and accessible under high loads. What Success Looks Like in the First Year Ramping Up and Understanding GitHub’s Systems: In the first few months, you’ll be expected to gain a deep understanding of GitHub’s systems, including the Web UI platform, backend services, and key dependencies. Success will come from applying this knowledge to drive informed decisions and impactful initiatives. Leading Initiatives for Scalability: Deliver a robust UI platform that enhances the performance and accessibility of GitHub’s frontend systems, ensuring they scale effectively to meet the needs of millions of developers globally. Driving Frontend Strategy: Collaborating with engineering, product, and design teams to create and execute strategic initiatives that drive the evolution of GitHub’s Web UI platform. Mentoring Engineering Teams: Mentoring engineering teams to adopt best practices for scalable, high-performance frontend development, ensuring consistent delivery of high-quality solutions."},"import_id":"be0aef6c-bd45-4a20-bb5b-542d017667b9","redirectOnApply":true,"import_source":"ImporterService","canonical_url":"https://githubinc.jibeapply.com/jobs/3741?lang=en-us","client_code":"githubinc","gdpr":false},"update_date":"2025-03-24T14:24:22+0000","create_date":"2025-03-24T14:24:22+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"4128","language":"en-us","languages":["en-us"],"req_id":"4128","title":"Software Engineer III","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is looking for a Software Engineer III to join the Service Mesh team within our Developer Experience organization. You will focus on the systems and tools that enable our engineers to operate and scale the world's largest code hosting platform. With limited guidance, you will build and enhance the virtual frameworks and tools that are used to manage and maintain the infrastructure. You will deploy, maintain, and enhance our Istio based service mesh with a focus on making the Developer Experience the best it can be for our engineering and infrastructure teams. The Developer Experience team is highly distributed and you will thrive in an environment of remote work and asynchronous communication. You're expected to have strong written communication skills and be able to develop working relationships with coworkers in locations around the globe. You will contribute to collaborations with software engineers and other infrastructure teams to troubleshoot issues and optimize infrastructure performance. As an engineer at GitHub you'll always be challenged to solve interesting and novel problems that have real impact on how the world builds software. Responsibilities Builds and improves the frameworks and tools we use to build, test, and configure our Istio based service mesh in our infrastructure. Ensures a reliable service mesh platform across bare-metal, virtual machines, and cloud environments. Develops and supports our service mesh initiative across data center and cloud environments. Designs, implements, and supports new functionality for Mesh platform. Maintains software for configuration management, task automation, and infrastructure automation. Troubleshooting: With limited guidance, reads, and assesses errors to form accurate diagnoses and create or direct fixes. Remains on-call to handle incidents and outages, investigating and addressing issues to minimize the downtime and impact on services. Contributes to incident management processes, participates in incident report-out, and helps implement preventive measures to avoid similar incidents in the future. Qualifications Required Qualifications: 4+ years technical experience in infrastructure domains (e.g., container orchestration engineering, platform engineering, database engineering, software engineering, network engineering, systems administration, or related field) OR Bachelor's Degree in Computer Science, Information Technology, or related field AND 2+ years technical experience in infrastructure domains (e.g., container orchestration engineering, platform engineering, database engineering, software engineering, network engineering, systems administration, or related field) OR equivalent experience. 1+ year(s) experience operating Kubernetes; ideally in a high scale, production environment. Preferred Qualifications: Exposure to service mesh platforms, such as Istio or Linkerd. Experience developing system software in Go. 1+ year(s) experience in one or more scripting languages (e.g., Bash, Python, or a similar language). 1+ year(s) experience using general purpose programming languages (e.g., Go, Ruby, or a similar language). 2+ years experience with cloud environments and/or Cloud Native Compute Foundation (CNCF) concepts. Other Requirements: Ability to meet GitHub, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft, GitHub’s parent company, Cloud Screen upon hire/transfer and every two years thereafter. Compensation Range The base salary range for this job is USD $97,900.00 - USD $259,900.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 4+ years technical experience in infrastructure domains (e.g., container orchestration engineering, platform engineering, database engineering, software engineering, network engineering, systems administration, or related field) OR Bachelor's Degree in Computer Science, Information Technology, or related field AND 2+ years technical experience in infrastructure domains (e.g., container orchestration engineering, platform engineering, database engineering, software engineering, network engineering, systems administration, or related field) OR equivalent experience. 1+ year(s) experience operating Kubernetes; ideally in a high scale, production environment. Preferred Qualifications: Exposure to service mesh platforms, such as Istio or Linkerd. Experience developing system software in Go. 1+ year(s) experience in one or more scripting languages (e.g., Bash, Python, or a similar language). 1+ year(s) experience using general purpose programming languages (e.g., Go, Ruby, or a similar language). 2+ years experience with cloud environments and/or Cloud Native Compute Foundation (CNCF) concepts. Other Requirements: Ability to meet GitHub, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft, GitHub’s parent company, Cloud Screen upon hire/transfer and every two years thereafter.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Builds and improves the frameworks and tools we use to build, test, and configure our Istio based service mesh in our infrastructure. Ensures a reliable service mesh platform across bare-metal, virtual machines, and cloud environments. Develops and supports our service mesh initiative across data center and cloud environments. Designs, implements, and supports new functionality for Mesh platform. Maintains software for configuration management, task automation, and infrastructure automation. Troubleshooting: With limited guidance, reads, and assesses errors to form accurate diagnoses and create or direct fixes. Remains on-call to handle incidents and outages, investigating and addressing issues to minimize the downtime and impact on services. Contributes to incident management processes, participates in incident report-out, and helps implement preventive measures to avoid similar incidents in the future.","posted_date":"2025-03-21T21:03:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/4128/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"last_mod":"2025-03-21T21:05:33.158+00:00","icims":{"jps_is_public":true,"date_updated":"2025-03-21T21:04:43Z","primary_posted_site_object":{"site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9","datePosted":"2025-03-21T21:03:00+0000"},"config_keys":null,"revision_int":1,"uuid":"39cb8861-e72f-4680-aa70-a36f3c1447c9"},"googlejobs":{"jobName":"projects/helpful-passage-853/jobs/109204551721984710","jobTitleSnippet":"","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","searchTextSnippet":"","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"radiusInMiles":2.6691467883166546,"postalAddress":{"regionCode":"US","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["United States"],"administrativeArea":"","languageCode":"","revision":0},"locationType":"COUNTRY","latLng":{"latitude":38.7945952,"longitude":-106.5348379}}]},"jobHash":"9fb1ad5a57374884a5f6be077a65e055","jobSummary":"Builds and improves the frameworks and tools we use to build, test, and configure our Istio based service mesh in our infrastructure. Ensures a reliable service mesh platform across bare-metal, virtual machines, and cloud environments. Develops and supports our service mesh initiative across data center and cloud environments. Designs, implements, and supports new functionality for Mesh platform. Maintains software for configuration management, task automation, and infrastructure automation. Troubleshooting: With limited guidance, reads, and assesses errors to form accurate diagnoses and create or direct fixes. Remains on-call to handle incidents and outages, investigating and addressing issues to minimize the downtime and impact on services. Contributes to incident management processes, participates in incident report-out, and helps implement preventive measures to avoid similar incidents in the future."},"import_id":"40c7d60f-85a8-42f6-92bf-639b2e168935","redirectOnApply":true,"import_source":"ImporterService","canonical_url":"https://githubinc.jibeapply.com/jobs/4128?lang=en-us","client_code":"githubinc","gdpr":false},"update_date":"2025-03-21T21:05:33+0000","create_date":"2025-03-21T21:05:33+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"3856","language":"en-us","languages":["en-us"],"req_id":"3856","title":"Software Engineer III, Codespaces \u0026 Copilot Workspace","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, Germany Overview We’re building the future of cloud development with Codespaces: instant-on, container-based cloud environments tailored to specific projects, enabling developers to focus on writing code rather than managing setups. As a Senior Engineer on the compute team, you’ll design and implement a secure, reliable, and efficient platform that powers Codespaces, Copilot Workspace, and our LLM-based tooling. Your work will directly impact developers worldwide, ensuring these tools are always available, performant, cost-effective, and delightful to use. At GitHub, you’ll collaborate with a distributed, diverse, and passionate team of engineers and designers, delivering services that millions of developers depend on daily. In this role, you’ll design, prototype, implement, ship, and support highly performant, inspiring experiences that enhance collaboration and productivity for developers everywhere. We’re looking for creative problem solvers and diverse thinkers who value culture as much as customers and features. We believe how we work is just as important as what we deliver. Big vision, shared purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what drive great results. Great products reflect the teams that build them—come join us! Responsibilities Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary. Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code. Qualifications Required Qualifications: Experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR equivalent experience. Experience in cloud-native development, including designing, building, and deploying scalable applications using microservices architecture, containers (e.g., Docker), and orchestration tools like Kubernetes. Proficiency in leveraging cloud platforms (e.g., AWS, Azure, or GCP) for optimizing application performance and scalability. Experience with on-call rotations, incident response and site reliability, including diagnosing and resolving complex production issues under pressure. Experience implementing and maintaining compliance and security practices in software development, including secure coding, vulnerability management, data privacy, and regulatory standards (e.g., GDPR, SOC 2, HIPAA). Proficiency in designing systems with robust security measures and ensuring adherence to organizational and industry compliance requirements. Preferred Qualifications: Proficiency in modern programming languages such as C#, TypeScript, Go, and Rust. Excellent written and verbal communication via async collaboration, documentation, and visibility of work. Experience working with a remote, distributed team. Passionate about fostering effective Engineering practices and processes. Proficiency in Git and GitHub for version control and collaborative development and branching strategies. Experience with CI/CD Tools: Strong knowledge of CI/CD concepts and best practices. Experience with GitHub actions and workflows platform, familiar with other tools like Jenkins Contribute to open source software, engage with maintainers, and actively participate in community curation. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. Equal Employment Opportunity GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"Germany Remote","country":"Germany","country_code":"DE","location_type":"ANY","latitude":51.165691,"longitude":10.451526,"categories":[{"name":"Engineering"}],"tags2":["DE-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: Experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR equivalent experience. Experience in cloud-native development, including designing, building, and deploying scalable applications using microservices architecture, containers (e.g., Docker), and orchestration tools like Kubernetes. Proficiency in leveraging cloud platforms (e.g., AWS, Azure, or GCP) for optimizing application performance and scalability. Experience with on-call rotations, incident response and site reliability, including diagnosing and resolving complex production issues under pressure. Experience implementing and maintaining compliance and security practices in software development, including secure coding, vulnerability management, data privacy, and regulatory standards (e.g., GDPR, SOC 2, HIPAA). Proficiency in designing systems with robust security measures and ensuring adherence to organizational and industry compliance requirements. Preferred Qualifications: Proficiency in modern programming languages such as C#, TypeScript, Go, and Rust. Excellent written and verbal communication via async collaboration, documentation, and visibility of work. Experience working with a remote, distributed team. Passionate about fostering effective Engineering practices and processes. Proficiency in Git and GitHub for version control and collaborative development and branching strategies. Experience with CI/CD Tools: Strong knowledge of CI/CD concepts and best practices. Experience with GitHub actions and workflows platform, familiar with other tools like Jenkins Contribute to open source software, engage with maintainers, and actively participate in community curation.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary. Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","posted_date":"2024-12-20T21:43:00+0000","apply_url":"https://globalcareers-githubinc.icims.com/jobs/3856/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"last_mod":"2025-03-17T20:20:02.423+00:00","icims":{"jps_is_public":true,"date_updated":"2025-03-07T19:41:23Z","primary_posted_site_object":{"site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750","datePosted":"2024-12-20T21:43:00+0000"},"config_keys":null,"revision_int":16,"uuid":"da36c9fc-28b1-48b6-adf5-e38f6b5b0ba3"},"googlejobs":{"jobName":"projects/helpful-passage-853/jobs/116157877483119302","jobTitleSnippet":"","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","searchTextSnippet":"","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"radiusInMiles":0.21074204644792707,"postalAddress":{"regionCode":"DE","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["Germany"],"administrativeArea":"","languageCode":"","revision":0},"locationType":"COUNTRY","latLng":{"latitude":51.165691,"longitude":10.451526}}]},"jobHash":"14a248647a7835589d24bc4a541756f9","jobSummary":"Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary. Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code."},"import_id":"9985a098-25ef-45e5-844d-a979dc8077d8","redirectOnApply":true,"import_source":"ImporterService","canonical_url":"https://githubinc.jibeapply.com/jobs/3856?lang=en-us","client_code":"githubinc","gdpr":true},"update_date":"2025-03-17T20:20:02+0000","create_date":"2025-03-17T20:20:02+0000","category":[" Engineering"],"full_location":"Germany","short_location":"Germany","multipleLocations":false}},{"data":{"slug":"3088","language":"en-us","languages":["en-us"],"req_id":"3088","title":"Staff Software Engineer - Search","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview GitHub is changing the way the world builds software, and we want you to help! We’re looking for a Staff level Software Engineer to join the Code Search team. More of the world’s development data lives on GitHub than anywhere else. Helping developers navigate and understand that data is a core part of GitHub’s mission, and an area with significant potential we’ve only begun to realize. We have high aspirations for how we can help developers understand and navigate code, and for making collaboration more seamless. The foundation for these efforts is our highly scalable code search engine, which we are now expanding to help power semantic/vector search to better support many of GitHub’s AI experiences. In this role, you will have the opportunity to be part of the team that’s reinventing the platform and infrastructure that millions of developers depend on for -- re-thinking everything from the experience to the system architecture supporting it. You will be involved in the design, rollout, and support of a highly performant, highly scalable and highly available search platform with your team. Code search, semantic search and AI are a complex, cutting edge problem space and you will help your senior team navigate uncertainty and make effective implementation tradeoff decisions, relying on careful reasoning and decision making around a significant infrastructure budget. Together we are creating the tools and products that are integral to how people build software. We pride ourselves on being thoughtful, intentional, and productive. We value learning, introspection and reflection, and we’re always looking for ways to improve as a team and as individuals. Responsibilities Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support a highly available service used by millions of users on a daily basis Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Help ensure that individuals on the team are learning, growing and advancing in their respective careers Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you Qualifications Required Qualifications: Several years of proficiency in Rust, C or C++ Several years of proficiency in systems programming, search index internals and information retrieval Experience designing, building, scaling and maintaining large-scale distributed systems Experience designing and implementing data structures and algorithms Preferred Qualifications: Experience effectively contributing to technical strategy and roadmaps Passionate about fostering good engineering practices and processes Solid understanding of testing principles and high quality software Understanding of production system monitoring and observability Troubleshooting skills across network, application, caching, queuing, load-balancing, storage and distributed services layers. Excellent analytical skills as well as communication skills both verbal and written. We’re a distributed team so we’re extra mindful about communication. Strong customer focus and data driven approach GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. Equal Employment Opportunity GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"United Kingdom Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: Several years of proficiency in Rust, C or C++ Several years of proficiency in systems programming, search index internals and information retrieval Experience designing, building, scaling and maintaining large-scale distributed systems Experience designing and implementing data structures and algorithms Preferred Qualifications: Experience effectively contributing to technical strategy and roadmaps Passionate about fostering good engineering practices and processes Solid understanding of testing principles and high quality software Understanding of production system monitoring and observability Troubleshooting skills across network, application, caching, queuing, load-balancing, storage and distributed services layers. Excellent analytical skills as well as communication skills both verbal and written. We’re a distributed team so we’re extra mindful about communication. Strong customer focus and data driven approach","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support a highly available service used by millions of users on a daily basis Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Help ensure that individuals on the team are learning, growing and advancing in their respective careers Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you","posted_date":"2024-07-12T19:06:00+0000","apply_url":"https://globalcareers-githubinc.icims.com/jobs/3088/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"last_mod":"2025-03-17T20:20:02.423+00:00","icims":{"jps_is_public":true,"date_updated":"2025-02-27T18:13:15Z","primary_posted_site_object":{"site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750","datePosted":"2024-07-12T19:06:00+0000"},"config_keys":null,"revision_int":17,"uuid":"75b7c161-9b1f-4da3-a334-741ebef47f8c"},"googlejobs":{"jobName":"projects/helpful-passage-853/jobs/113310142367179462","jobTitleSnippet":"","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","searchTextSnippet":"","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"radiusInMiles":0.5229118491937161,"postalAddress":{"regionCode":"GB","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","revision":0},"locationType":"COUNTRY","latLng":{"latitude":55.378051,"longitude":-3.435973}}]},"jobHash":"af4e2b51fc0ef481f29f80fc1dd324c0","jobSummary":"Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support a highly available service used by millions of users on a daily basis Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Help ensure that individuals on the team are learning, growing and advancing in their respective careers Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you"},"import_id":"9985a098-25ef-45e5-844d-a979dc8077d8","redirectOnApply":true,"import_source":"ImporterService","canonical_url":"https://githubinc.jibeapply.com/jobs/3088?lang=en-us","client_code":"githubinc","gdpr":true},"update_date":"2025-03-17T20:20:02+0000","create_date":"2025-03-17T20:20:02+0000","category":[" Engineering"],"full_location":"United Kingdom","short_location":"United Kingdom","multipleLocations":false}},{"data":{"slug":"3775","language":"en-us","languages":["en-us"],"req_id":"3775","title":"Software Engineer III, Runtime Platform","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is changing the way the world builds software, and we want you to help. At GitHub, we constantly strive to create an environment that allows our employees to do the best work of their lives. GitHub is looking for a talented Software Engineer to join our Platform Team in the Development Experience department. Our team is working on multiple products all aimed to enable GitHub’s engineers to deliver value in a faster and secure way. We work on the entire delivery stack from chatops infra to PR linting and up to the actual deployments of Github’s services both to k8s and vm environments. On this team, you’ll collaborate across functions and across teams to deliver the best possible developer experience for all engineers here at GitHub. In this role, you will be having the opportunity to work as an engineer with a globally distributed, diverse and passionate team where you will be expected to demonstrate independence and a drive to deliver. You will design, implement, rollout and support a highly performant, highly scalable and highly available infrastructure with your team and production managers. This team and its parent Development Experience department are highly distributed across the globe and span a variety of diverse backgrounds. We recognize the value this diversity brings to our teams and our products, so creating and maintaining an environment where every individual feels safe to bring their unique perspective to the challenges we're solving is important to us. Responsibilities Actively design, develop, document and maintain our deployment infrastructure with a product mindset Provide compassionate technical mentorship, pairing opportunities, and code reviews to encourage professional and technical growth of those around you Build tools and systems that empathetically and pragmatically meet real operability needs of GitHub developers Develop and maintain scalable infrastructure Use data to understand the availability, reliability, and sustainability of our infrastructure Work closely with other teams from around the organization Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary Qualifications Required Qualifications: 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field OR equivalent experience. 2+ years experience with running, operating, and maintaining production systems 2+ years experience designing, building and running large scale and highly available cloud services or distributed systems Preferred Qualifications: Solid understanding of testing principles and high quality software Experience with Kubernetes or other container orchestration systems Experience building infrastructure automation Experience working with the Linux operating system Troubleshooting skills across network, caching, queuing, load-balancing storage and distributed services layers Excellent analytical skills and communication skills. Fluent in English both verbal and written. We are a global cross-countries team so we’re extra mindful about communication. Compensation Range The base salary range for this job is USD $97,900.00 - USD $259,900.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field OR equivalent experience. 2+ years experience with running, operating, and maintaining production systems 2+ years experience designing, building and running large scale and highly available cloud services or distributed systems Preferred Qualifications: Solid understanding of testing principles and high quality software Experience with Kubernetes or other container orchestration systems Experience building infrastructure automation Experience working with the Linux operating system Troubleshooting skills across network, caching, queuing, load-balancing storage and distributed services layers Excellent analytical skills and communication skills. Fluent in English both verbal and written. We are a global cross-countries team so we’re extra mindful about communication.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Actively design, develop, document and maintain our deployment infrastructure with a product mindset Provide compassionate technical mentorship, pairing opportunities, and code reviews to encourage professional and technical growth of those around you Build tools and systems that empathetically and pragmatically meet real operability needs of GitHub developers Develop and maintain scalable infrastructure Use data to understand the availability, reliability, and sustainability of our infrastructure Work closely with other teams from around the organization Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary","posted_date":"2025-03-24T15:54:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/3775/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"last_mod":"2025-03-24T15:55:22.455+00:00","icims":{"jps_is_public":true,"date_updated":"2025-03-24T15:55:15Z","primary_posted_site_object":{"site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9","datePosted":"2025-03-24T15:54:00+0000"},"config_keys":null,"revision_int":9,"uuid":"63ff5528-ca3e-4d6d-9efd-3f486d3089a2"},"googlejobs":{"jobName":"projects/helpful-passage-853/jobs/115926555644830406","jobTitleSnippet":"","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","searchTextSnippet":"","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"radiusInMiles":2.6691467883166546,"postalAddress":{"regionCode":"US","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["United States"],"administrativeArea":"","languageCode":"","revision":0},"locationType":"COUNTRY","latLng":{"latitude":38.7945952,"longitude":-106.5348379}}]},"jobHash":"f209d99553fd6962c0e0d77ca6140af4","jobSummary":"Actively design, develop, document and maintain our deployment infrastructure with a product mindset Provide compassionate technical mentorship, pairing opportunities, and code reviews to encourage professional and technical growth of those around you Build tools and systems that empathetically and pragmatically meet real operability needs of GitHub developers Develop and maintain scalable infrastructure Use data to understand the availability, reliability, and sustainability of our infrastructure Work closely with other teams from around the organization Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary"},"import_id":"8991cf67-b758-4540-b45c-f622f172135e","redirectOnApply":true,"import_source":"ImporterService","canonical_url":"https://githubinc.jibeapply.com/jobs/3775?lang=en-us","client_code":"githubinc","gdpr":false},"update_date":"2025-03-24T15:55:22+0000","create_date":"2025-03-24T15:55:22+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"3375","language":"en-us","languages":["en-us"],"req_id":"3375","title":"Senior Engineering Manager","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview We are looking for a Software Engineering Manager to lead the development of foundational components for GitHub products. This role is critical in a fast-paced environment where you can make a high-impact contribution to our product offerings. As a Software Engineering Manager, you'll guide a globally distributed team of engineers, enhancing and scaling our products to deliver an exceptional experience that meets the unique needs of our diverse customer base. A manager working on this team must have a strong balance of people, project, and technical management - flexing their skill sets to empower the team to create innovative solutions. Responsibilities A day in the life: Our team is distributed worldwide which means we work both asynchronously and real-time. Your typical week would include: Collaborating with engineering teams, product management, customers, and engineering leadership to align on and understand the problems we want to solve Unblocking obstacles for your team members as they solve GitHub’s most critical problems, often via real-time conversations in Slack or Zoom and with asynchronous communication in GitHub Issues, PRs, Discussions, and Projects Communicating effectively to stakeholders and leadership of progress and risks Coordinating work within the team and stakeholders, building relationships, and identifying opportunities and areas of improvement Ensuring the team produces good architectural design outcomes, secure and resilient systems, and quality code Ensuring the team iteratively ships features and bug fixes, balancing speed to market with future velocity Conducting 1:1s with direct reports to provide regular feedback and ensure career growth and progression Qualifications Required Qualifications 6+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python o OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field. OR equivalent experience. 1+ year(s) direct and/or indirect people management or leadership experience. Preferred qualifications Excellent written and verbal communication skills Passionate about fostering good engineering practices and processes Experience recruiting and retaining healthy teams, managing performance, and calibrating expectations Experience working remotely and leading distributed teams Compensation Range The base salary range for this job is USD $112,800.00 - USD $299,300.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Senior Manager"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications 6+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python o OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field. OR equivalent experience. 1+ year(s) direct and/or indirect people management or leadership experience. Preferred qualifications Excellent written and verbal communication skills Passionate about fostering good engineering practices and processes Experience recruiting and retaining healthy teams, managing performance, and calibrating expectations Experience working remotely and leading distributed teams","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"A day in the life: Our team is distributed worldwide which means we work both asynchronously and real-time. Your typical week would include: Collaborating with engineering teams, product management, customers, and engineering leadership to align on and understand the problems we want to solve Unblocking obstacles for your team members as they solve GitHub’s most critical problems, often via real-time conversations in Slack or Zoom and with asynchronous communication in GitHub Issues, PRs, Discussions, and Projects Communicating effectively to stakeholders and leadership of progress and risks Coordinating work within the team and stakeholders, building relationships, and identifying opportunities and areas of improvement Ensuring the team produces good architectural design outcomes, secure and resilient systems, and quality code Ensuring the team iteratively ships features and bug fixes, balancing speed to market with future velocity Conducting 1:1s with direct reports to provide regular feedback and ensure career growth and progression","posted_date":"2024-08-26T22:33:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/3375/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"last_mod":"2025-03-19T18:55:32.672+00:00","icims":{"jps_is_public":true,"date_updated":"2025-03-19T18:54:55Z","primary_posted_site_object":{"site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9","datePosted":"2024-08-26T22:33:00+0000"},"config_keys":null,"revision_int":49,"uuid":"38273fc1-2092-408a-a6d4-bb9184d47ce8"},"googlejobs":{"jobName":"projects/helpful-passage-853/jobs/101121557757076166","jobTitleSnippet":"","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","searchTextSnippet":"","derivedInfo":{"jobCategories":["MANAGEMENT","COMPUTER_AND_IT"],"locations":[{"radiusInMiles":2.6691467883166546,"postalAddress":{"regionCode":"US","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["United States"],"administrativeArea":"","languageCode":"","revision":0},"locationType":"COUNTRY","latLng":{"latitude":38.7945952,"longitude":-106.5348379}}]},"jobHash":"a817e46c1549203ccf5fb1f0d1645740","jobSummary":"A day in the life: Our team is distributed worldwide which means we work both asynchronously and real-time. Your typical week would include: Collaborating with engineering teams, product management, customers, and engineering leadership to align on and understand the problems we want to solve Unblocking obstacles for your team members as they solve GitHub’s most critical problems, often via real-time conversations in Slack or Zoom and with asynchronous communication in GitHub Issues, PRs, Discussions, and Projects Communicating effectively to stakeholders and leadership of progress and risks Coordinating work within the team and stakeholders, building relationships, and identifying opportunities and areas of improvement Ensuring the team produces good architectural design outcomes, secure and resilient systems, and quality code Ensuring the team iteratively ships features and bug fixes, balancing speed to market with future velocity Conducting 1:1s with direct reports to provide regular feedback and ensure career growth and progression"},"import_id":"ae5e1bbb-9808-4444-b8c0-b962658c893a","redirectOnApply":true,"import_source":"ImporterService","canonical_url":"https://githubinc.jibeapply.com/jobs/3375?lang=en-us","client_code":"githubinc","gdpr":false},"update_date":"2025-03-19T18:55:32+0000","create_date":"2025-03-17T20:19:53+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}}],"locations":[],"totalCount":15,"request_id":false,"count":15,"languageCounts":{"en-us":{"displayName":"English","count":15}},"filter":{"facetList":{"tags4":[{"term":"Experienced Professional","count":15}],"tags5":[{"term":"Individual Contributor","count":11},{"term":"Senior Manager","count":4}],"tags6":[{"term":"Yes","count":15}]},"displayLimit":10,"brands":{"all":[],"shortlist":[]},"categories":{"all":[{"category":"Engineering","numJobs":15}],"shortlist":[{"category":"Engineering","numJobs":15}]},"locations":{"all":[{"city":null,"state":"Alberta","country":"Canada","count":1},{"city":null,"state":"British Columbia","country":"Canada","count":1},{"city":null,"state":"Ontario","country":"Canada","count":1},{"city":null,"state":null,"country":"Canada","count":1},{"city":null,"state":null,"country":"Germany","count":1},{"city":null,"state":null,"country":"United Kingdom","count":4},{"city":null,"state":null,"country":"United States","count":8}],"shortlist":[{"city":null,"state":"Alberta","country":"Canada","count":1},{"city":null,"state":"British Columbia","country":"Canada","count":1},{"city":null,"state":"Ontario","country":"Canada","count":1},{"city":null,"state":null,"country":"Canada","count":1},{"city":null,"state":null,"country":"Germany","count":1},{"city":null,"state":null,"country":"United Kingdom","count":4},{"city":null,"state":null,"country":"United States","count":8}]},"experienceLevels":{"all":[],"shortlist":[]}}}