{"jobs":[{"data":{"slug":"3505","language":"en-us","languages":["en-us"],"req_id":"3505","title":"Senior Technical Program Manager","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is the developer company and the home of open source. We make it easier for developers to be developers: to work together, to solve challenging problems, and to create the world’s most important technologies. We foster a collaborative community that can come together—as individuals and in teams—to create the future of software and make a difference in the world. The Technical Program Management (TPM) organization is chartered with managing the launch of new GitHub products and offerings that delight our superfans and accelerate the growth of GitHub. Responsibilities The Technical Program Manager partners with the product manager, engineering lead, and other internal stakeholders to develop and manage a comprehensive program plan including schedule, cross - functional dependencies, risk elements, and communicating status/progress and risks to all the program stakeholders, including the GitHub leadership team. The TPM is technically adept and well versed in agile program management to engage with the GitHub engineering team while also has business breadth across go-to-market, marketing, sales, support, legal, finance and other functional areas to deliver an exceptional experience for GitHub’s customers. The TPM has a passion for program management, exceptional leadership skills to be able to mobilize engagement across multiple functions and be able to align all these efforts to deliver a high impact business outcome. In this role, the TPM will be as comfortable offering recommendations across both technical and business domains. The TPM is comfortable making trade-off recommendations that optimize for the overall program success over individual functional success. The TPM is adept at developing processes and tools to help scale the TPM function at GitHub and drive continuous improvements in the practice. This opportunity is well-suited for an experienced TPM who loves enabling teams to solve complex technical and business problems, has the attention to detail to deliver outstanding experiences for our customers and superfans, works collaboratively across a global organization, and thrives in a dynamic, fast-paced, completely distributed organization. The TPM should also be comfortable interacting with senior executives across the program partners articulating status, dependencies and navigating discussions towards impactful decisions. The GitHub Enterprise Adoption program is a multi-TPM program who partners with GitHub Enterprise Engineering, Product, and Design leadership. We lead planning, execution, and launch of enterprise-ready, AI-powered GitHub products for GitHub Enterprise Cloud and GitHub Enterprise Server. A candidate with experience in cross-functional planning and execution for large scale SaaS products and features would feel right at home on our team of TPMs. Qualifications Required Qualifications: 6+ years experience in engineering, product/technical program management, data analysis, or product development OR Bachelor's Degree in Computer Science, Engineering, Data Science, Math, Business, or related field AND 4+ years experience in engineering, product/technical program management, data analysis, or product development OR Master's Degree in Computer Science, Engineering, Data Science, Math, Business, or related field AND 2+ years experience in engineering, product/technical program management, data analysis, or product development OR equivalent experience. 3+ years experience in managing cross-functional and/or cross-team projects. Preferred Qualifications: 6+ years experience in managing cross-functional and/or cross-team projects. 2+ years experience designing, building, or supporting software systems. Comfortable working in a 100% remote and globally distributed team and willing to travel as/when needed in support of program goals Have a flair for software development projects, can quickly absorb new technologies and proven experience in creating clarity in the midst of complexity; experience in understanding the technical architecture and design of a product/ feature(s) Expert level knowledge in agile as well as traditional project management methodologies, with the ability to combine and develop hybrid tools to drive program success Ability to clearly identify and articulate program status, identify complex blockers, and work with a sense of urgency to mitigate unexpected issues, when they arise Demonstrated success in working in a boundaryless manner and delivering results through cross functional, cross organizational collaboration Intellectually curious with a passion for learning and development for yourself and others Compensation Range The base salary range for this job is USD $112,800.00 - USD $299,300.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications: 6+ years experience in engineering, product/technical program management, data analysis, or product development OR Bachelor's Degree in Computer Science, Engineering, Data Science, Math, Business, or related field AND 4+ years experience in engineering, product/technical program management, data analysis, or product development OR Master's Degree in Computer Science, Engineering, Data Science, Math, Business, or related field AND 2+ years experience in engineering, product/technical program management, data analysis, or product development OR equivalent experience. 3+ years experience in managing cross-functional and/or cross-team projects. Preferred Qualifications: 6+ years experience in managing cross-functional and/or cross-team projects. 2+ years experience designing, building, or supporting software systems. Comfortable working in a 100% remote and globally distributed team and willing to travel as/when needed in support of program goals Have a flair for software development projects, can quickly absorb new technologies and proven experience in creating clarity in the midst of complexity; experience in understanding the technical architecture and design of a product/ feature(s) Expert level knowledge in agile as well as traditional project management methodologies, with the ability to combine and develop hybrid tools to drive program success Ability to clearly identify and articulate program status, identify complex blockers, and work with a sense of urgency to mitigate unexpected issues, when they arise Demonstrated success in working in a boundaryless manner and delivering results through cross functional, cross organizational collaboration Intellectually curious with a passion for learning and development for yourself and others","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"The Technical Program Manager partners with the product manager, engineering lead, and other internal stakeholders to develop and manage a comprehensive program plan including schedule, cross - functional dependencies, risk elements, and communicating status/progress and risks to all the program stakeholders, including the GitHub leadership team. The TPM is technically adept and well versed in agile program management to engage with the GitHub engineering team while also has business breadth across go-to-market, marketing, sales, support, legal, finance and other functional areas to deliver an exceptional experience for GitHub’s customers. The TPM has a passion for program management, exceptional leadership skills to be able to mobilize engagement across multiple functions and be able to align all these efforts to deliver a high impact business outcome. In this role, the TPM will be as comfortable offering recommendations across both technical and business domains. The TPM is comfortable making trade-off recommendations that optimize for the overall program success over individual functional success. The TPM is adept at developing processes and tools to help scale the TPM function at GitHub and drive continuous improvements in the practice. This opportunity is well-suited for an experienced TPM who loves enabling teams to solve complex technical and business problems, has the attention to detail to deliver outstanding experiences for our customers and superfans, works collaboratively across a global organization, and thrives in a dynamic, fast-paced, completely distributed organization. The TPM should also be comfortable interacting with senior executives across the program partners articulating status, dependencies and navigating discussions towards impactful decisions. The GitHub Enterprise Adoption program is a multi-TPM program who partners with GitHub Enterprise Engineering, Product, and Design leadership. We lead planning, execution, and launch of enterprise-ready, AI-powered GitHub products for GitHub Enterprise Cloud and GitHub Enterprise Server. A candidate with experience in cross-functional planning and execution for large scale SaaS products and features would feel right at home on our team of TPMs.","posted_date":"September 26, 2024","apply_url":"https://careers-githubinc.icims.com/jobs/3505/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/138785337710125766","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"c6ab0dd5dd19f7ede603d3fee7ed0c9d","derivedInfo":{"jobCategories":["MANAGEMENT","COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"The Technical Program Manager partners with the product manager, engineering lead, and other internal stakeholders to develop and manage a comprehensive program plan including schedule, cross - functional dependencies, risk elements, and communicating status/progress and risks to all the program stakeholders, including the GitHub leadership team. The TPM is technically adept and well versed in agile program management to engage with the GitHub engineering team while also has business breadth across go-to-market, marketing, sales, support, legal, finance and other functional areas to deliver an exceptional experience for GitHub’s customers. The TPM has a passion for program management, exceptional leadership skills to be able to mobilize engagement across multiple functions and be able to align all these efforts to deliver a high impact business outcome. In this role, the TPM will be as comfortable offering recommendations across both technical and business domains. The TPM is comfortable making trade-off recommendations that optimize for the overall program success over individual functional success. The TPM is adept at developing processes and tools to help scale the TPM function at GitHub and drive continuous improvements in the practice. This opportunity is well-suited for an experienced TPM who loves enabling teams to solve complex technical and business problems, has the attention to detail to deliver outstanding experiences for our customers and superfans, works collaboratively across a global organization, and thrives in a dynamic, fast-paced, completely distributed organization. The TPM should also be comfortable interacting with senior executives across the program partners articulating status, dependencies and navigating discussions towards impactful decisions. The GitHub Enterprise Adoption program is a multi-TPM program who partners with GitHub Enterprise Engineering, Product, and Design leadership. We lead planning, execution, and launch of enterprise-ready, AI-powered GitHub products for GitHub Enterprise Cloud and GitHub Enterprise Server. A candidate with experience in cross-functional planning and execution for large scale SaaS products and features would feel right at home on our team of TPMs.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-10-04T13:26:53Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-09-26T19:21:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9"},"revision_int":3,"uuid":"a8622038-5214-4535-8442-d2b1e475f541"},"import_id":"3e776771-47dd-4b34-9ebd-0c214804fa3f","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3505?lang=en-us","last_mod":"2024-10-04T13:26:59+0000","gdpr":false},"update_date":"2024-10-04T13:26:59+0000","create_date":"2024-09-26T19:26:56+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States"}},{"data":{"slug":"3513","language":"en-us","languages":["en-us"],"req_id":"3513","title":"Staff Research Engineer, GitHub Next","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub has changed the way software is built, and we have a unique opportunity to look further ahead to identify how software development can be faster, safer, easier, and more accessible. We’re looking for talented, experienced polymaths to join us in this mission! This is the rare role that affords both startup-level agency and a larger company’s resources. GitHub Next has incubated genre-defining products like Copilot, Copilot Workspace, and more. You’ll work closely with a small group of experienced and talented researchers to explore the future of software development. Our team’s prototypes inform GitHub’s leadership and roadmap. Each exploration represents a risky bet that GitHub might want to make, and we have to support those bets with working prototypes. Please note that this is not an academic research role. Our job is to dream big about the future of software development — and then build it. Our team feels like a permanent startup: every time we succeed, we hand off our prototypes and return to the drawing board to do it all over again. You can see many of our projects at githubnext.com. Responsibilities Research Engineers build prototypes. Sometimes, we have an interesting technological idea but need to figure out how to turn it into a reliable product. Other times, we dream of an experience, but we’re not sure how to make that experience a reality. With few constraints on our solution space, our hardest task is figuring out how to scope our bets and deliver value. We will have more ideas than we can possibly pursue; choosing wisely is part of the job. The exploration domains are varied and will require an ability to understand, investigate, and implement prototypes across a wide range of technologies. Our team has a lot of different skills under one roof, and we work together in squads to identify and debate ideas, then execute everything needed for a working prototype. For this role, we are seeking an individual with exceptional frontend and design skills. Next’s prototypes grapple with difficult UX challenges in domains with little prior art to guide us. You may be a good fit if: You are a generalist with some areas of deeper knowledge. Hybrids will feel at home on this team. We will also consider candidates who have specialized in a relevant field. You are an effective and inclusive communicator, comfortable with remote communication practices. Next’s currency is ideas; the health of our team, our execution, and our results rests on our ability to communicate well. You are comfortable collaborating with teammates to figure out what work needs doing, then splitting up that work and doing it. Ideating alone is natural and common, but projects staffed by one individual don’t tend to survive. Your teammates are the first ones you must persuade with your ideas. You are comfortable reading source code. You are comfortable picking up new technology stacks in the normal course of work. This is a senior engineering role! While we do have some technologies that we generally like to use, we are not indexing on a specific stack. Experience is more than your ability to write code in language X or framework Y. Qualifications Required Qualifications: 9+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 8+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science or related field AND 7+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR equivalent experience. Experience creating rapid prototypes that demonstrate a concept to stakeholders and enable decision making Experience identifying and justifying research goals in situations of ambiguity and executing towards those goals without explicit direction Preferred Qualifications: These are more specific abilities we’re looking for, but it is the rare human who possesses them all. Think of this as a descriptive sketch, not a checklist of requirements. Be comfortable applying even if you don’t have all of them. A deep understanding of GitHub’s industry and business context and the ability to articulate topics related to our product and audience Has held roles that deal with topics at the boundary of human knowledge regarding software development and developers Have significant experience with one or more frontend technologies. We currently default to Typescript and React for the web, but we also have some efforts underway with Svelte and SvelteKit. “Whatever enables us to ship” is the top concern Have significant experience with machine learning, LLMs, and the rapidly-evolving landscape of techniques and tools used to build intelligence into products Have significant experience with one or more backend technologies: server-side environments, compute, datastores, networking, infrastructure, devops, security, and programming languages Have significant experience with open-source software, communities, and the systems these communities use to self-organize and ship software for others Have significant experience operating production systems at a nontrivial scale and are familiar with the common patterns and pitfalls of that work Have significant experience in another area of computing that is relevant to our mission. Human-computer interaction, distributed systems, $YOURTHING Compensation Range The base salary range for this job is USD $118,100.00 - USD $313,300.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 9+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 8+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science or related field AND 7+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR equivalent experience. Experience creating rapid prototypes that demonstrate a concept to stakeholders and enable decision making Experience identifying and justifying research goals in situations of ambiguity and executing towards those goals without explicit direction Preferred Qualifications: These are more specific abilities we’re looking for, but it is the rare human who possesses them all. Think of this as a descriptive sketch, not a checklist of requirements. Be comfortable applying even if you don’t have all of them. A deep understanding of GitHub’s industry and business context and the ability to articulate topics related to our product and audience Has held roles that deal with topics at the boundary of human knowledge regarding software development and developers Have significant experience with one or more frontend technologies. We currently default to Typescript and React for the web, but we also have some efforts underway with Svelte and SvelteKit. “Whatever enables us to ship” is the top concern Have significant experience with machine learning, LLMs, and the rapidly-evolving landscape of techniques and tools used to build intelligence into products Have significant experience with one or more backend technologies: server-side environments, compute, datastores, networking, infrastructure, devops, security, and programming languages Have significant experience with open-source software, communities, and the systems these communities use to self-organize and ship software for others Have significant experience operating production systems at a nontrivial scale and are familiar with the common patterns and pitfalls of that work Have significant experience in another area of computing that is relevant to our mission. Human-computer interaction, distributed systems, $YOURTHING","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Research Engineers build prototypes. Sometimes, we have an interesting technological idea but need to figure out how to turn it into a reliable product. Other times, we dream of an experience, but we’re not sure how to make that experience a reality. With few constraints on our solution space, our hardest task is figuring out how to scope our bets and deliver value. We will have more ideas than we can possibly pursue; choosing wisely is part of the job. The exploration domains are varied and will require an ability to understand, investigate, and implement prototypes across a wide range of technologies. Our team has a lot of different skills under one roof, and we work together in squads to identify and debate ideas, then execute everything needed for a working prototype. For this role, we are seeking an individual with exceptional frontend and design skills. Next’s prototypes grapple with difficult UX challenges in domains with little prior art to guide us. You may be a good fit if: You are a generalist with some areas of deeper knowledge. Hybrids will feel at home on this team. We will also consider candidates who have specialized in a relevant field. You are an effective and inclusive communicator, comfortable with remote communication practices. Next’s currency is ideas; the health of our team, our execution, and our results rests on our ability to communicate well. You are comfortable collaborating with teammates to figure out what work needs doing, then splitting up that work and doing it. Ideating alone is natural and common, but projects staffed by one individual don’t tend to survive. Your teammates are the first ones you must persuade with your ideas. You are comfortable reading source code. You are comfortable picking up new technology stacks in the normal course of work. This is a senior engineering role! While we do have some technologies that we generally like to use, we are not indexing on a specific stack. Experience is more than your ability to write code in language X or framework Y.","posted_date":"September 27, 2024","apply_url":"https://careers-githubinc.icims.com/jobs/3513/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/142007571425698502","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"1dce86e2c6461c5848846aee2a87452b","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"Research Engineers build prototypes. Sometimes, we have an interesting technological idea but need to figure out how to turn it into a reliable product. Other times, we dream of an experience, but we’re not sure how to make that experience a reality. With few constraints on our solution space, our hardest task is figuring out how to scope our bets and deliver value. We will have more ideas than we can possibly pursue; choosing wisely is part of the job. The exploration domains are varied and will require an ability to understand, investigate, and implement prototypes across a wide range of technologies. Our team has a lot of different skills under one roof, and we work together in squads to identify and debate ideas, then execute everything needed for a working prototype. For this role, we are seeking an individual with exceptional frontend and design skills. Next’s prototypes grapple with difficult UX challenges in domains with little prior art to guide us. You may be a good fit if: You are a generalist with some areas of deeper knowledge. Hybrids will feel at home on this team. We will also consider candidates who have specialized in a relevant field. You are an effective and inclusive communicator, comfortable with remote communication practices. Next’s currency is ideas; the health of our team, our execution, and our results rests on our ability to communicate well. You are comfortable collaborating with teammates to figure out what work needs doing, then splitting up that work and doing it. Ideating alone is natural and common, but projects staffed by one individual don’t tend to survive. Your teammates are the first ones you must persuade with your ideas. You are comfortable reading source code. You are comfortable picking up new technology stacks in the normal course of work. This is a senior engineering role! While we do have some technologies that we generally like to use, we are not indexing on a specific stack. Experience is more than your ability to write code in language X or framework Y.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-09-30T17:25:02Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-09-27T21:14:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9"},"revision_int":5,"uuid":"6cb1a55f-cb25-4320-86bb-26632f0a5afe"},"import_id":"32dadbfd-a107-4c11-8577-df7ca9b913d1","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3513?lang=en-us","last_mod":"2024-09-30T17:25:57+0000","gdpr":false},"update_date":"2024-09-30T17:25:57+0000","create_date":"2024-09-27T21:21:31+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States"}},{"data":{"slug":"3496","language":"en-us","languages":["en-us"],"req_id":"3496","title":"Software Engineer III","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. The team is responsible for Blackbird, GitHub’s powerful, blazingly fast code search engine, used by millions of software developers around the world. We are looking for a Software Engineer III with a background in Site Reliability Engineering (SRE) to contribute to developing and enhancing our platform to ensure its stability, scalability, and performance. The ideal candidate will have strong operational and troubleshooting skills with experience in incident management. Stack: GitHub is built on various technologies, including cloud platforms, Kubernetes, Docker, and CI/CD pipelines. The Team works primarily in the Rust and Go programming languages. We utilize observability and alerting tools such as Splunk, DataDog, and PagerDuty. Responsibilities Maintain and improve automation tooling for deployment, configuration management, and system maintenance. Implement and enhance monitoring, logging, and alerting solutions to maintain system health and performance. Help with incident response efforts, performing root cause analysis and implementing measures to prevent future incidents. Collaborate with the team to address scalability issues, optimize system performance, and improve reliability. Participate in on-call rotations with the team to support system availability and performance, providing off-hours support when needed. Document systems, processes, and runbooks for efficient troubleshooting and knowledge sharing. Conduct post-mortem analyses to drive continuous improvement in our systems and processes. Qualifications Required Qualifications: 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field OR equivalent experience. Experience in site reliability engineering principles, including monitoring, alerting, and automation. 1+ year(s) experience with cloud infrastructure, containerization, and CI/CD pipelines. Preferred Qualifications: Experience in working with a remote, distributed team. Experience with the Rust and Go programming language ecosystems. Familiarity with emerging AI concepts (e.g., LLMs, embeddings) and related challenges. Familiarity with observability tools and incident response platforms. Knowledge of open-source software and experience contributing to open-source projects. Compensation Range The base salary range for this job is USD $97,900.00 - USD $259,900.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications: 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field OR equivalent experience. Experience in site reliability engineering principles, including monitoring, alerting, and automation. 1+ year(s) experience with cloud infrastructure, containerization, and CI/CD pipelines. Preferred Qualifications: Experience in working with a remote, distributed team. Experience with the Rust and Go programming language ecosystems. Familiarity with emerging AI concepts (e.g., LLMs, embeddings) and related challenges. Familiarity with observability tools and incident response platforms. Knowledge of open-source software and experience contributing to open-source projects.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Maintain and improve automation tooling for deployment, configuration management, and system maintenance. Implement and enhance monitoring, logging, and alerting solutions to maintain system health and performance. Help with incident response efforts, performing root cause analysis and implementing measures to prevent future incidents. Collaborate with the team to address scalability issues, optimize system performance, and improve reliability. Participate in on-call rotations with the team to support system availability and performance, providing off-hours support when needed. Document systems, processes, and runbooks for efficient troubleshooting and knowledge sharing. Conduct post-mortem analyses to drive continuous improvement in our systems and processes.","posted_date":"September 25, 2024","apply_url":"https://careers-githubinc.icims.com/jobs/3496/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/104598252732457670","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"ece5ff004f868f7bb0b2b34bf40d2348","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"Maintain and improve automation tooling for deployment, configuration management, and system maintenance. Implement and enhance monitoring, logging, and alerting solutions to maintain system health and performance. Help with incident response efforts, performing root cause analysis and implementing measures to prevent future incidents. Collaborate with the team to address scalability issues, optimize system performance, and improve reliability. Participate in on-call rotations with the team to support system availability and performance, providing off-hours support when needed. Document systems, processes, and runbooks for efficient troubleshooting and knowledge sharing. Conduct post-mortem analyses to drive continuous improvement in our systems and processes.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-10-01T13:13:16Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-09-25T14:22:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9"},"revision_int":4,"uuid":"a0835bf7-42e2-4bf4-bc4c-40039da9983b"},"import_id":"76016a44-9a60-4c88-9e34-6c487396c2c1","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3496?lang=en-us","last_mod":"2024-10-01T13:13:56+0000","gdpr":false},"update_date":"2024-10-01T13:13:56+0000","create_date":"2024-09-25T14:28:56+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States"}},{"data":{"slug":"3088","language":"en-us","languages":["en-us"],"req_id":"3088","title":"Staff Software Engineer - Search","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview GitHub is changing the way the world builds software, and we want you to help! We’re looking for a Staff level Software Engineer to join the Code Search team. More of the world’s development data lives on GitHub than anywhere else. Helping developers navigate and understand that data is a core part of GitHub’s mission, and an area with significant potential we’ve only begun to realize. We have high aspirations for how we can help developers understand and navigate code, and for making collaboration more seamless. The foundation for these efforts is our highly scalable code search engine, which we are now expanding to help power semantic/vector search to better support many of GitHub’s AI experiences. In this role, you will have the opportunity to be part of the team that’s reinventing the platform and infrastructure that millions of developers depend on for -- re-thinking everything from the experience to the system architecture supporting it. You will be involved in the design, rollout, and support of a highly performant, highly scalable and highly available search platform with your team. Code search, semantic search and AI are a complex, cutting edge problem space and you will help your senior team navigate uncertainty and make effective implementation tradeoff decisions, relying on careful reasoning and decision making around a significant infrastructure budget. Together we are creating the tools and products that are integral to how people build software. We pride ourselves on being thoughtful, intentional, and productive. We value learning, introspection and reflection, and we’re always looking for ways to improve as a team and as individuals. Responsibilities Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support a highly available service used by millions of users on a daily basis Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Help ensure that individuals on the team are learning, growing and advancing in their respective careers Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you Qualifications Required Qualifications: Several years of proficiency in Rust, C or C++ Several years of proficiency in systems programming, search index internals and information retrieval Experience designing, building, scaling and maintaining large-scale distributed systems Experience designing and implementing data structures and algorithms Preferred Qualifications: Experience effectively contributing to technical strategy and roadmaps Passionate about fostering good engineering practices and processes Solid understanding of testing principles and high quality software Understanding of production system monitoring and observability Troubleshooting skills across network, application, caching, queuing, load-balancing, storage and distributed services layers. Excellent analytical skills as well as communication skills both verbal and written. We’re a distributed team so we’re extra mindful about communication. Strong customer focus and data driven approach GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"United Kingdom Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: Several years of proficiency in Rust, C or C++ Several years of proficiency in systems programming, search index internals and information retrieval Experience designing, building, scaling and maintaining large-scale distributed systems Experience designing and implementing data structures and algorithms Preferred Qualifications: Experience effectively contributing to technical strategy and roadmaps Passionate about fostering good engineering practices and processes Solid understanding of testing principles and high quality software Understanding of production system monitoring and observability Troubleshooting skills across network, application, caching, queuing, load-balancing, storage and distributed services layers. Excellent analytical skills as well as communication skills both verbal and written. We’re a distributed team so we’re extra mindful about communication. Strong customer focus and data driven approach","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support a highly available service used by millions of users on a daily basis Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Help ensure that individuals on the team are learning, growing and advancing in their respective careers Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you","posted_date":"July 12, 2024","apply_url":"https://globalcareers-githubinc.icims.com/jobs/3088/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/96523746461786822","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"47f18799785678fd84192fac5c1b50fa","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support a highly available service used by millions of users on a daily basis Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Help ensure that individuals on the team are learning, growing and advancing in their respective careers Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-08-28T21:04:05Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-07-12T19:06:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":3,"uuid":"75b7c161-9b1f-4da3-a334-741ebef47f8c"},"import_id":"93f3915a-edba-4411-a269-a9b76d2c5f15","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3088?lang=en-us","last_mod":"2024-08-28T21:04:15+0000","gdpr":true},"update_date":"2024-08-28T21:04:15+0000","create_date":"2024-07-12T19:11:56+0000","category":[" Engineering"],"full_location":"United Kingdom","short_location":"United Kingdom"}},{"data":{"slug":"3262","language":"en-us","languages":["en-us"],"req_id":"3262","title":"Software Engineer III","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview GitHub Copilot is changing the way the world builds software, and we want you to help build Copilot! We’re looking for a Software Engineer III to join the team building Copilot chat in GitHub.com. As a Software Engineer III on the Copilot Core Productivity team, you will work closely with a distributed, diverse, and passionate team of engineers, product managers, and designers across multiple teams at GitHub to build and improve Copilot capabilities across GitHub.com. Responsibilities Responsibilities: Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support a highly available service used by millions of users on a daily basis Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you Qualifications Minimum Qualifications: Experience designing, building, scaling and maintaining distributed systems Experience effectively contributing to technical strategy and roadmaps Solid understanding of testing principles and high quality software Understanding of production system monitoring and observability Bachelor's degree or equivalent experience Preferred Qualifications: Experience with Go and related tooling Experience with distributed systems at global scale Experience working with a remote, distributed team Interest or prior experience in modern AI/machine learning technologies, Large Language Models or similar Passionate about fostering good engineering practices and processes Strong customer focus and data driven approach Excellent analytical skills as well as communication skills both verbal and written. We’re a distributed team so we’re extra mindful about communication. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"United Kingdom Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Minimum Qualifications: Experience designing, building, scaling and maintaining distributed systems Experience effectively contributing to technical strategy and roadmaps Solid understanding of testing principles and high quality software Understanding of production system monitoring and observability Bachelor's degree or equivalent experience Preferred Qualifications: Experience with Go and related tooling Experience with distributed systems at global scale Experience working with a remote, distributed team Interest or prior experience in modern AI/machine learning technologies, Large Language Models or similar Passionate about fostering good engineering practices and processes Strong customer focus and data driven approach Excellent analytical skills as well as communication skills both verbal and written. We’re a distributed team so we’re extra mindful about communication.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Responsibilities: Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support a highly available service used by millions of users on a daily basis Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you","posted_date":"September 25, 2024","apply_url":"https://globalcareers-githubinc.icims.com/jobs/3262/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/118869638783083206","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"7b0f38e368452205884e324542d51f21","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"Responsibilities: Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support a highly available service used by millions of users on a daily basis Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-10-11T14:24:51Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-09-25T14:23:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":3,"uuid":"bd0cdc66-3086-4ca0-ac99-228e118d1044"},"import_id":"89c8ef2d-a274-45d8-b564-19df9708991c","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3262?lang=en-us","last_mod":"2024-10-11T14:25:08+0000","gdpr":true},"update_date":"2024-10-11T14:25:08+0000","create_date":"2024-09-25T14:35:57+0000","category":[" Engineering"],"full_location":"United Kingdom","short_location":"United Kingdom"}},{"data":{"slug":"3543","language":"en-us","languages":["en-us"],"req_id":"3543","title":"Staff Technical Program Manager","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is the developer company and the home of open source. We make it easier for developers to be developers: to work together, to solve challenging problems, and to create the world’s most important technologies. We foster a collaborative community that can come together—as individuals and in teams—to create the future of software and make a difference in the world. The Technical Program Management (TPM) organization is chartered with managing the launch of new GitHub products and offerings that delight our superfans and accelerate the growth of GitHub. Responsibilities The Technical Program Manager partners with the product manager, engineering lead, and other internal stakeholders to develop and manage a comprehensive program plan including schedule, cross - functional dependencies, risk elements, and communicating status/progress and risks to all the program stakeholders, including the GitHub leadership team. The TPM is technically adept and well versed in agile project management to engage with the GitHub engineering team while also has business breadth across go-to-market, marketing, sales, support, legal, finance and other functional areas to deliver an exceptional experience for GitHub’s customers. The TPM has a passion for program management, exceptional leadership skills to be able to mobilize engagement across multiple functions and be able to align all these efforts to deliver a high impact business outcome. In this role, the TPM will be as comfortable offering recommendations across both technical and business domains. The TPM is comfortable making trade-off recommendations that optimize for the overall program success over individual functional success. The TPM is adept at developing processes and tools to help scale the TPM function at GitHub and drive continuous improvements in the practice. This opportunity is well-suited for an experienced TPM who loves enabling teams to solve complex technical and business problems, has the attention to detail to deliver outstanding experiences for our customers and superfans, works collaboratively across a global organization, and thrives in a dynamic, fast-paced, completely distributed organization. The TPM should also be comfortable interacting with senior executives across the program partners articulating status, dependencies and navigating discussions towards impactful decisions. Qualifications Required Qualifications 8+ years experience in engineering, product/technical program management, data analysis, or product development OR Bachelor's Degree in Computer Science, Engineering, Data Science, Math, Business, or related field AND 6+ years experience in engineering, product/technical program management, data analysis, or product development OR Master's Degree in Computer Science, Engineering, Data Science, Math, Business, or related field AND 4+ years experience in engineering, product/technical program management, data analysis, or product development OR equivalent experience. 5+ years experience in managing cross-functional and/or cross-team projects. Preferred Qualifications 12+ years experience in engineering, product/technical program management, data analysis, or product development OR Bachelor's Degree in Computer Science, Engineering, Data Science, Math, Business, or related field AND 10+ years experience in engineering, product/technical program management, data analysis, or product development OR Master's Degree in Computer Science, Engineering, Data Science, Math, Business, or related field AND 8+ years experience in engineering, product/technical program management, data analysis, or product development OR Doctorate in Computer Science, Engineering, Data Science, Math, Business, or related field AND 6+ years experience in engineering, product/technical program management, data analysis, or product development OR equivalent experience. 8+ years experience in managing cross-functional and/or cross-team projects. 4+ years experience designing, building, or supporting software systems. Compensation Range The base salary range for this job is USD $127,600.00 - USD $338,500.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications 8+ years experience in engineering, product/technical program management, data analysis, or product development OR Bachelor's Degree in Computer Science, Engineering, Data Science, Math, Business, or related field AND 6+ years experience in engineering, product/technical program management, data analysis, or product development OR Master's Degree in Computer Science, Engineering, Data Science, Math, Business, or related field AND 4+ years experience in engineering, product/technical program management, data analysis, or product development OR equivalent experience. 5+ years experience in managing cross-functional and/or cross-team projects. Preferred Qualifications 12+ years experience in engineering, product/technical program management, data analysis, or product development OR Bachelor's Degree in Computer Science, Engineering, Data Science, Math, Business, or related field AND 10+ years experience in engineering, product/technical program management, data analysis, or product development OR Master's Degree in Computer Science, Engineering, Data Science, Math, Business, or related field AND 8+ years experience in engineering, product/technical program management, data analysis, or product development OR Doctorate in Computer Science, Engineering, Data Science, Math, Business, or related field AND 6+ years experience in engineering, product/technical program management, data analysis, or product development OR equivalent experience. 8+ years experience in managing cross-functional and/or cross-team projects. 4+ years experience designing, building, or supporting software systems.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"The Technical Program Manager partners with the product manager, engineering lead, and other internal stakeholders to develop and manage a comprehensive program plan including schedule, cross - functional dependencies, risk elements, and communicating status/progress and risks to all the program stakeholders, including the GitHub leadership team. The TPM is technically adept and well versed in agile project management to engage with the GitHub engineering team while also has business breadth across go-to-market, marketing, sales, support, legal, finance and other functional areas to deliver an exceptional experience for GitHub’s customers. The TPM has a passion for program management, exceptional leadership skills to be able to mobilize engagement across multiple functions and be able to align all these efforts to deliver a high impact business outcome. In this role, the TPM will be as comfortable offering recommendations across both technical and business domains. The TPM is comfortable making trade-off recommendations that optimize for the overall program success over individual functional success. The TPM is adept at developing processes and tools to help scale the TPM function at GitHub and drive continuous improvements in the practice. This opportunity is well-suited for an experienced TPM who loves enabling teams to solve complex technical and business problems, has the attention to detail to deliver outstanding experiences for our customers and superfans, works collaboratively across a global organization, and thrives in a dynamic, fast-paced, completely distributed organization. The TPM should also be comfortable interacting with senior executives across the program partners articulating status, dependencies and navigating discussions towards impactful decisions.","posted_date":"October 10, 2024","apply_url":"https://careers-githubinc.icims.com/jobs/3543/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-10-10T13:40:55Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-10-10T13:35:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9"},"revision_int":1,"uuid":"b9291eef-b94d-4d9c-aba4-1d21f1fcd422"},"import_id":"d4e89f75-384f-413a-838e-8912be048e2f","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/jobs/90917606684271302","jobHash":"2191a29f74451f7eaec18013e89e04d2","derivedInfo":{"jobCategories":["MANAGEMENT","COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"The Technical Program Manager partners with the product manager, engineering lead, and other internal stakeholders to develop and manage a comprehensive program plan including schedule, cross - functional dependencies, risk elements, and communicating status/progress and risks to all the program stakeholders, including the GitHub leadership team. The TPM is technically adept and well versed in agile project management to engage with the GitHub engineering team while also has business breadth across go-to-market, marketing, sales, support, legal, finance and other functional areas to deliver an exceptional experience for GitHub’s customers. The TPM has a passion for program management, exceptional leadership skills to be able to mobilize engagement across multiple functions and be able to align all these efforts to deliver a high impact business outcome. In this role, the TPM will be as comfortable offering recommendations across both technical and business domains. The TPM is comfortable making trade-off recommendations that optimize for the overall program success over individual functional success. The TPM is adept at developing processes and tools to help scale the TPM function at GitHub and drive continuous improvements in the practice. This opportunity is well-suited for an experienced TPM who loves enabling teams to solve complex technical and business problems, has the attention to detail to deliver outstanding experiences for our customers and superfans, works collaboratively across a global organization, and thrives in a dynamic, fast-paced, completely distributed organization. The TPM should also be comfortable interacting with senior executives across the program partners articulating status, dependencies and navigating discussions towards impactful decisions.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/3543?lang=en-us","last_mod":"2024-10-10T13:41:08+0000","gdpr":false},"create_date":"2024-10-10T13:41:08+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States"}},{"data":{"slug":"2954","language":"en-us","languages":["en-us"],"req_id":"2954","title":"Staff Engineering Manager-Network","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is seeking a Staff Software Engineering Manager to join our Infrastructure organization. GitHub is a company at the center of software, where projects are developed, orchestrated, and deployed. GitHub infrastructure is critical to our customers in the way the power grid is critical to the manufacturing industry. Our customers depend on GitHub as a central workspace where they develop solutions for their own customers. The reward for this important role is a unique impact on creativity within the software development universe. With it comes the responsibility to view ourselves as the world’s production environment. One that needs to be as reliable as the power grid. This role leads a distributed team of engineers and is involved in the design, rollout and support of highly performant, highly scalable, and highly available network services and infrastructure across GitHub datacenters and cloud providers. Our group is highly distributed and the right candidate will thrive in an environment of asynchronous communication. We expect you to have excellent written communication skills and be able to create working relationships with coworkers in locations around the globe. Responsibilities Drive network infrastructure management, automation, and efficiency Guide the team’s vision, best practices, and priorities Provide clarity of decision making, direction, and progress for the team and the company Cultivate an environment of empowerment, ownership, and belonging Provide career development plans and performance feedback Review code, review design docs, and lead discussions about technical problems Drive incident response, blameless postmortems, and continuous improvement Coordinate complex technical project work with engineering teams across the stack Qualifications Required Qualifications: 8+ years of professional technical experience 4+ Years Experience supporting global network infrastructure within a data center environment 4+ years of managing engineering teams Bachelor’s Degree or equivalent experience Preferred Qualifications: Passionate about network engineering, automation and highly available infrastructure Energized by creating and growing exceptional engineering practices and processes Excellent analytical skills to proactively identify opportunities \u0026 risks and balance priorities Pragmatic focus on delivering incremental, continuous value toward long running objectives Strong written, verbal, and asynchronous communication skills Consistent focus on customer needs and data driven decision making Compensation Range The base salary range for this job is USD $127,600.00 - USD $338,500.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Director"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 8+ years of professional technical experience 4+ Years Experience supporting global network infrastructure within a data center environment 4+ years of managing engineering teams Bachelor’s Degree or equivalent experience Preferred Qualifications: Passionate about network engineering, automation and highly available infrastructure Energized by creating and growing exceptional engineering practices and processes Excellent analytical skills to proactively identify opportunities \u0026 risks and balance priorities Pragmatic focus on delivering incremental, continuous value toward long running objectives Strong written, verbal, and asynchronous communication skills Consistent focus on customer needs and data driven decision making","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Drive network infrastructure management, automation, and efficiency Guide the team’s vision, best practices, and priorities Provide clarity of decision making, direction, and progress for the team and the company Cultivate an environment of empowerment, ownership, and belonging Provide career development plans and performance feedback Review code, review design docs, and lead discussions about technical problems Drive incident response, blameless postmortems, and continuous improvement Coordinate complex technical project work with engineering teams across the stack","posted_date":"May 22, 2024","apply_url":"https://careers-githubinc.icims.com/jobs/2954/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/124062028187738822","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"9a3efacf5328279841bd684a823f4c83","derivedInfo":{"jobCategories":["COMPUTER_AND_IT","MANAGEMENT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"Drive network infrastructure management, automation, and efficiency Guide the team’s vision, best practices, and priorities Provide clarity of decision making, direction, and progress for the team and the company Cultivate an environment of empowerment, ownership, and belonging Provide career development plans and performance feedback Review code, review design docs, and lead discussions about technical problems Drive incident response, blameless postmortems, and continuous improvement Coordinate complex technical project work with engineering teams across the stack","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-10-01T21:40:58Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-05-22T20:54:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9"},"revision_int":9,"uuid":"40109d80-089a-4ea1-9a34-d1930864c8ac"},"import_id":"739c94c4-3163-4445-9ef3-65dd3b804366","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/2954?lang=en-us","last_mod":"2024-10-01T21:41:57+0000","gdpr":false},"update_date":"2024-10-01T21:41:57+0000","create_date":"2024-05-22T20:55:04+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States"}},{"data":{"slug":"3244","language":"en-us","languages":["en-us"],"req_id":"3244","title":"Software Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview As a software engineer at GitHub, you will enhance the collaboration experience at GitHub by working closely with a community of engineers and designers with a distributed, diverse and passionate team delivering the services that millions of developers depend on. In this role you will design, prototype, implement, ship and support highly performant and inspiring user experiences with your team. We are looking for creative problem solvers and diverse thinkers, people who care about culture as well as customers and features. We believe that how we do things is as important as what we do. Big vision, a common purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what lead to great results. Great products reflect the teams that build them. Responsibilities Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Receive technical mentorship, collaborate and pair with others, provide code reviews, and communicate clearly to your leadership about progress, blockers, and gaps. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code. Qualifications Required Qualifications Experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, or related field OR equivalent experience. Preferred Qualifications Experience with Git and GitHub Experience using Azure technologies is a bonus Experience using front-end frameworks like React.js Understanding of REST principles and experience with backend APIs Strong written and verbal communication skill Passionate about healthy team culture and collaboration Comfortable working transparently in an agile environment and soliciting feedback from peers. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"United Kingdom Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications Experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, or related field OR equivalent experience. Preferred Qualifications Experience with Git and GitHub Experience using Azure technologies is a bonus Experience using front-end frameworks like React.js Understanding of REST principles and experience with backend APIs Strong written and verbal communication skill Passionate about healthy team culture and collaboration Comfortable working transparently in an agile environment and soliciting feedback from peers.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Receive technical mentorship, collaborate and pair with others, provide code reviews, and communicate clearly to your leadership about progress, blockers, and gaps. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","posted_date":"August 7, 2024","apply_url":"https://globalcareers-githubinc.icims.com/jobs/3244/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/86162782910587590","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"01b313d799218696d8735893862afdad","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Receive technical mentorship, collaborate and pair with others, provide code reviews, and communicate clearly to your leadership about progress, blockers, and gaps. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-10-01T16:51:53Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-08-07T21:15:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":32,"uuid":"de65e6d3-f918-423c-bcf8-f72761bd6815"},"import_id":"9198eda6-05cd-4b91-be10-94aff09b326c","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3244?lang=en-us","last_mod":"2024-10-01T16:51:56+0000","gdpr":true},"update_date":"2024-10-01T16:51:56+0000","create_date":"2024-08-07T21:21:00+0000","category":[" Engineering"],"full_location":"United Kingdom","short_location":"United Kingdom"}},{"data":{"slug":"3372","language":"en-us","languages":["en-us"],"req_id":"3372","title":"Staff Networking Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview We’re looking for a Staff Network Engineer to join GitHub’s Network Engineering team. Our mission is to design, build, maintain, and scale GitHub’s peering, transport, exchange, and data center network infrastructure in a multi-site, on-premises data center environment, while also supporting our hybrid cloud efforts. As GitHub grows, our network engineers must work cross-functionally to support our ever-expanding compute footprint and rapid user growth. This critical infrastructure supports all GitHub products, teams, and users, making your role pivotal in ensuring its ongoing scalability and reliability. In this role, you will be responsible for providing technical leadership within our network engineering team and driving capabilities that serve our unique and complex platform. You will lead the team in building and enhancing the architecture, configuration, and software frameworks and tools that are used to manage and maintain our network infrastructure. You will assess capacity needs, predict growth trends, and plan for scalability. You will also handle internal/external support within your area of responsibility, drive network security and compliance, and lead efforts to monitor infrastructure proactively to identify and address potential issues. Furthermore, you will drive optimization efforts and lead initiatives aimed at enhancing system performance, reliability, and scalability. You must maintain advanced knowledge of the latest technologies and best practices in network engineering and be adept at diagnosing common and uncommon errors to develop or direct solutions. You will collaborate with software engineers and other infrastructure teams to troubleshoot issues and optimize network performance. Responsibilities Network Development and Management Lead the team in designing, building, maintaining, and scaling components of a large-scale, multi-site, heavily peered network. Assess network capacity needs, predict growth trends, and plan for scalability. Ensure sufficient resources are allocated, and that network equipment and services are properly scaled to handle increasing demands. Expand network platform offerings to meet business and developer needs. Availability and Performance Handle internal/external support for network engineering escalations. Participate in a 24x7 on-call rotation, respond to incidents, and collaborate with other teams to resolve reliability issues. Lead efforts to monitor infrastructure proactively to identify and address issues, including through instructional playbooks. Research and understand performance gaps or outages, using this knowledge to resolve issues. Identify and execute disaster recovery/failure test scenarios. Fundamentals Drive the security and compliance of the infrastructure. Collaborate with security teams to implement and maintain robust security measures, conduct vulnerability assessments, and adhere to relevant regulatory standards. Ensure timely upgrades to software and firmware used for infrastructure operation, as well as to software components in our management and automation toolchains. Drive incident management processes, provide incident reports, identify root causes, and implement preventive measures to avoid future incidents. Behavior Embody our values: better together, growth mindset, ship to learn, customer-obsessed, diverse \u0026 inclusive, and own the outcome. Embody our principles: create clarity, generate energy, and deliver success. Qualifications Required Qualifications: 9+ years of technical experience in network engineering, including architecture, network design, and product selection/hardware specifications. OR Bachelor's Degree in Computer Science, Information Technology, or a related field AND 7+ years of technical experience in network engineering OR equivalent experience 2+ years of technical leadership experience (Staff, Principal, or equivalent level) 2+ years of scripting experience in mainstream languages (Python, Bash, etc.) or frameworks (Ansible, Chef, Puppet, etc.) Preferred Qualifications: 4+ years of experience in one or more scripting languages (e.g., Bash, Python, or similar). 4+ years of experience using general-purpose programming languages (e.g., Go, Ruby, or similar). 5+ years of experience managing compute hardware in the context of datacenter deployments. 5+ years of experience with compute platforms and frameworks (Kubernetes, Virtualization platforms like VMware, libvirt/KVM), including service mesh and service discovery technologies (Istio, Consul, etc.). Compensation Range The base salary range for this job is USD $127,600.00 - USD $338,500.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 9+ years of technical experience in network engineering, including architecture, network design, and product selection/hardware specifications. OR Bachelor's Degree in Computer Science, Information Technology, or a related field AND 7+ years of technical experience in network engineering OR equivalent experience 2+ years of technical leadership experience (Staff, Principal, or equivalent level) 2+ years of scripting experience in mainstream languages (Python, Bash, etc.) or frameworks (Ansible, Chef, Puppet, etc.) Preferred Qualifications: 4+ years of experience in one or more scripting languages (e.g., Bash, Python, or similar). 4+ years of experience using general-purpose programming languages (e.g., Go, Ruby, or similar). 5+ years of experience managing compute hardware in the context of datacenter deployments. 5+ years of experience with compute platforms and frameworks (Kubernetes, Virtualization platforms like VMware, libvirt/KVM), including service mesh and service discovery technologies (Istio, Consul, etc.).","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Network Development and Management Lead the team in designing, building, maintaining, and scaling components of a large-scale, multi-site, heavily peered network. Assess network capacity needs, predict growth trends, and plan for scalability. Ensure sufficient resources are allocated, and that network equipment and services are properly scaled to handle increasing demands. Expand network platform offerings to meet business and developer needs. Availability and Performance Handle internal/external support for network engineering escalations. Participate in a 24x7 on-call rotation, respond to incidents, and collaborate with other teams to resolve reliability issues. Lead efforts to monitor infrastructure proactively to identify and address issues, including through instructional playbooks. Research and understand performance gaps or outages, using this knowledge to resolve issues. Identify and execute disaster recovery/failure test scenarios. Fundamentals Drive the security and compliance of the infrastructure. Collaborate with security teams to implement and maintain robust security measures, conduct vulnerability assessments, and adhere to relevant regulatory standards. Ensure timely upgrades to software and firmware used for infrastructure operation, as well as to software components in our management and automation toolchains. Drive incident management processes, provide incident reports, identify root causes, and implement preventive measures to avoid future incidents. Behavior Embody our values: better together, growth mindset, ship to learn, customer-obsessed, diverse \u0026 inclusive, and own the outcome. Embody our principles: create clarity, generate energy, and deliver success.","posted_date":"October 7, 2024","posting_expiry_date":"2024-10-16T05:00:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/3372/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-10-07T19:38:38Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-10-07T19:33:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9","validThrough":"2024-10-16T05:00:00+0000"},"revision_int":1,"uuid":"b2b1c9c9-0e6a-4674-b45b-6cda7c1f756a"},"import_id":"0b214b61-c4f1-4abd-a776-ed97095805d0","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/jobs/115004104329044678","jobHash":"d5a3fa6e6e333f0e3a8a847b084a31be","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"Network Development and Management Lead the team in designing, building, maintaining, and scaling components of a large-scale, multi-site, heavily peered network. Assess network capacity needs, predict growth trends, and plan for scalability. Ensure sufficient resources are allocated, and that network equipment and services are properly scaled to handle increasing demands. Expand network platform offerings to meet business and developer needs. Availability and Performance Handle internal/external support for network engineering escalations. Participate in a 24x7 on-call rotation, respond to incidents, and collaborate with other teams to resolve reliability issues. Lead efforts to monitor infrastructure proactively to identify and address issues, including through instructional playbooks. Research and understand performance gaps or outages, using this knowledge to resolve issues. Identify and execute disaster recovery/failure test scenarios. Fundamentals Drive the security and compliance of the infrastructure. Collaborate with security teams to implement and maintain robust security measures, conduct vulnerability assessments, and adhere to relevant regulatory standards. Ensure timely upgrades to software and firmware used for infrastructure operation, as well as to software components in our management and automation toolchains. Drive incident management processes, provide incident reports, identify root causes, and implement preventive measures to avoid future incidents. Behavior Embody our values: better together, growth mindset, ship to learn, customer-obsessed, diverse \u0026 inclusive, and own the outcome. Embody our principles: create clarity, generate energy, and deliver success.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/3372?lang=en-us","last_mod":"2024-10-07T19:39:08+0000","gdpr":false},"create_date":"2024-10-07T19:39:08+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States"}},{"data":{"slug":"3319","language":"en-us","languages":["en-us"],"req_id":"3319","title":"Software Engineer II","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview As a software engineer at GitHub, you will enhance the collaboration experience at GitHub by working closely with a community of engineers and designers with a distributed, diverse and passionate team delivering the services that millions of developers depend on. In this role you will design, prototype, implement, ship and support highly performant and inspiring user experiences with your team. We are looking for creative problem solvers and diverse thinkers, people who care about culture as well as customers and features. We believe that how we do things is as important as what we do. Big vision, a common purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what lead to great results. Great products reflect the teams that build them. Responsibilities Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code. Qualifications Required Qualifications Experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience OR Bachelor's Degree in Computer Science or related field OR equivalent experience. Preferred Qualifications Experience with Git and GitHub Experience using Azure technologies is a bonus Experience using front-end frameworks like React.js Understanding of REST principles and experience with backend APIs Strong written and verbal communication skill Passionate about healthy team culture and collaboration Comfortable working transparently in an agile environment and soliciting feedback from peers. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"United Kingdom Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications Experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience OR Bachelor's Degree in Computer Science or related field OR equivalent experience. Preferred Qualifications Experience with Git and GitHub Experience using Azure technologies is a bonus Experience using front-end frameworks like React.js Understanding of REST principles and experience with backend APIs Strong written and verbal communication skill Passionate about healthy team culture and collaboration Comfortable working transparently in an agile environment and soliciting feedback from peers.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","posted_date":"August 22, 2024","apply_url":"https://globalcareers-githubinc.icims.com/jobs/3319/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/73105548009972422","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"524e9482ed5e55417f9aad8f1d74694b","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-10-10T13:45:53Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-08-22T20:09:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":16,"uuid":"9262338a-1233-47f2-bed4-cc7f529e0e9c"},"import_id":"4b2f8f44-4524-40b5-bf8e-0e661527b7f9","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3319?lang=en-us","last_mod":"2024-10-10T13:46:08+0000","gdpr":true},"update_date":"2024-10-10T13:46:08+0000","create_date":"2024-08-22T20:15:36+0000","category":[" Engineering"],"full_location":"United Kingdom","short_location":"United Kingdom"}}],"totalCount":19,"count":19,"filter":{"displayLimit":10,"categories":{"all":[{"category":"Engineering","numJobs":19}],"shortlist":[{"category":"Engineering","numJobs":19}]},"brands":{"all":[],"shortlist":[]},"experienceLevels":{"all":[],"shortlist":[]},"locations":{"all":[{"city":null,"state":null,"country":"United Kingdom","count":6},{"city":null,"state":null,"country":"United States","count":13}],"shortlist":[{"city":null,"state":null,"country":"United Kingdom","count":6},{"city":null,"state":null,"country":"United States","count":13}]},"facetList":{"tags4":[{"term":"Experienced Professional","count":19}],"tags5":[{"term":"Individual Contributor","count":15},{"term":"Director","count":2},{"term":"Senior Manager","count":2}],"tags6":[{"term":"Yes","count":18},{"term":"No","count":1}]}},"languageCounts":{"en-us":{"displayName":"English","count":19}},"request_id":false,"locations":[]}