{"jobs":[{"data":{"slug":"3088","language":"en-us","languages":["en-us"],"req_id":"3088","title":"Staff Software Engineer - Search","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview GitHub is changing the way the world builds software, and we want you to help! We’re looking for a Staff level Software Engineer to join the Code Search team. More of the world’s development data lives on GitHub than anywhere else. Helping developers navigate and understand that data is a core part of GitHub’s mission, and an area with significant potential we’ve only begun to realize. We have high aspirations for how we can help developers understand and navigate code, and for making collaboration more seamless. The foundation for these efforts is our highly scalable code search engine, which we are now expanding to help power semantic/vector search to better support many of GitHub’s AI experiences. In this role, you will have the opportunity to be part of the team that’s reinventing the platform and infrastructure that millions of developers depend on for -- re-thinking everything from the experience to the system architecture supporting it. You will be involved in the design, rollout, and support of a highly performant, highly scalable and highly available search platform with your team. Code search, semantic search and AI are a complex, cutting edge problem space and you will help your senior team navigate uncertainty and make effective implementation tradeoff decisions, relying on careful reasoning and decision making around a significant infrastructure budget. Together we are creating the tools and products that are integral to how people build software. We pride ourselves on being thoughtful, intentional, and productive. We value learning, introspection and reflection, and we’re always looking for ways to improve as a team and as individuals. Responsibilities Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support a highly available service used by millions of users on a daily basis Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Help ensure that individuals on the team are learning, growing and advancing in their respective careers Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you Qualifications Required Qualifications: Several years of proficiency in Rust, C or C++ Several years of proficiency in systems programming, search index internals and information retrieval Experience designing, building, scaling and maintaining large-scale distributed systems Experience designing and implementing data structures and algorithms Preferred Qualifications: Experience effectively contributing to technical strategy and roadmaps Passionate about fostering good engineering practices and processes Solid understanding of testing principles and high quality software Understanding of production system monitoring and observability Troubleshooting skills across network, application, caching, queuing, load-balancing, storage and distributed services layers. Excellent analytical skills as well as communication skills both verbal and written. We’re a distributed team so we’re extra mindful about communication. Strong customer focus and data driven approach GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"United Kingdom Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: Several years of proficiency in Rust, C or C++ Several years of proficiency in systems programming, search index internals and information retrieval Experience designing, building, scaling and maintaining large-scale distributed systems Experience designing and implementing data structures and algorithms Preferred Qualifications: Experience effectively contributing to technical strategy and roadmaps Passionate about fostering good engineering practices and processes Solid understanding of testing principles and high quality software Understanding of production system monitoring and observability Troubleshooting skills across network, application, caching, queuing, load-balancing, storage and distributed services layers. Excellent analytical skills as well as communication skills both verbal and written. We’re a distributed team so we’re extra mindful about communication. Strong customer focus and data driven approach","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support a highly available service used by millions of users on a daily basis Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Help ensure that individuals on the team are learning, growing and advancing in their respective careers Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you","posted_date":"July 12, 2024","apply_url":"https://globalcareers-githubinc.icims.com/jobs/3088/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/96523746461786822","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"47f18799785678fd84192fac5c1b50fa","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support a highly available service used by millions of users on a daily basis Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Help ensure that individuals on the team are learning, growing and advancing in their respective careers Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-08-28T21:04:05Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-07-12T19:06:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":3,"uuid":"75b7c161-9b1f-4da3-a334-741ebef47f8c"},"import_id":"93f3915a-edba-4411-a269-a9b76d2c5f15","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3088?lang=en-us","last_mod":"2024-08-28T21:04:15+0000","gdpr":true},"update_date":"2024-08-28T21:04:15+0000","create_date":"2024-07-12T19:11:56+0000","category":[" Engineering"],"full_location":"United Kingdom","short_location":"United Kingdom"}},{"data":{"slug":"2920","language":"en-us","languages":["en-us"],"req_id":"2920","title":"Principal Software Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is revolutionizing the way developers collaborate and build software, and we are seeking a Principal Software Engineer to pioneer the UI Platform space, which entails areas of frontend performance, accessibility, consistency, and availability. This role is pivotal to defining GitHub's future UI architecture, ensuring accessibility for all users, delivering an exceptional user interface, enhancing developer experience, and positioning GitHub as a leader in UI innovation, thereby empowering millions of developers worldwide. Responsibilities Lead the architectural design and development of GitHub's web UI platform, ensuring scalability, reliability, accessibility, and performance. Collaborate with cross-functional teams to define and prioritize projects aimed at enhancing GitHub's user experience. Establish best practices, patterns, and guidelines for frontend development, fostering a culture of excellence and innovation. Provide technical leadership and mentorship to frontend engineering teams, promoting continuous learning and growth. Drive initiatives to improve engineering processes, tooling, and automation to streamline development workflows. Champion accessibility, performance, and usability standards, ensuring that GitHub's web interfaces are accessible to all users and optimized for performance. Stay abreast of emerging frontend technologies, trends, and best practices, advocating for their adoption when beneficial to GitHub's development ecosystem. Collaborate with product management and design teams to translate user needs and business requirements into technical solutions. Serve as a subject matter expert on web UI development, representing GitHub in industry conferences, forums, and technical communities. A week in the life of a Principal Engineer might consist of: Collaborating with other Principal Engineers to define the future of GitHub engineering and working together to implement that vision Collaborating with design, analytics, support, and product management to understand the problems we want to solve and exploring how we can solve them Digging into the most important issues the department is tackling by asking questions, creating plans, recognizing pitfalls, raising concerns, and creating clarity Discussing and collaboratively solving engineering and product problems with engineering collaborators in Slack or Zoom Planning and executing large-scale company-wide rollouts and migrations Supporting company-wide initiatives Bringing key plans and execution ideas to the management team Mentoring other engineers at all experience levels Providing comprehensive and high quality code or design reviews when requested by other teams at GitHub Reviewing teammates' Pull Requests and providing helpful feedback Serve as an engineering representative for critical customer conversations to discover what they love and what their pain points are Embedding in a squad periodically to enable others to tackle challenges and stretch assignments As a part of Engineering technical leadership, advising on key initiatives, gaps, and technical pitfalls we need to be aware of Qualifications Required Qualifications: Bachelor's degree in Computer Science, Engineering, or equivalent practical experience. 10+ years of professional experience in frontend development, with a strong proficiency in modern JavaScript frameworks (especially React) and with the last 4 years in a senior technical role (e.g. Staff / Principal or equivalent) 7+ years of experience in designing, building, and maintaining large-scale frontend applications and the backend systems that support these with an emphasis on performance, scalability, and maintainability. 7+ years of providing technical leadership and mentorship, guiding teams to deliver high-quality software solutions, demonstrating a proactive bias for action in ensuring timely execution of projects and initiatives. 3+ years of experience constructing APIs for front-end applications OR proficiency consuming those APIs while leveraging associated client libraries like Apollo, TRPC, Relay, etc. Preferred Qualifications: Experience navigating how different concerns within the frontend engineering space overlap (e.g. accessibility, performance, UX consistency) and crafting execution strategies that successfully take these areas into consideration and lead to meaningful and impactful deliverables. Deep expertise and knowledge of the inner workings of React and related technologies Passionate and active in the evolution of current front-end architecture trends and best practices, encompassing performance, accessibility, security, and usability. Extensive experience with TypeScript and other statically typed languages, Node.js, the Web platform, and UI architecture Experience with large-scale codebases with contributors that span teams, offices and time zones Prior experience with Ruby on Rails or other backend technologies. Proficiency in using and customizing build tools and automation frameworks, such as Webpack. Prior experience articulating complex technical concepts to both technical (engineers at all levels) and non-technical (stakeholders and executives) audiences Compensation Range The base salary range for this job is USD $134,800.00 - USD $357,500.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: Bachelor's degree in Computer Science, Engineering, or equivalent practical experience. 10+ years of professional experience in frontend development, with a strong proficiency in modern JavaScript frameworks (especially React) and with the last 4 years in a senior technical role (e.g. Staff / Principal or equivalent) 7+ years of experience in designing, building, and maintaining large-scale frontend applications and the backend systems that support these with an emphasis on performance, scalability, and maintainability. 7+ years of providing technical leadership and mentorship, guiding teams to deliver high-quality software solutions, demonstrating a proactive bias for action in ensuring timely execution of projects and initiatives. 3+ years of experience constructing APIs for front-end applications OR proficiency consuming those APIs while leveraging associated client libraries like Apollo, TRPC, Relay, etc. Preferred Qualifications: Experience navigating how different concerns within the frontend engineering space overlap (e.g. accessibility, performance, UX consistency) and crafting execution strategies that successfully take these areas into consideration and lead to meaningful and impactful deliverables. Deep expertise and knowledge of the inner workings of React and related technologies Passionate and active in the evolution of current front-end architecture trends and best practices, encompassing performance, accessibility, security, and usability. Extensive experience with TypeScript and other statically typed languages, Node.js, the Web platform, and UI architecture Experience with large-scale codebases with contributors that span teams, offices and time zones Prior experience with Ruby on Rails or other backend technologies. Proficiency in using and customizing build tools and automation frameworks, such as Webpack. Prior experience articulating complex technical concepts to both technical (engineers at all levels) and non-technical (stakeholders and executives) audiences","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Lead the architectural design and development of GitHub's web UI platform, ensuring scalability, reliability, accessibility, and performance. Collaborate with cross-functional teams to define and prioritize projects aimed at enhancing GitHub's user experience. Establish best practices, patterns, and guidelines for frontend development, fostering a culture of excellence and innovation. Provide technical leadership and mentorship to frontend engineering teams, promoting continuous learning and growth. Drive initiatives to improve engineering processes, tooling, and automation to streamline development workflows. Champion accessibility, performance, and usability standards, ensuring that GitHub's web interfaces are accessible to all users and optimized for performance. Stay abreast of emerging frontend technologies, trends, and best practices, advocating for their adoption when beneficial to GitHub's development ecosystem. Collaborate with product management and design teams to translate user needs and business requirements into technical solutions. Serve as a subject matter expert on web UI development, representing GitHub in industry conferences, forums, and technical communities. A week in the life of a Principal Engineer might consist of: Collaborating with other Principal Engineers to define the future of GitHub engineering and working together to implement that vision Collaborating with design, analytics, support, and product management to understand the problems we want to solve and exploring how we can solve them Digging into the most important issues the department is tackling by asking questions, creating plans, recognizing pitfalls, raising concerns, and creating clarity Discussing and collaboratively solving engineering and product problems with engineering collaborators in Slack or Zoom Planning and executing large-scale company-wide rollouts and migrations Supporting company-wide initiatives Bringing key plans and execution ideas to the management team Mentoring other engineers at all experience levels Providing comprehensive and high quality code or design reviews when requested by other teams at GitHub Reviewing teammates' Pull Requests and providing helpful feedback Serve as an engineering representative for critical customer conversations to discover what they love and what their pain points are Embedding in a squad periodically to enable others to tackle challenges and stretch assignments As a part of Engineering technical leadership, advising on key initiatives, gaps, and technical pitfalls we need to be aware of","posted_date":"May 6, 2024","apply_url":"https://careers-githubinc.icims.com/jobs/2920/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/74682825961284294","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"86c952e30273bb520f40b4625772f779","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"Lead the architectural design and development of GitHub's web UI platform, ensuring scalability, reliability, accessibility, and performance. Collaborate with cross-functional teams to define and prioritize projects aimed at enhancing GitHub's user experience. Establish best practices, patterns, and guidelines for frontend development, fostering a culture of excellence and innovation. Provide technical leadership and mentorship to frontend engineering teams, promoting continuous learning and growth. Drive initiatives to improve engineering processes, tooling, and automation to streamline development workflows. Champion accessibility, performance, and usability standards, ensuring that GitHub's web interfaces are accessible to all users and optimized for performance. Stay abreast of emerging frontend technologies, trends, and best practices, advocating for their adoption when beneficial to GitHub's development ecosystem. Collaborate with product management and design teams to translate user needs and business requirements into technical solutions. Serve as a subject matter expert on web UI development, representing GitHub in industry conferences, forums, and technical communities. A week in the life of a Principal Engineer might consist of: Collaborating with other Principal Engineers to define the future of GitHub engineering and working together to implement that vision Collaborating with design, analytics, support, and product management to understand the problems we want to solve and exploring how we can solve them Digging into the most important issues the department is tackling by asking questions, creating plans, recognizing pitfalls, raising concerns, and creating clarity Discussing and collaboratively solving engineering and product problems with engineering collaborators in Slack or Zoom Planning and executing large-scale company-wide rollouts and migrations Supporting company-wide initiatives Bringing key plans and execution ideas to the management team Mentoring other engineers at all experience levels Providing comprehensive and high quality code or design reviews when requested by other teams at GitHub Reviewing teammates' Pull Requests and providing helpful feedback Serve as an engineering representative for critical customer conversations to discover what they love and what their pain points are Embedding in a squad periodically to enable others to tackle challenges and stretch assignments As a part of Engineering technical leadership, advising on key initiatives, gaps, and technical pitfalls we need to be aware of","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-08-28T19:56:22Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-05-06T20:26:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9"},"revision_int":3,"uuid":"5adeaa8c-d502-4de6-a891-398f444ad58a"},"import_id":"ec1e522f-f927-442c-8b89-15b9de5f995d","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/2920?lang=en-us","last_mod":"2024-08-28T19:57:11+0000","gdpr":false},"update_date":"2024-08-28T19:57:11+0000","create_date":"2024-06-05T14:57:39+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States"}},{"data":{"slug":"3385","language":"en-us","languages":["en-us"],"req_id":"3385","title":"Dir, Software Engineering","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview We are looking for a Software Engineering Director to lead the development of foundational components for GitHub products. This role is critical in a fast-paced environment where you can make a high-impact contribution to our product offerings. As a Software Engineering Director, you'll guide a globally distributed team of managers and engineers, enhancing and scaling our products to deliver an exceptional experience that meets the unique needs of our diverse customer base. A Director leading this team must have a strong balance of people, project, and technical management - flexing their skill sets to empower the team to create innovative solutions and drive long-term positive strategic outcomes for GitHub. Responsibilities A day in the life: Our team is distributed worldwide which means we work both asynchronously and real-time. Directors at GitHub directly manage managers and engineers and we allow for this track to grow in complexity within the product and technology offerings as well as breadth. We separate this track from our manager roles who manage individual contributors and focus on depth. Your typical week would include: Collaborating with engineering teams, product management, platform customers, and engineering leadership to align on and understand the problems we want to solve and drive long-term strategic outcomes Unblocking obstacles for your teams as they solve GitHub’s most critical problems, often via real-time conversations in Slack or Zoom and with asynchronous communication in GitHub Issues, PRs, Discussions, and Projects. Help drive clarity and prioritization across the organization. Communicating effectively to support internal and external users and inform stakeholders of progress as well as system status and team health Promote best engineering standards and practices, ensuring teams produce good architectural design outcomes, secure and resilient systems, and quality code. Ensuring teams iteratively ship features and bug fixes, balancing speed to market with future velocity. Hiring and developing talent, fostering a culture of collaboration, innovation, and technical excellence Qualifications There are only a handful of folks who meet all qualifications. So whether you meet all the qualifications or a partial set, we want to hear from you. Required qualifications 9+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 8+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science or related field AND 7+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. o OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. o OR equivalent experience. 3+ years people management experience 5+ years of experience developing a strategy and roadmap in partnership with your team and stakeholders Experience communicating with stakeholders and executing large initiatives in an iterative fashion Preferred qualifications 3+ years of experience managing engineering managers Excellent written and verbal communication skills Passionate about fostering good engineering practices and processes Experience recruiting and retaining healthy teams, managing performance, and calibrating expectations Experience working remotely and leading distributed teams Compensation Range The base salary range for this job is USD $118,100.00 - USD $313,300.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Director"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"There are only a handful of folks who meet all qualifications. So whether you meet all the qualifications or a partial set, we want to hear from you. Required qualifications 9+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 8+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science or related field AND 7+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. o OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. o OR equivalent experience. 3+ years people management experience 5+ years of experience developing a strategy and roadmap in partnership with your team and stakeholders Experience communicating with stakeholders and executing large initiatives in an iterative fashion Preferred qualifications 3+ years of experience managing engineering managers Excellent written and verbal communication skills Passionate about fostering good engineering practices and processes Experience recruiting and retaining healthy teams, managing performance, and calibrating expectations Experience working remotely and leading distributed teams","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"A day in the life: Our team is distributed worldwide which means we work both asynchronously and real-time. Directors at GitHub directly manage managers and engineers and we allow for this track to grow in complexity within the product and technology offerings as well as breadth. We separate this track from our manager roles who manage individual contributors and focus on depth. Your typical week would include: Collaborating with engineering teams, product management, platform customers, and engineering leadership to align on and understand the problems we want to solve and drive long-term strategic outcomes Unblocking obstacles for your teams as they solve GitHub’s most critical problems, often via real-time conversations in Slack or Zoom and with asynchronous communication in GitHub Issues, PRs, Discussions, and Projects. Help drive clarity and prioritization across the organization. Communicating effectively to support internal and external users and inform stakeholders of progress as well as system status and team health Promote best engineering standards and practices, ensuring teams produce good architectural design outcomes, secure and resilient systems, and quality code. Ensuring teams iteratively ship features and bug fixes, balancing speed to market with future velocity. Hiring and developing talent, fostering a culture of collaboration, innovation, and technical excellence","posted_date":"August 29, 2024","apply_url":"https://careers-githubinc.icims.com/jobs/3385/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/112252738783322822","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"93300861862c9b9f2a3bc172850983c3","derivedInfo":{"jobCategories":["COMPUTER_AND_IT","MANAGEMENT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"A day in the life: Our team is distributed worldwide which means we work both asynchronously and real-time. Directors at GitHub directly manage managers and engineers and we allow for this track to grow in complexity within the product and technology offerings as well as breadth. We separate this track from our manager roles who manage individual contributors and focus on depth. Your typical week would include: Collaborating with engineering teams, product management, platform customers, and engineering leadership to align on and understand the problems we want to solve and drive long-term strategic outcomes Unblocking obstacles for your teams as they solve GitHub’s most critical problems, often via real-time conversations in Slack or Zoom and with asynchronous communication in GitHub Issues, PRs, Discussions, and Projects. Help drive clarity and prioritization across the organization. Communicating effectively to support internal and external users and inform stakeholders of progress as well as system status and team health Promote best engineering standards and practices, ensuring teams produce good architectural design outcomes, secure and resilient systems, and quality code. Ensuring teams iteratively ship features and bug fixes, balancing speed to market with future velocity. Hiring and developing talent, fostering a culture of collaboration, innovation, and technical excellence","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-09-09T16:35:50Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-08-29T15:09:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9"},"revision_int":2,"uuid":"3d8ee4fc-c2fd-49a7-906f-51c94647b0ac"},"import_id":"9fe76a32-ad63-4f4d-bd46-7ce39f22ba41","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3385?lang=en-us","last_mod":"2024-09-09T16:36:36+0000","gdpr":false},"update_date":"2024-09-09T16:36:36+0000","create_date":"2024-08-29T15:15:10+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States"}},{"data":{"slug":"3344","language":"en-us","languages":["en-us"],"req_id":"3344","title":"Software Engineer II","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, Canada Overview As a software engineer at GitHub, you will enhance the collaboration experience at GitHub by working closely with a community of engineers and designers with a distributed, diverse and passionate team delivering the services that millions of developers depend on. In this role you will design, prototype, implement, ship and support highly performant and inspiring user experiences with your team. We are looking for creative problem solvers and diverse thinkers, people who care about culture as well as customers and features. We believe that how we do things is as important as what we do. Big vision, a common purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what lead to great results. Great products reflect the teams that build them. Responsibilities Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code. Qualifications Required Qualifications Experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience OR Bachelor's Degree in Computer Science or related field OR equivalent experience. Preferred Qualifications Experience with Git and GitHub Experience using Azure technologies is a bonus Experience using front-end frameworks like React.js Understanding of REST principles and experience with backend APIs Strong written and verbal communication skill Passionate about healthy team culture and collaboration Comfortable working transparently in an agile environment and soliciting feedback from peers. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"Canada Remote","country":"CAN","country_code":"CN","location_type":"ANY","latitude":23.11667,"longitude":113.25,"categories":[{"name":"Engineering"}],"tags2":["CAN-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications Experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience OR Bachelor's Degree in Computer Science or related field OR equivalent experience. Preferred Qualifications Experience with Git and GitHub Experience using Azure technologies is a bonus Experience using front-end frameworks like React.js Understanding of REST principles and experience with backend APIs Strong written and verbal communication skill Passionate about healthy team culture and collaboration Comfortable working transparently in an agile environment and soliciting feedback from peers.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","posted_date":"August 23, 2024","apply_url":"https://globalcareers-githubinc.icims.com/jobs/3344/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/85910874354524870","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"b9a5e63c1cf8c9870d7a409f1bafa5c6","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[]},"jobSummary":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-08-28T21:17:17Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-08-23T15:00:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":5,"uuid":"683a54f4-5e15-472f-adab-73527ad4fabc"},"import_id":"b5241b24-1280-4e9b-9974-92028dbb494d","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3344?lang=en-us","last_mod":"2024-08-28T21:18:10+0000","gdpr":false},"update_date":"2024-08-28T21:18:10+0000","create_date":"2024-08-23T15:06:35+0000","category":[" Engineering"],"full_location":"CAN","short_location":"CAN"}},{"data":{"slug":"2954","language":"en-us","languages":["en-us"],"req_id":"2954","title":"Staff Engineering Manager-Network","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is seeking a Staff Software Engineering Manager to join our Infrastructure organization. GitHub is a company at the center of software, where projects are developed, orchestrated, and deployed. GitHub infrastructure is critical to our customers in the way the power grid is critical to the manufacturing industry. Our customers depend on GitHub as a central workspace where they develop solutions for their own customers. The reward for this important role is a unique impact on creativity within the software development universe. With it comes the responsibility to view ourselves as the world’s production environment. One that needs to be as reliable as the power grid. This role leads a distributed team of engineers and is involved in the design, rollout and support of highly performant, highly scalable, and highly available network services and infrastructure across GitHub datacenters and cloud providers. Our group is highly distributed and the right candidate will thrive in an environment of asynchronous communication. We expect you to have excellent written communication skills and be able to create working relationships with coworkers in locations around the globe. Responsibilities Drive network infrastructure management, automation, and efficiency Guide the team’s vision, best practices, and priorities Provide clarity of decision making, direction, and progress for the team and the company Cultivate an environment of empowerment, ownership, and belonging Provide career development plans and performance feedback Review code, review design docs, and lead discussions about technical problems Drive incident response, blameless postmortems, and continuous improvement Coordinate complex technical project work with engineering teams across the stack Qualifications Required Qualifications: 8+ years of professional technical experience 4+ Years Experience supporting global network infrastructure within a data center environment 4+ years of managing engineering teams Bachelor’s Degree or equivalent experience Preferred Qualifications: Passionate about network engineering, automation and highly available infrastructure Energized by creating and growing exceptional engineering practices and processes Excellent analytical skills to proactively identify opportunities \u0026 risks and balance priorities Pragmatic focus on delivering incremental, continuous value toward long running objectives Strong written, verbal, and asynchronous communication skills Consistent focus on customer needs and data driven decision making Compensation Range The base salary range for this job is USD $118,100.00 - USD $313,300.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":37.09024,"longitude":-95.712891,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Director"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 8+ years of professional technical experience 4+ Years Experience supporting global network infrastructure within a data center environment 4+ years of managing engineering teams Bachelor’s Degree or equivalent experience Preferred Qualifications: Passionate about network engineering, automation and highly available infrastructure Energized by creating and growing exceptional engineering practices and processes Excellent analytical skills to proactively identify opportunities \u0026 risks and balance priorities Pragmatic focus on delivering incremental, continuous value toward long running objectives Strong written, verbal, and asynchronous communication skills Consistent focus on customer needs and data driven decision making","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Drive network infrastructure management, automation, and efficiency Guide the team’s vision, best practices, and priorities Provide clarity of decision making, direction, and progress for the team and the company Cultivate an environment of empowerment, ownership, and belonging Provide career development plans and performance feedback Review code, review design docs, and lead discussions about technical problems Drive incident response, blameless postmortems, and continuous improvement Coordinate complex technical project work with engineering teams across the stack","posted_date":"May 22, 2024","apply_url":"https://careers-githubinc.icims.com/jobs/2954/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/124062028187738822","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"a9099fbe8fe84fb049597b4ce50f6248","derivedInfo":{"jobCategories":["COMPUTER_AND_IT","MANAGEMENT"],"locations":[{"latLng":{"latitude":37.09024,"longitude":-95.712891},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":3.037432946478483}]},"jobSummary":"Drive network infrastructure management, automation, and efficiency Guide the team’s vision, best practices, and priorities Provide clarity of decision making, direction, and progress for the team and the company Cultivate an environment of empowerment, ownership, and belonging Provide career development plans and performance feedback Review code, review design docs, and lead discussions about technical problems Drive incident response, blameless postmortems, and continuous improvement Coordinate complex technical project work with engineering teams across the stack","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-09-04T16:04:24Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-05-22T20:54:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9"},"revision_int":5,"uuid":"40109d80-089a-4ea1-9a34-d1930864c8ac"},"import_id":"628e0ff6-97c2-4cbd-9983-1ccb7a620b0f","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/2954?lang=en-us","last_mod":"2024-09-04T16:05:15+0000","gdpr":false},"update_date":"2024-09-04T16:05:15+0000","create_date":"2024-05-22T20:55:04+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States"}},{"data":{"slug":"3183","language":"en-us","languages":["en-us"],"req_id":"3183","title":"Software Engineer II, Copilot Data","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview The Copilot Metrics team is a unique group composed of software engineers, data engineers, and data analysts. We build a service to support our customers' metrics needs and help them understand product usage patterns. The analysts will assist with data modeling, support product managers and leadership in understanding how customers are using our product, and identify pain points. This valuable analysis will also be used to help the product team develop better features. As a Data Software Engineer on the Copilot Metrics team, you will be responsible for designing, developing, and maintaining efficient and reliable data pipelines. You will work closely with stakeholders across the company to gather business requirements, build data models, and ensure data quality and accessibility. Your expertise in Python, SQL, Airflow, and Spark will be crucial in optimizing our data infrastructure and enabling data-driven decision-making. Responsibilities Data Pipeline Development: Design, build, and maintain scalable data pipelines using Python, SQL, Airflow, and Spark. Business Requirements Gathering: Collaborate with stakeholders to understand and translate business requirements into technical specifications. Data Modeling:Develop and implement data models that support analytics and reporting needs, ensuring alignment with business goals. Data Quality and Governance: Ensure data accuracy, consistency, and reliability by implementing robust data validation and quality checks. Stakeholder Collaboration: Work with cross-functional teams, including data analysts, data scientists, and business leaders, to deliver high-quality data solutions. Performance Optimization: Continuously monitor and optimize data pipelines for performance, scalability, and cost-efficiency. Monitoring and Observability: Build and implement monitoring and observability metrics to ensure data quality and detect anomalies in data pipelines. Documentation and Communication: Maintain clear and comprehensive documentation of data processes and effectively communicate technical concepts to non-technical stakeholders. Qualifications Required/Minimum Qualifications: 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python o OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 1+ year(s) experience o OR Bachelor's Degree in Computer Science or related field o OR equivalent experience 2+ years of experience in data engineering or analytics engineering roles, with strong proficiency in Python, SQL, Airflow, and Spark, and extensive expertise in building and maintaining robust data pipelines and ETL processes Experience gathering business requirements and translating them into effective data models that support comprehensive data analysis and reporting Preferred Qualifications: Familiarity with Go and Ruby Experience with cloud platforms such as AWS, GCP, or Azure Familiarity with data warehousing solutions (e.g., Snowflake, Redshift, BigQuery) Knowledge of data governance and data security best practices Communication: Excellent verbal and written communication skills, with the ability to convey technical information to non-technical audiences Collaboration: Proven ability to work effectively in a collaborative, cross-functional environment Compensation Range The base salary range for this job is USD $75,000.00 - USD $198,900.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required/Minimum Qualifications: 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python o OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 1+ year(s) experience o OR Bachelor's Degree in Computer Science or related field o OR equivalent experience 2+ years of experience in data engineering or analytics engineering roles, with strong proficiency in Python, SQL, Airflow, and Spark, and extensive expertise in building and maintaining robust data pipelines and ETL processes Experience gathering business requirements and translating them into effective data models that support comprehensive data analysis and reporting Preferred Qualifications: Familiarity with Go and Ruby Experience with cloud platforms such as AWS, GCP, or Azure Familiarity with data warehousing solutions (e.g., Snowflake, Redshift, BigQuery) Knowledge of data governance and data security best practices Communication: Excellent verbal and written communication skills, with the ability to convey technical information to non-technical audiences Collaboration: Proven ability to work effectively in a collaborative, cross-functional environment","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Data Pipeline Development: Design, build, and maintain scalable data pipelines using Python, SQL, Airflow, and Spark. Business Requirements Gathering: Collaborate with stakeholders to understand and translate business requirements into technical specifications. Data Modeling:Develop and implement data models that support analytics and reporting needs, ensuring alignment with business goals. Data Quality and Governance: Ensure data accuracy, consistency, and reliability by implementing robust data validation and quality checks. Stakeholder Collaboration: Work with cross-functional teams, including data analysts, data scientists, and business leaders, to deliver high-quality data solutions. Performance Optimization: Continuously monitor and optimize data pipelines for performance, scalability, and cost-efficiency. Monitoring and Observability: Build and implement monitoring and observability metrics to ensure data quality and detect anomalies in data pipelines. Documentation and Communication: Maintain clear and comprehensive documentation of data processes and effectively communicate technical concepts to non-technical stakeholders.","posted_date":"August 23, 2024","apply_url":"https://careers-githubinc.icims.com/jobs/3183/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/111256086253576902","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"eda1a4f7e68f2f3239f5bb7c7e255a1b","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"Data Pipeline Development: Design, build, and maintain scalable data pipelines using Python, SQL, Airflow, and Spark. Business Requirements Gathering: Collaborate with stakeholders to understand and translate business requirements into technical specifications. Data Modeling:Develop and implement data models that support analytics and reporting needs, ensuring alignment with business goals. Data Quality and Governance: Ensure data accuracy, consistency, and reliability by implementing robust data validation and quality checks. Stakeholder Collaboration: Work with cross-functional teams, including data analysts, data scientists, and business leaders, to deliver high-quality data solutions. Performance Optimization: Continuously monitor and optimize data pipelines for performance, scalability, and cost-efficiency. Monitoring and Observability: Build and implement monitoring and observability metrics to ensure data quality and detect anomalies in data pipelines. Documentation and Communication: Maintain clear and comprehensive documentation of data processes and effectively communicate technical concepts to non-technical stakeholders.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-09-09T17:16:08Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-08-23T16:59:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9"},"revision_int":3,"uuid":"59a409c1-815d-4583-831f-4725502b1deb"},"import_id":"26f0c4be-17c3-48d3-a3af-aa0b08f32202","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3183?lang=en-us","last_mod":"2024-09-09T17:16:36+0000","gdpr":false},"update_date":"2024-09-09T17:16:36+0000","create_date":"2024-08-23T17:05:36+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States"}},{"data":{"slug":"3244","language":"en-us","languages":["en-us"],"req_id":"3244","title":"Software Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview As a software engineer at GitHub, you will enhance the collaboration experience at GitHub by working closely with a community of engineers and designers with a distributed, diverse and passionate team delivering the services that millions of developers depend on. In this role you will design, prototype, implement, ship and support highly performant and inspiring user experiences with your team. We are looking for creative problem solvers and diverse thinkers, people who care about culture as well as customers and features. We believe that how we do things is as important as what we do. Big vision, a common purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what lead to great results. Great products reflect the teams that build them. Responsibilities Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Receive technical mentorship, collaborate and pair with others, provide code reviews, and communicate clearly to your leadership about progress, blockers, and gaps. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code. Qualifications Required Qualifications Experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, or related field OR equivalent experience. Preferred Qualifications Experience with Git and GitHub Experience using Azure technologies is a bonus Experience using front-end frameworks like React.js Understanding of REST principles and experience with backend APIs Strong written and verbal communication skill Passionate about healthy team culture and collaboration Comfortable working transparently in an agile environment and soliciting feedback from peers. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"United Kingdom Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications Experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, or related field OR equivalent experience. Preferred Qualifications Experience with Git and GitHub Experience using Azure technologies is a bonus Experience using front-end frameworks like React.js Understanding of REST principles and experience with backend APIs Strong written and verbal communication skill Passionate about healthy team culture and collaboration Comfortable working transparently in an agile environment and soliciting feedback from peers.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Receive technical mentorship, collaborate and pair with others, provide code reviews, and communicate clearly to your leadership about progress, blockers, and gaps. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","posted_date":"August 7, 2024","apply_url":"https://globalcareers-githubinc.icims.com/jobs/3244/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/86162782910587590","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"e44dc4369b4f2974347e15e279d5a5b7","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Receive technical mentorship, collaborate and pair with others, provide code reviews, and communicate clearly to your leadership about progress, blockers, and gaps. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-09-06T13:39:10Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-08-07T21:15:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":21,"uuid":"de65e6d3-f918-423c-bcf8-f72761bd6815"},"import_id":"f92b662f-2f3f-4c6a-8fc7-7a5ef835731f","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3244?lang=en-us","last_mod":"2024-09-06T13:40:11+0000","gdpr":true},"update_date":"2024-09-06T13:40:11+0000","create_date":"2024-08-07T21:21:00+0000","category":[" Engineering"],"full_location":"United Kingdom","short_location":"United Kingdom"}},{"data":{"slug":"3048","language":"en-us","languages":["en-us"],"req_id":"3048","title":"Senior Engineering Manager","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview The Data Warehouse group at GitHub is looking for a technical engineering manager with passion and experience in leading a data intensive product engineering team for the cloud. You will be responsible for the team owning and evolving the critical Big Data platforms that enable both providing analytics to GitHub’s customers and also expand the datasets available for GitHub's own internal R\u0026D. Now is a great time to join and influence architecture, serving up the world's code, at a key scale inflection point. The ideal candidate has a few years managing cloud native product engineering teams in both open source and proprietary technology stacks that demonstrate a high-scale data intensive and Analytics systems focus. If you have a passion for Data and GitHub we'd love to talk to you. Responsibilities Driving Big Data and customer Analytics product vision broadly and with key technical and architectural contributions Growing happy customers end-to-end for the services and platforms you own with operational excellence Assessing staffing needs to help shape and grow the Data Warehouse Platforms team to increase its impact Promoting team growth with modeling, coaching, and genuine care for people Partnering with leadership on vision, roadmap via OKRs, and full service lifecycle Driving collaboration with partner engineering teams to support data product integration from source to consumption Qualifications Required Qualifications 4 years experience leading product engineering teams that have shipped data intensive (gigabytes per second) services 6 years experience with any large-scale and Big Data distributed systems like Kafka, Hadoop, Trino (PrestoSQL), Airflow, Microsoft Kusto (Azure Data Explorer or ADX) and Microsoft Fabric 3-5 years experience managing and growing software engineering teams 3-5 years track record of developing and managing a network of cross functional partnerships across engineering and product organizations Preferred Qualifications Ability to lead a diverse, geographically distributed team Direct exposure to Data Science and Machine Learning workflows Experience driving customer-facing analytics projects from inception to shipping Experience with Data Governance structures including Data residency solutions A passion for GitHub's brand, platform and product and a desire to improve it for the world's developers by leveraging our unique data assets Experience creating clarity with both written and verbal communication Compensation Range The base salary range for this job is USD $104,400.00 - USD $276,900.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Senior Manager"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications 4 years experience leading product engineering teams that have shipped data intensive (gigabytes per second) services 6 years experience with any large-scale and Big Data distributed systems like Kafka, Hadoop, Trino (PrestoSQL), Airflow, Microsoft Kusto (Azure Data Explorer or ADX) and Microsoft Fabric 3-5 years experience managing and growing software engineering teams 3-5 years track record of developing and managing a network of cross functional partnerships across engineering and product organizations Preferred Qualifications Ability to lead a diverse, geographically distributed team Direct exposure to Data Science and Machine Learning workflows Experience driving customer-facing analytics projects from inception to shipping Experience with Data Governance structures including Data residency solutions A passion for GitHub's brand, platform and product and a desire to improve it for the world's developers by leveraging our unique data assets Experience creating clarity with both written and verbal communication","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Driving Big Data and customer Analytics product vision broadly and with key technical and architectural contributions Growing happy customers end-to-end for the services and platforms you own with operational excellence Assessing staffing needs to help shape and grow the Data Warehouse Platforms team to increase its impact Promoting team growth with modeling, coaching, and genuine care for people Partnering with leadership on vision, roadmap via OKRs, and full service lifecycle Driving collaboration with partner engineering teams to support data product integration from source to consumption","posted_date":"July 18, 2024","posting_expiry_date":"2024-10-31T04:00:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/3048/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/137076272546095814","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"6e51364bf2636e722f043253f62673ac","derivedInfo":{"jobCategories":["MANAGEMENT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"Driving Big Data and customer Analytics product vision broadly and with key technical and architectural contributions Growing happy customers end-to-end for the services and platforms you own with operational excellence Assessing staffing needs to help shape and grow the Data Warehouse Platforms team to increase its impact Promoting team growth with modeling, coaching, and genuine care for people Partnering with leadership on vision, roadmap via OKRs, and full service lifecycle Driving collaboration with partner engineering teams to support data product integration from source to consumption","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-08-28T19:52:30Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-07-18T18:38:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9","validThrough":"2024-10-31T04:00:00+0000"},"revision_int":4,"uuid":"dffa82e8-74c3-49bf-964e-0c81543db8d1"},"import_id":"88bfc264-a09a-47d4-9563-747068ab6032","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3048?lang=en-us","last_mod":"2024-08-28T19:53:11+0000","gdpr":false},"update_date":"2024-08-28T19:53:11+0000","create_date":"2024-07-18T18:45:23+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States"}},{"data":{"slug":"3319","language":"en-us","languages":["en-us"],"req_id":"3319","title":"Software Engineer II","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview As a software engineer at GitHub, you will enhance the collaboration experience at GitHub by working closely with a community of engineers and designers with a distributed, diverse and passionate team delivering the services that millions of developers depend on. In this role you will design, prototype, implement, ship and support highly performant and inspiring user experiences with your team. We are looking for creative problem solvers and diverse thinkers, people who care about culture as well as customers and features. We believe that how we do things is as important as what we do. Big vision, a common purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what lead to great results. Great products reflect the teams that build them. Responsibilities Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code. Qualifications Required Qualifications Experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience OR Bachelor's Degree in Computer Science or related field OR equivalent experience. Preferred Qualifications Experience with Git and GitHub Experience using Azure technologies is a bonus Experience using front-end frameworks like React.js Understanding of REST principles and experience with backend APIs Strong written and verbal communication skill Passionate about healthy team culture and collaboration Comfortable working transparently in an agile environment and soliciting feedback from peers. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"United Kingdom Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications Experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience OR Bachelor's Degree in Computer Science or related field OR equivalent experience. Preferred Qualifications Experience with Git and GitHub Experience using Azure technologies is a bonus Experience using front-end frameworks like React.js Understanding of REST principles and experience with backend APIs Strong written and verbal communication skill Passionate about healthy team culture and collaboration Comfortable working transparently in an agile environment and soliciting feedback from peers.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","posted_date":"August 22, 2024","apply_url":"https://globalcareers-githubinc.icims.com/jobs/3319/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/73105548009972422","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"bb6a5d5f77386dcf4ae18e1b25a41fca","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-09-09T15:45:06Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-08-22T20:09:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":5,"uuid":"9262338a-1233-47f2-bed4-cc7f529e0e9c"},"import_id":"f48ca357-1267-448f-83f7-42235c9bab32","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3319?lang=en-us","last_mod":"2024-09-09T15:45:36+0000","gdpr":true},"update_date":"2024-09-09T15:45:36+0000","create_date":"2024-08-22T20:15:36+0000","category":[" Engineering"],"full_location":"United Kingdom","short_location":"United Kingdom"}},{"data":{"slug":"3094","language":"en-us","languages":["en-us"],"req_id":"3094","title":"Sr. Mgr, Software Engineering","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview We’re looking for an empathetic Software Engineering Manager with a strong commitment to growing and shaping our team. Our team develops numerous products and services for GitHub’s Customer Success organization. Including but not limited to; the GitHub Support portal, our brand new Copilot for GitHub Support, Machine Learning tooling, and other exciting and impactful technologies that empower our internal teams to make a positive impact on our GitHub customers and community, each and every day. The primary goal of this role is to be a leader. To enable every team member to do their best work, by guiding and serving them, and to upkeep the happiness and productivity of the team. In achieving this, you can expect to focus on improving our processes, standards, and overall abilities of the team. We work in a mostly asynchronous way with team members spanning across all continents and timezones. Responsibilities Meeting 1-1 with all your team members on a regular basis Planning and supporting career development Giving guided performance feedback Serving as a coach and mentor Fostering a supportive environment that will allow engineers to do their best work Guiding the development team’s vision, best practices, and priorities Initiating group discussions on engineering topics and facilitating team decision making Qualifications Required Qualifications 6+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python o OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field. OR equivalent experience. 1+ year(s) direct and/or indirect people management or leadership experience 1+ year(s) experience building internal tools and services for customer success, technical support, or revenue teams Preferred Qualifications 3+ years experience managing remote engineering teams Prior experience leading small teams of 5 to 10 software engineers Strong written and verbal communication skills with an ability to facilitate team meetings Passionate about creating and fostering good engineering practices and processes Ability to empathize with a diverse range of global engineers in a remote environment Compensation Range The base salary range for this job is USD $104,400.00 - USD $276,900.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Senior Manager"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications 6+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python o OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field. OR equivalent experience. 1+ year(s) direct and/or indirect people management or leadership experience 1+ year(s) experience building internal tools and services for customer success, technical support, or revenue teams Preferred Qualifications 3+ years experience managing remote engineering teams Prior experience leading small teams of 5 to 10 software engineers Strong written and verbal communication skills with an ability to facilitate team meetings Passionate about creating and fostering good engineering practices and processes Ability to empathize with a diverse range of global engineers in a remote environment","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Meeting 1-1 with all your team members on a regular basis Planning and supporting career development Giving guided performance feedback Serving as a coach and mentor Fostering a supportive environment that will allow engineers to do their best work Guiding the development team’s vision, best practices, and priorities Initiating group discussions on engineering topics and facilitating team decision making","posted_date":"August 8, 2024","apply_url":"https://careers-githubinc.icims.com/jobs/3094/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/79537851691082438","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"7dd3820abaecf1a8939183aafff17010","derivedInfo":{"jobCategories":["COMPUTER_AND_IT","MANAGEMENT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"Meeting 1-1 with all your team members on a regular basis Planning and supporting career development Giving guided performance feedback Serving as a coach and mentor Fostering a supportive environment that will allow engineers to do their best work Guiding the development team’s vision, best practices, and priorities Initiating group discussions on engineering topics and facilitating team decision making","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-08-28T21:02:53Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-08-08T15:32:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9"},"revision_int":5,"uuid":"62b4ec91-e4a7-48bb-b02a-0cda0689a370"},"import_id":"d33e41fa-2468-4bfe-a226-04abb55e873a","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/3094?lang=en-us","last_mod":"2024-08-28T21:03:11+0000","gdpr":false},"update_date":"2024-08-28T21:03:11+0000","create_date":"2024-08-08T15:38:11+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States"}}],"totalCount":16,"count":16,"filter":{"displayLimit":10,"categories":{"all":[{"category":"Engineering","numJobs":16}],"shortlist":[{"category":"Engineering","numJobs":16}]},"brands":{"all":[],"shortlist":[]},"experienceLevels":{"all":[],"shortlist":[]},"locations":{"all":[{"city":null,"state":null,"country":"CAN","count":1},{"city":null,"state":null,"country":"United Kingdom","count":3},{"city":null,"state":null,"country":"United States","count":12}],"shortlist":[{"city":null,"state":null,"country":"CAN","count":1},{"city":null,"state":null,"country":"United Kingdom","count":3},{"city":null,"state":null,"country":"United States","count":12}]},"facetList":{"tags4":[{"term":"Experienced Professional","count":16}],"tags5":[{"term":"Individual Contributor","count":9},{"term":"Senior Manager","count":4},{"term":"Director","count":3}],"tags6":[{"term":"Yes","count":16}]}},"languageCounts":{"en-us":{"displayName":"English","count":16}},"request_id":false,"locations":[]}