{"jobs":[{"data":{"slug":"2472","language":"en-us","languages":["en-us"],"req_id":"2472","title":"Software Engineer, Android","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub Copilot has changed the way software is built, and we have a unique opportunity to look further ahead to identify how software development can be faster, safer, easier, and more accessible. We’re looking for a talented and experienced Android Engineer to join us in this mission! The GitHub Mobile team is advancing the way developers across the world collaborate on GitHub through native Android and iOS apps. Launched in March 2020, GitHub Mobile quickly became a core product with over 10 million downloads across both platforms and 4.67-star rating in Google Play. The team is looking for someone who is passionate about the Android platform and who will help us build a world-class app in design, performance, and accessibility. Come join the team and influence the future of GitHub Mobile! Stack: Our Android app is built with Kotlin and uses Apollo to communicate with GitHub GraphQL APIs. Responsibilities A day in the life of an Android Engineer Our team is distributed worldwide which means we work asynchronously most of the time. Your typical week would include: Brainstorming on architecture and product decisions with the team. It's a small team, everyone's input matters! Building new features that will simplify our users' workflows Collaborating with iOS and backend engineers to create a unified product Jamming on pixels with designers to propose new ideas or provide feedback Testing the app at bug bashes before releases to ensure we're shipping a high quality product Qualifications Required 3+ years experience as a software engineer Experience developing Android apps and distributing them through Google Play Experience with Git and GitHub Preferred Strong written communication skills High degree of empathy Ability to learn and think critically about both system design and software engineering concepts and blend those perspectives pragmatically based on project needs A personal Android device. We are looking for someone who is familiar with the platform and even a fan of it! Experience in Kotlin and Jetpack Compose Knowledge of design, testing, and debugging best practices Compensation Range USD $75,000.00 - USD $198,900.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required 3+ years experience as a software engineer Experience developing Android apps and distributing them through Google Play Experience with Git and GitHub Preferred Strong written communication skills High degree of empathy Ability to learn and think critically about both system design and software engineering concepts and blend those perspectives pragmatically based on project needs A personal Android device. We are looking for someone who is familiar with the platform and even a fan of it! Experience in Kotlin and Jetpack Compose Knowledge of design, testing, and debugging best practices","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542","responsibilities":"A day in the life of an Android Engineer Our team is distributed worldwide which means we work asynchronously most of the time. Your typical week would include: Brainstorming on architecture and product decisions with the team. It's a small team, everyone's input matters! Building new features that will simplify our users' workflows Collaborating with iOS and backend engineers to create a unified product Jamming on pixels with designers to propose new ideas or provide feedback Testing the app at bug bashes before releases to ensure we're shipping a high quality product","posted_date":"December 22, 2023","apply_url":"https://careers-githubinc.icims.com/jobs/2472/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2023-12-22T00:51:40Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-12-22T00:38:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":1,"uuid":"d4e21929-b161-47d6-ab53-192ccfaa94c0"},"import_id":"236a3fd4-2324-4982-8900-2148ebcf2f34","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/90346178492670662","jobHash":"5207a68496506c06ceb1fbb49cf600be","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.0000717042852578733}]},"jobSummary":"A day in the life of an Android Engineer Our team is distributed worldwide which means we work asynchronously most of the time. Your typical week would include: Brainstorming on architecture and product decisions with the team. It's a small team, everyone's input matters! Building new features that will simplify our users' workflows Collaborating with iOS and backend engineers to create a unified product Jamming on pixels with designers to propose new ideas or provide feedback Testing the app at bug bashes before releases to ensure we're shipping a high quality product","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2472?lang=en-us","last_mod":"2023-12-22T00:52:39+0000","gdpr":false},"create_date":"2023-12-22T00:52:39+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2560","language":"en-us","languages":["en-us"],"req_id":"2560","title":"Applied Researcher","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub Copilot has changed the way software is built, and we have a unique opportunity to look further ahead to identify how software development can be faster, safer, easier, and more accessible. We’re looking for talented and passionate applied scientists to join us in this mission! Our team, GitHub Copilot Applied Science, has a crucial role in advancing the core intelligence solutions within Copilot. Our responsibilities encompass various areas such as LLM fine-tuning generation, prompt engineering, and the development of end-to-end AI features using cutting-edge technologies. In this role, you will collaborate closely with a diverse and highly skilled group of researchers, scientists, and software engineers within our team, while partnering with multiple teams across Github and Microsoft. Together, we are dedicated to shaping the future of software development by continuously enhancing AI-powered capabilities in Copilot. Responsibilities Drive research initiatives for online metrics development to continuously assess and improve the real-time performance of Copilot products Develop and implement methodologies for offline quality measurement, ensuring robust evaluation of large language model outputs in diverse scenarios. Lead the development of tools for automating quality analysis, streamlining the assessment process, and enhancing the efficiency of large-scale model evaluations. Integrate Responsible AI principles into the development lifecycle of Copilot products. Design and execute experiments to evaluate the impact of model changes, ensuring continuous refinement and advancement. Hands-on engagement with model training activities to elevate the performance of the Copilot product. Qualifications Required Qualifications Bachelor's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 2+ years related experience (e.g., statistics, predictive analytics, research) OR Master's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 1+ year(s) related experience (e.g., statistics, predictive analytics, research) OR Doctorate in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field OR equivalent experience 2+ years experience in applied science, machine learning, deep learning, natural language processing or large-scale data mining. Strong programming skills in languages such as Python, and experience with relevant libraries and framework Preferred Qualifications: These are more specific abilities we’re looking for . Think of this as a descriptive sketch, not a checklist of requirements. Be comfortable applying even if you don’t have all of them. Ph.D in computer science, machine learning, or a related field. Experience working with LLM and OpenAI models. Understanding of Responsible AI principles and their application in AI product development. Have significant experience with large-scale data analysis and experimentation Expertise in developing tools for automation and familiarity with quality analysis frameworks. Excellent analytical and problem-solving skills with a keen attention to detail Excellent written and verbal communication skills Compensation Range USD $90,700.00 - USD $240,500.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications Bachelor's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 2+ years related experience (e.g., statistics, predictive analytics, research) OR Master's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 1+ year(s) related experience (e.g., statistics, predictive analytics, research) OR Doctorate in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field OR equivalent experience 2+ years experience in applied science, machine learning, deep learning, natural language processing or large-scale data mining. Strong programming skills in languages such as Python, and experience with relevant libraries and framework Preferred Qualifications: These are more specific abilities we’re looking for . Think of this as a descriptive sketch, not a checklist of requirements. Be comfortable applying even if you don’t have all of them. Ph.D in computer science, machine learning, or a related field. Experience working with LLM and OpenAI models. Understanding of Responsible AI principles and their application in AI product development. Have significant experience with large-scale data analysis and experimentation Expertise in developing tools for automation and familiarity with quality analysis frameworks. Excellent analytical and problem-solving skills with a keen attention to detail Excellent written and verbal communication skills","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542","responsibilities":"Drive research initiatives for online metrics development to continuously assess and improve the real-time performance of Copilot products Develop and implement methodologies for offline quality measurement, ensuring robust evaluation of large language model outputs in diverse scenarios. Lead the development of tools for automating quality analysis, streamlining the assessment process, and enhancing the efficiency of large-scale model evaluations. Integrate Responsible AI principles into the development lifecycle of Copilot products. Design and execute experiments to evaluate the impact of model changes, ensuring continuous refinement and advancement. Hands-on engagement with model training activities to elevate the performance of the Copilot product.","posted_date":"December 21, 2023","apply_url":"https://careers-githubinc.icims.com/jobs/2560/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2023-12-21T22:45:32Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-12-21T22:45:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":2,"uuid":"e0b28ef5-6f27-45af-8950-9284631f7476"},"import_id":"0b18768d-67fd-42d0-8f63-895da0b021cc","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/75871142272737990","jobHash":"7b1c7f987e54c299663474b138d4e7b8","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.0000717042852578733}]},"jobSummary":"Drive research initiatives for online metrics development to continuously assess and improve the real-time performance of Copilot products Develop and implement methodologies for offline quality measurement, ensuring robust evaluation of large language model outputs in diverse scenarios. Lead the development of tools for automating quality analysis, streamlining the assessment process, and enhancing the efficiency of large-scale model evaluations. Integrate Responsible AI principles into the development lifecycle of Copilot products. Design and execute experiments to evaluate the impact of model changes, ensuring continuous refinement and advancement. Hands-on engagement with model training activities to elevate the performance of the Copilot product.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2560?lang=en-us","last_mod":"2023-12-21T22:45:39+0000","gdpr":false},"update_date":"2023-12-21T22:45:39+0000","create_date":"2023-12-21T20:35:39+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2509","language":"en-us","languages":["en-us"],"req_id":"2509","title":"Senior Software Engineer, Edge Systems","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is looking for engineers to join the Traffic Engineering team within our larger Infrastructure Engineering organization. You will focus on the systems and tools that enable our engineers to operate and scale the world's largest code hosting platform. You will help develop and maintain our edge and internal load balancing and caching infrastructure. You will also help improve end user performance through the expansion our global network. Nearly every byte in and out of GitHub’s network will traverse systems you own. The Infrastructure Engineering team is highly distributed and you will thrive in an environment of remote work and asynchronous communication. You're expected to have strong written communication skills and be able to develop working relationships with coworkers in locations around the globe. As an engineer at GitHub you'll always be challenged to solve interesting and novel problems that have real impact on how the world builds software. Responsibilities Design, build and maintain core components of the GitHub Edge stack. Cultivate GLB and other open source projects developed by GitHub and build things you are proud to share. Work closely with our application, network, observability, virtualization, and security teams to build secure, feature rich, and performant software in support of our global platform. Help to take your code to production, troubleshoot any issues that arise, and own fixing any associated bugs. Qualifications Minimum Qualifications: 5+ years of experience with Linux kernal and/or network programming. 5+ years experience with core functionality of standard protocols such as TCP, UDP, HTTP, TLS, GRE, and/or DNS. 5+ years proficiency in one (or more) language(s) like Ruby, Python, or Golang. 3+ years deploying systems with Terraform, Ansible, and/or Puppet Preferred Qualifications: Application layer DDoS remediation techniques and experience, especially in a network edge environment Knowledge of when and how to deploy web acceleration techniques (e.g. caching, persistent connections, network stack tuning). Experience diagnosing and resolving performance problems at the intersection of software and hardware. You take a pragmatic approach to decision making and design choices. Azure technologies or cloud migrations of production environments Demonstrated experience with technologies such as anycast, BGP, XDP, eBPF, or P4. Experience using GitHub as a software development platform. Comfort working as part of a geographically distributed team and in a highly available environment. Hands-on experience running services in a distributed infrastructure. Compensation Range USD $104,400.00 - USD $276,900.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Minimum Qualifications: 5+ years of experience with Linux kernal and/or network programming. 5+ years experience with core functionality of standard protocols such as TCP, UDP, HTTP, TLS, GRE, and/or DNS. 5+ years proficiency in one (or more) language(s) like Ruby, Python, or Golang. 3+ years deploying systems with Terraform, Ansible, and/or Puppet Preferred Qualifications: Application layer DDoS remediation techniques and experience, especially in a network edge environment Knowledge of when and how to deploy web acceleration techniques (e.g. caching, persistent connections, network stack tuning). Experience diagnosing and resolving performance problems at the intersection of software and hardware. You take a pragmatic approach to decision making and design choices. Azure technologies or cloud migrations of production environments Demonstrated experience with technologies such as anycast, BGP, XDP, eBPF, or P4. Experience using GitHub as a software development platform. Comfort working as part of a geographically distributed team and in a highly available environment. Hands-on experience running services in a distributed infrastructure.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542","responsibilities":"Design, build and maintain core components of the GitHub Edge stack. Cultivate GLB and other open source projects developed by GitHub and build things you are proud to share. Work closely with our application, network, observability, virtualization, and security teams to build secure, feature rich, and performant software in support of our global platform. Help to take your code to production, troubleshoot any issues that arise, and own fixing any associated bugs.","posted_date":"December 21, 2023","apply_url":"https://careers-githubinc.icims.com/jobs/2509/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2023-12-21T22:16:51Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-12-21T22:16:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":1,"uuid":"443500ae-17d7-4dfa-a313-4e2dffac0d9a"},"import_id":"ec5ec8c5-ec3e-46cf-a1c6-88ba46dedfe2","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/126729671090807494","jobHash":"7783e7a77ce23b1722563ee3bfde5bb3","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.0000717042852578733}]},"jobSummary":"Design, build and maintain core components of the GitHub Edge stack. Cultivate GLB and other open source projects developed by GitHub and build things you are proud to share. Work closely with our application, network, observability, virtualization, and security teams to build secure, feature rich, and performant software in support of our global platform. Help to take your code to production, troubleshoot any issues that arise, and own fixing any associated bugs.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2509?lang=en-us","last_mod":"2023-12-21T22:17:39+0000","gdpr":false},"create_date":"2023-12-21T22:17:39+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2507","language":"en-us","languages":["en-us"],"req_id":"2507","title":"Staff Engineering Manager","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview GitHub Issues are the foundation for planning & tracking work on GitHub. This role is an Engineering Manager on the Issues team, specifically leading the team responsible for the Issues Platform with a focus on availability, performance and evolving the architecture. As a leader and manager, you will directly influence engineering culture, mentor and grow other engineers, engage in long term architectural planning, and partner closely with key partners across the company to help deliver a highly available and scalable planning & tracking experience. While your direct team is located in Europe, you will join a fully distributed org - you will thrive in an environment of asynchronous communication. We expect you to have the ability to communicate complex technical concepts, and be able to create working relationships with coworkers in locations around the globe. Responsibilities Clear and effective communication skills, be it when you write code, send emails, or explain complex technical issues to non-technical co-workers. A desire to take up new challenges and lead a group of highly skilled, dedicated and smart engineers. You're always looking for ways we can be better as a team. Reliable and responsible work ethic. You enjoy taking on responsibility within your role, on projects you have initiated, and you also enjoy bringing out the best in your teammates. Drive to provide clarity and a shared understanding of decision making, direction, and progress for the team and the company. Qualifications Required Several years experience building and shipping software using a variety of technology stacks, or equivalent experience. Experience leading teams as people manager or technical leader Worked previously with a distributed team Experience developing a strategy and roadmap for your teams Preferred These are more specific abilities we’re looking for. Think of this as a descriptive sketch, not a checklist of requirements. Be comfortable applying even if you don’t have all of them. Passionate about fostering good engineering practices and processes Have previous experience building and maintaining highly available and scalable services. Have significant experience with one or more backend technologies: server-side environments, compute, datastores, networking, infrastructure, devops, security, and programming languages. Have significant experience with open-source software, communities, and the systems these communities use to self-organize and ship software for others. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"United Kingdom Remote","city":"Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Director"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Several years experience building and shipping software using a variety of technology stacks, or equivalent experience. Experience leading teams as people manager or technical leader Worked previously with a distributed team Experience developing a strategy and roadmap for your teams Preferred These are more specific abilities we’re looking for. Think of this as a descriptive sketch, not a checklist of requirements. Be comfortable applying even if you don’t have all of them. Passionate about fostering good engineering practices and processes Have previous experience building and maintaining highly available and scalable services. Have significant experience with one or more backend technologies: server-side environments, compute, datastores, networking, infrastructure, devops, security, and programming languages. Have significant experience with open-source software, communities, and the systems these communities use to self-organize and ship software for others.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542","responsibilities":"Clear and effective communication skills, be it when you write code, send emails, or explain complex technical issues to non-technical co-workers. A desire to take up new challenges and lead a group of highly skilled, dedicated and smart engineers. You're always looking for ways we can be better as a team. Reliable and responsible work ethic. You enjoy taking on responsibility within your role, on projects you have initiated, and you also enjoy bringing out the best in your teammates. Drive to provide clarity and a shared understanding of decision making, direction, and progress for the team and the company.","posted_date":"December 21, 2023","apply_url":"https://globalcareers-githubinc.icims.com/jobs/2507/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2023-12-21T22:17:59Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-12-21T22:17:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":1,"uuid":"ed627a48-ae64-4348-bc97-1faf6da962f6"},"import_id":"bb0e52ef-aa03-40b2-a63c-4a0258e798e2","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/143042025600492230","jobHash":"003181c03216565911efe791122ef800","derivedInfo":{"jobCategories":["MANAGEMENT","COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"Clear and effective communication skills, be it when you write code, send emails, or explain complex technical issues to non-technical co-workers. A desire to take up new challenges and lead a group of highly skilled, dedicated and smart engineers. You're always looking for ways we can be better as a team. Reliable and responsible work ethic. You enjoy taking on responsibility within your role, on projects you have initiated, and you also enjoy bringing out the best in your teammates. Drive to provide clarity and a shared understanding of decision making, direction, and progress for the team and the company.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2507?lang=en-us","last_mod":"2023-12-21T22:18:39+0000","gdpr":true},"create_date":"2023-12-21T22:18:39+0000","category":[" Engineering"],"full_location":"Remote, United Kingdom","short_location":"Remote, United Kingdom"}},{"data":{"slug":"2506","language":"en-us","languages":["en-us"],"req_id":"2506","title":"Senior Systems Engineer, Infrastructure","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is looking for a Senior Systems Engineer to join the team that provides the foundation on which the world’s largest network of code is built. We’re experiencing tremendous growth and need your help making our vision of infrastructure-at-scale a reality. Systems Engineers on the Physical Infrastructure team at GitHub are responsible for supporting the GitHub data center facilities, hardware within facilities, and day to day operations with an eye towards automation of ongoing support workloads. They manage the ordering and installation of server racks in GitHub data centers, and troubleshoot, identify, and address hardware issues as they arise and help to ensure GitHub hardware continues to support the world's code. Even more importantly they put in place systems to detect and even mitigate the same problem early the next time around. Responsibilities Maintain our global physical infrastructure within our data centers, including working closely with the data center vendors, rack integrators and cabling contractors. Work with OEMs, ODMs, and VARs to build and integrate efficient and economical break/fix processes and systems. Collaborate with network, systems, and software engineers to design and optimize our physical infrastructure. Work with our team of operations contractors and remote hands at the data centers to ensure hardware issues are addressed and remediated quickly, with minimal human touch points. Participate in an on-call rotation and quickly respond to issues and work to prevent them in the future. Partner within the team and across the organization to help with occasional major rollouts and maintenance. Some travel may be necessary. Qualifications Required Qualifications: 4+ Years experience supporting global physical infrastructure within a data center environment 2+ Years experience with shell scripting and Linux 2+ experience with high-level languages such as Ruby, Go, Rust and/or Python Preferred Qualifications: Understanding of network design, large scale topology and load balancing strategies Understanding of network engineering and compute systems Experience writing software to make managing data center infrastructure easier, faster and less labor intensive Experience with data center design, and how data centers operate, including power, cooling and facility management Experience with open compute standards Experience with configuration management software such as Puppet, Chef, Ansible, or Salt. Experience diagnosing and resolving performance and reliability problems at the intersection of hardware and software Strong verbal and written communication skills and the desire to continue to further cultivate technical skills A pragmatic approach to decision making and design choices Compensation Range USD $104,400.00 - USD $276,900.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 4+ Years experience supporting global physical infrastructure within a data center environment 2+ Years experience with shell scripting and Linux 2+ experience with high-level languages such as Ruby, Go, Rust and/or Python Preferred Qualifications: Understanding of network design, large scale topology and load balancing strategies Understanding of network engineering and compute systems Experience writing software to make managing data center infrastructure easier, faster and less labor intensive Experience with data center design, and how data centers operate, including power, cooling and facility management Experience with open compute standards Experience with configuration management software such as Puppet, Chef, Ansible, or Salt. Experience diagnosing and resolving performance and reliability problems at the intersection of hardware and software Strong verbal and written communication skills and the desire to continue to further cultivate technical skills A pragmatic approach to decision making and design choices","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542","responsibilities":"Maintain our global physical infrastructure within our data centers, including working closely with the data center vendors, rack integrators and cabling contractors. Work with OEMs, ODMs, and VARs to build and integrate efficient and economical break/fix processes and systems. Collaborate with network, systems, and software engineers to design and optimize our physical infrastructure. Work with our team of operations contractors and remote hands at the data centers to ensure hardware issues are addressed and remediated quickly, with minimal human touch points. Participate in an on-call rotation and quickly respond to issues and work to prevent them in the future. Partner within the team and across the organization to help with occasional major rollouts and maintenance. Some travel may be necessary.","posted_date":"December 21, 2023","apply_url":"https://careers-githubinc.icims.com/jobs/2506/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2023-12-21T22:17:12Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-12-21T22:16:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":1,"uuid":"52686a18-9803-446c-b3fb-2de41ba289d6"},"import_id":"535ddb27-0f23-49dd-aecc-359597a65549","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/111318916115899078","jobHash":"8f8dcfac2de8a7af030d4bee40eaf14a","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.0000717042852578733}]},"jobSummary":"Maintain our global physical infrastructure within our data centers, including working closely with the data center vendors, rack integrators and cabling contractors. Work with OEMs, ODMs, and VARs to build and integrate efficient and economical break/fix processes and systems. Collaborate with network, systems, and software engineers to design and optimize our physical infrastructure. Work with our team of operations contractors and remote hands at the data centers to ensure hardware issues are addressed and remediated quickly, with minimal human touch points. Participate in an on-call rotation and quickly respond to issues and work to prevent them in the future. Partner within the team and across the organization to help with occasional major rollouts and maintenance. Some travel may be necessary.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2506?lang=en-us","last_mod":"2023-12-21T22:17:39+0000","gdpr":false},"create_date":"2023-12-21T22:17:39+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2411","language":"en-us","languages":["en-us"],"req_id":"2411","title":"Senior Software Engineer, Copilot","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub Copilot is changing the way the world builds software, and we want you to help build Copilot! We’re looking for a Senior level Software Engineer to join the team building Copilot chat in GitHub.com. As a Senior Software Engineer on the Copilot chat team, you will work closely with a distributed, diverse, and passionate team of engineers, product managers, and designers across multiple teams at GitHub to build and improve Copilot capabilities across GitHub.com. Responsibilities Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support observability of a highly available service used by millions of users on a daily basis to support its availability and performance through telemetry, alerts, and SLOs Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you Qualifications Required Qualifications: 6+ years of experience as a software engineer Experience designing, building, scaling and maintaining distributed systems Experience in testing, production system monitoring, and observability Preferred Qualifications: Experience with Go and related tooling Interest or prior experience in modern AI/machine learning technologies, Large Language Models or similar Track record of strong analytical skills as well as communication skills both verbal and written. Strong customer focus and data driven approach Passionate about fostering good engineering practices and processes Experience effectively contributing to technical strategy and roadmaps Compensation Range USD $104,400.00 - USD $276,900.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 6+ years of experience as a software engineer Experience designing, building, scaling and maintaining distributed systems Experience in testing, production system monitoring, and observability Preferred Qualifications: Experience with Go and related tooling Interest or prior experience in modern AI/machine learning technologies, Large Language Models or similar Track record of strong analytical skills as well as communication skills both verbal and written. Strong customer focus and data driven approach Passionate about fostering good engineering practices and processes Experience effectively contributing to technical strategy and roadmaps","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542","responsibilities":"Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support observability of a highly available service used by millions of users on a daily basis to support its availability and performance through telemetry, alerts, and SLOs Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you","posted_date":"December 20, 2023","apply_url":"https://careers-githubinc.icims.com/jobs/2411/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2023-12-20T21:20:53Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-12-20T17:12:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":2,"uuid":"7b630e6a-1452-4126-84a5-2b8359547f5d"},"import_id":"9c1ed52c-f9ea-4080-bfda-2e029af333de","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/74381890280137414","jobHash":"6132c66f2ceb35142df5666a7c9be5c2","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.0000717042852578733}]},"jobSummary":"Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support observability of a highly available service used by millions of users on a daily basis to support its availability and performance through telemetry, alerts, and SLOs Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2411?lang=en-us","last_mod":"2023-12-20T21:21:39+0000","gdpr":false},"update_date":"2023-12-20T21:21:39+0000","create_date":"2023-12-20T17:12:39+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2434","language":"en-us","languages":["en-us"],"req_id":"2434","title":"Senior Director, Software Engineering","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is changing the way the world builds software, and we want you to help build GitHub! We’re looking for an experienced Senior Director of Engineering to join the Platform and Enterprise organization and lead the infrastructure teams. GitHub is a company at the center of software, where projects are developed, orchestrated, and deployed. GitHub infrastructure is critical to our customers in the way the power grid is critical to the manufacturing industry. Our customers depend on GitHub as a central workspace where they develop solutions for their own customers. The reward for this important role is a unique impact on creativity within the software development universe. With it comes the responsibility to view ourselves as the world’s production environment. One that needs to be as reliable as the power grid. This role will be involved in the design, rollout and support of highly performant, highly scalable, and highly available services and infrastructure across GitHub datacenters and cloud providers. This team provides the platform for internal engineering teams to build GitHub itself. We pride ourselves on being thoughtful, intentional, and productive. We hope you do as well. Responsibilities Own GitHub’s datacenter & cloud infrastructure, ensuring availability, scalability, and security Manage and mentor engineering managers and foster a culture of innovation, collaboration, and excellence Develop and communicate a technical strategy for infrastructure while aligning it with the broader organization’s platform vision Lead engineering teams to deliver and maintain high availability services, guaranteeing exceptional performance and reliability, participate in a manager on-call rotation, and respond to incidents as necessary Oversee and guide distributed engineering teams, leveraging remote and asynchronous work best practices and cultivating collaboration Effectively communicate to technical and non-technical stakeholders Drive data-centric progress in engineering best practices, quality, and efficiency Qualifications Required Qualifications: 8+ years developing web applications and distributed systems 4+ years of experience operating data center infrastructure on prem and/or in the cloud 4+ years of experience leading engineering teams 2+ years of experience managing through managers Preferred Qualifications: Excellent written and verbal communication skills Experience working remotely and leading distributed teams Experience recruiting and retaining healthy teams, managing performance, and calibrating expectations Prior experience migrating from data center to cloud infrastructure Experience designing large scale cloud services and distributed systems Experience maintaining production environments including monitoring, observability, and incident remediation Experience with cloud platforms like Microsoft Azure and Amazon Web Services Strong focus on customer and data driven decision making Excellent analytical skills when proactively identifying risks and balancing priorities Experience with Golang and Ruby Experience with relational databases Ability to meet GitHub, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft, GitHub’s parent company, Cloud Screen upon hire/transfer and every two years thereafter. Compensation Range USD $134,800.00 - USD $357,500.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Senior Director"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 8+ years developing web applications and distributed systems 4+ years of experience operating data center infrastructure on prem and/or in the cloud 4+ years of experience leading engineering teams 2+ years of experience managing through managers Preferred Qualifications: Excellent written and verbal communication skills Experience working remotely and leading distributed teams Experience recruiting and retaining healthy teams, managing performance, and calibrating expectations Prior experience migrating from data center to cloud infrastructure Experience designing large scale cloud services and distributed systems Experience maintaining production environments including monitoring, observability, and incident remediation Experience with cloud platforms like Microsoft Azure and Amazon Web Services Strong focus on customer and data driven decision making Excellent analytical skills when proactively identifying risks and balancing priorities Experience with Golang and Ruby Experience with relational databases Ability to meet GitHub, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft, GitHub’s parent company, Cloud Screen upon hire/transfer and every two years thereafter.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542","responsibilities":"Own GitHub’s datacenter & cloud infrastructure, ensuring availability, scalability, and security Manage and mentor engineering managers and foster a culture of innovation, collaboration, and excellence Develop and communicate a technical strategy for infrastructure while aligning it with the broader organization’s platform vision Lead engineering teams to deliver and maintain high availability services, guaranteeing exceptional performance and reliability, participate in a manager on-call rotation, and respond to incidents as necessary Oversee and guide distributed engineering teams, leveraging remote and asynchronous work best practices and cultivating collaboration Effectively communicate to technical and non-technical stakeholders Drive data-centric progress in engineering best practices, quality, and efficiency","posted_date":"December 19, 2023","apply_url":"https://careers-githubinc.icims.com/jobs/2434/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2023-12-19T23:52:29Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-12-19T23:52:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":1,"uuid":"0f956533-f5fe-482a-9913-840497db5911"},"import_id":"4e52203f-450e-49ec-bd2b-156db170d867","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/120294583868236486","jobHash":"8bd44b68a12a69fa7731e4bb3530d3f0","derivedInfo":{"jobCategories":["MANAGEMENT","COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.0000717042852578733}]},"jobSummary":"Own GitHub’s datacenter & cloud infrastructure, ensuring availability, scalability, and security Manage and mentor engineering managers and foster a culture of innovation, collaboration, and excellence Develop and communicate a technical strategy for infrastructure while aligning it with the broader organization’s platform vision Lead engineering teams to deliver and maintain high availability services, guaranteeing exceptional performance and reliability, participate in a manager on-call rotation, and respond to incidents as necessary Oversee and guide distributed engineering teams, leveraging remote and asynchronous work best practices and cultivating collaboration Effectively communicate to technical and non-technical stakeholders Drive data-centric progress in engineering best practices, quality, and efficiency","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2434?lang=en-us","last_mod":"2023-12-19T23:52:39+0000","gdpr":false},"create_date":"2023-12-19T23:52:39+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2423","language":"en-us","languages":["en-us"],"req_id":"2423","title":"Software Engineer III","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is changing the way the world builds software, and we want you to help build GitHub! We’re looking for a Software Engineer 3 to join the Actions Mac Cloud Platform and Infrastructure Team to work primarily on the software that manages our hardware. Actions Mac Cloud owns the end to end lifecycle of the fleet of machines that power all our hosted Mac runners for GitHub Actions. This includes: Obtaining, provisioning, and deploying hardware Building software to provision, manage, and secure the Mac hardware and virtual machines Interfacing with multiple vendors and engineering teams to accomplish the above Actions is a core part of GitHub and enables developers around the world. Millions of GitHub customers will rely on your team's work every single day. In this role, you’ll collaborate closely with product and distributed engineers to grow and improve MacCloud with security, reliability, and operational efficiency at the forefront. The people on our teams believe that creating great products for GitHub users is a ton of fun, and you’ll be inspired by the opportunity to help enable developers all over the world to build world-changing things with our tools. Responsibilities Write, review, and maintain code to manage, monitor, and maintain our fleet of Macs using reusable code and tooling, primarily in Go Document the systems you help build. Participate in on-call rotations with your team. Triage and respond to issues and advocate for opportunities to improve service health. Support a highly available service used by millions of users on a daily basis If interested, opportunity to evolve and improve our physical hardware design, involving rack management, networking, cooling etc Qualifications Required Qualifications: 2+ years of experience as a software engineer OR 5+ years of combined experience in technical customer support, server administration, network administration, IT, or similar with proven track record of building, maintaining, and debugging software tools Bachelor's degree in Computer Science or related field or equivalent experience Preferred Qualifications 1+ years of experience delivering high availability, enterprise grade services, including monitoring, observability and diagnosing problems 1+ years of experience developing backend services for large scale systems. Excellent analytical skills as well as communication skills both verbal and written. We’re a distributed team so we’re extra mindful about communication. Experience in Golang, C#, and/or Azure Experience with SQL, Kusto Query Language, or general database knowledge Experience in and passion for mentoring Experience working with data centers and vendors Ability to meet GitHub, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft, GitHub’s parent company, Cloud Screen upon hire/transfer and every two years thereafter. Compensation Range USD $90,700.00 - USD $240,500.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 2+ years of experience as a software engineer OR 5+ years of combined experience in technical customer support, server administration, network administration, IT, or similar with proven track record of building, maintaining, and debugging software tools Bachelor's degree in Computer Science or related field or equivalent experience Preferred Qualifications 1+ years of experience delivering high availability, enterprise grade services, including monitoring, observability and diagnosing problems 1+ years of experience developing backend services for large scale systems. Excellent analytical skills as well as communication skills both verbal and written. We’re a distributed team so we’re extra mindful about communication. Experience in Golang, C#, and/or Azure Experience with SQL, Kusto Query Language, or general database knowledge Experience in and passion for mentoring Experience working with data centers and vendors Ability to meet GitHub, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft, GitHub’s parent company, Cloud Screen upon hire/transfer and every two years thereafter.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542","responsibilities":"Write, review, and maintain code to manage, monitor, and maintain our fleet of Macs using reusable code and tooling, primarily in Go Document the systems you help build. Participate in on-call rotations with your team. Triage and respond to issues and advocate for opportunities to improve service health. Support a highly available service used by millions of users on a daily basis If interested, opportunity to evolve and improve our physical hardware design, involving rack management, networking, cooling etc","posted_date":"December 19, 2023","apply_url":"https://careers-githubinc.icims.com/jobs/2423/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2023-12-20T15:00:55Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-12-19T22:48:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":2,"uuid":"39e274f1-e12c-49ef-8543-9c2ed338b9f6"},"import_id":"6e22f3c0-9e39-443b-8740-7751a0e5633d","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/111465402417980102","jobHash":"372927505b40eccd54e55ff0619b4548","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.0000717042852578733}]},"jobSummary":"Write, review, and maintain code to manage, monitor, and maintain our fleet of Macs using reusable code and tooling, primarily in Go Document the systems you help build. Participate in on-call rotations with your team. Triage and respond to issues and advocate for opportunities to improve service health. Support a highly available service used by millions of users on a daily basis If interested, opportunity to evolve and improve our physical hardware design, involving rack management, networking, cooling etc","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2423?lang=en-us","last_mod":"2023-12-20T15:01:40+0000","gdpr":false},"update_date":"2023-12-20T15:01:40+0000","create_date":"2023-12-19T22:48:39+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2433","language":"en-us","languages":["en-us"],"req_id":"2433","title":"Senior Software Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub Copilot has changed the way software is built, and we have a unique opportunity to look further ahead to identify how software development can be faster, safer, easier, and more accessible. We’re looking for a talented and experienced Software Engineer to join us in this mission! GitHub Copilot Platform has a crucial role in advancing the core intelligence solutions that power the Copilot features in GitHub. GitHub Copilot Foundations owns the continued global scaling of GitHub’s code completion features and the expanding feature set to continue its industry-leading position. Both teams are also focused on ensuring other engineering teams at GitHub have the tools and processes necessary to build on top of our platform with as little friction as possible. As a Senior Software Engineer on the Copilot Platform or Foundations Team, you will work closely with a distributed, diverse, and passionate team of engineers and product managers with multiple teams across GitHub and Microsoft to improve and maintain our Platform that integrators depend on in their software development cycle. Together, we are dedicated to shaping the future of software development by continuously enhancing AI-powered capabilities in GitHub and beyond. The Copilot team is highly distributed and you will thrive in an environment of remote work and asynchronous communication. You're expected to have strong written communication skills and be able to develop working relationships with coworkers in locations around the globe. As an engineer at GitHub you'll always be challenged to solve interesting and novel problems that have real impact on how the world builds software. Responsibilities Lead technical decision making and architecture Design and implement scalable, reliable and performant solutions for problems like rate-limiting, request routing, etc. Write, review, and maintain code primarily in Go Mentor other engineers in their technical and architectural decision making Qualifications Required Qualifications: 3+ years experience building high traffic services at scale 2+ years experience building and/or consuming REST-style APIs Experience architecting highly available, high volume APIs Bachelor's degree or equivalent experience Preferred Qualifications: Experience with Go and related tooling Experience with distributed systems at global scale Experience working with a remote, distributed team Interest or prior experience in modern AI/machine learning technologies, Large Language Models or similar Passionate about fostering good API Design practices and processes Excellent written and verbal communication skills Compensation Range USD $104,400.00 - USD $276,900.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 3+ years experience building high traffic services at scale 2+ years experience building and/or consuming REST-style APIs Experience architecting highly available, high volume APIs Bachelor's degree or equivalent experience Preferred Qualifications: Experience with Go and related tooling Experience with distributed systems at global scale Experience working with a remote, distributed team Interest or prior experience in modern AI/machine learning technologies, Large Language Models or similar Passionate about fostering good API Design practices and processes Excellent written and verbal communication skills","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542","responsibilities":"Lead technical decision making and architecture Design and implement scalable, reliable and performant solutions for problems like rate-limiting, request routing, etc. Write, review, and maintain code primarily in Go Mentor other engineers in their technical and architectural decision making","posted_date":"December 19, 2023","apply_url":"https://careers-githubinc.icims.com/jobs/2433/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2023-12-20T15:00:57Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-12-19T21:04:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":2,"uuid":"4368fb69-f4b3-4f74-82fe-d8e66d47a27d"},"import_id":"bd7831fd-58d6-405a-8468-78ce7dd8dfb1","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/81239484173034182","jobHash":"dff35dca8e03d0b21d8fe8ca9eab8fc2","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.0000717042852578733}]},"jobSummary":"Lead technical decision making and architecture Design and implement scalable, reliable and performant solutions for problems like rate-limiting, request routing, etc. Write, review, and maintain code primarily in Go Mentor other engineers in their technical and architectural decision making","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2433?lang=en-us","last_mod":"2023-12-20T15:01:40+0000","gdpr":false},"update_date":"2023-12-20T15:01:40+0000","create_date":"2023-12-19T21:04:39+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2443","language":"en-us","languages":["en-us"],"req_id":"2443","title":"Staff Software Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, Spain Overview Do you want to be part of the team that builds the future of developer productivity and collaboration at GitHub? Our team enables customers to bring their ideas to life, innovate and collaborate throughout the whole project lifecycle. GitHub Notifications is the heart of developer collaboration, focus and productivity, and we are building a new underlying platform to support the 100M+ notifications we deliver per day to the world’s software developers. Enhance the collaboration experience at GitHub by working closely with a community of engineers and designers with a distributed, diverse and passionate team delivering the services that millions of developers depend on. In this role you will design, prototype, implement, ship and support highly performant and inspiring user experiences with your team. We are looking for creative problem solvers and diverse thinkers, people who care about culture as well as customers and features. We believe that how we do things is as important as what we do. Big vision, a common purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what lead to great results. Great products reflect the teams that build them. #GitHubJobs A day in the life: Our team is distributed worldwide, which means we work asynchronously most of the time. Your typical week would include: Collaborating with design, analytics, support, and product management to understand the problems we want to solve and exploring how we can solve them Discussing and collaboratively solving engineering and product problems with collaborators in Slack or Zoom Opening a Pull Request to implement the next most important feature or fix the most critical bug Trying to reproduce a reported bug and responding to issues we’ve received from the community Reviewing your teammates' Pull Requests and providing helpful feedback Working with your engineering manager in your one-on-one meetings to grow your team and career Responsibilities Responsibilities: Scope out and implement technical solutions that scale across multiple GitHub services Become intimately familiar with the systems you build and take pride in writing maintainable code Write, review and maintain code primarily in TypeScript and Ruby Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others Qualifications Required Qualifications: Experience in running services in production at scale with modern web stacks (e.g. Rails, TypeScript(Node.js), mySQL, Kafka...) and proficiency in NodeJS development Experience designing, building and running data-extensive event-driven architectures. Experience in technical leadership that includes driving technical decisions and guiding broader project goals. Excellent in data analytics and data driven decisions. Preferred Qualifications: Experience working remotely as part of a software engineering team. Experience working in Ruby. Effective communicator, be it when you write code, write emails, or explain complex technical issues to non-technical co-workers. Passionate and self-motivated, with a demonstrated ability to work in a fast-paced environment GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"Spain Remote","city":"Remote","country":"Spain","country_code":"ES","location_type":"ANY","latitude":40.46366700000001,"longitude":-3.74922,"categories":[{"name":"Engineering"}],"tags2":["ES-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications: Experience in running services in production at scale with modern web stacks (e.g. Rails, TypeScript(Node.js), mySQL, Kafka...) and proficiency in NodeJS development Experience designing, building and running data-extensive event-driven architectures. Experience in technical leadership that includes driving technical decisions and guiding broader project goals. Excellent in data analytics and data driven decisions. Preferred Qualifications: Experience working remotely as part of a software engineering team. Experience working in Ruby. Effective communicator, be it when you write code, write emails, or explain complex technical issues to non-technical co-workers. Passionate and self-motivated, with a demonstrated ability to work in a fast-paced environment","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542","responsibilities":"Responsibilities: Scope out and implement technical solutions that scale across multiple GitHub services Become intimately familiar with the systems you build and take pride in writing maintainable code Write, review and maintain code primarily in TypeScript and Ruby Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others","posted_date":"December 18, 2023","apply_url":"https://globalcareers-githubinc.icims.com/jobs/2443/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2023-12-19T14:58:49Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-12-18T18:54:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":2,"uuid":"b4285b2a-9ce3-414e-9594-c7f55330abc9"},"import_id":"15c8fbaa-c72a-4953-a852-16546134a727","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/133207690806469318","jobHash":"a663cdc3531c8918a213732cf18038ff","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":40.46366700000001,"longitude":-3.74922},"locationType":"COUNTRY","postalAddress":{"addressLines":["Spain"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"ES","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.8389569422276115}]},"jobSummary":"Responsibilities: Scope out and implement technical solutions that scale across multiple GitHub services Become intimately familiar with the systems you build and take pride in writing maintainable code Write, review and maintain code primarily in TypeScript and Ruby Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2443?lang=en-us","last_mod":"2023-12-19T14:59:39+0000","gdpr":true},"update_date":"2023-12-19T14:59:39+0000","create_date":"2023-12-18T18:54:39+0000","category":[" Engineering"],"full_location":"Remote, Spain","short_location":"Remote, Spain"}}],"totalCount":29,"count":29,"filter":{"displayLimit":10,"categories":{"all":[{"category":"Engineering","numJobs":29}],"shortlist":[{"category":"Engineering","numJobs":29}]},"brands":{"all":[],"shortlist":[]},"experienceLevels":{"all":[],"shortlist":[]},"locations":{"all":[{"city":"Remote","state":null,"country":"Germany","count":2},{"city":"Remote","state":null,"country":"Spain","count":1},{"city":"Remote","state":null,"country":"United Kingdom","count":5},{"city":"Remote","state":null,"country":"United States","count":21}],"shortlist":[{"city":"Remote","state":null,"country":"Germany","count":2},{"city":"Remote","state":null,"country":"Spain","count":1},{"city":"Remote","state":null,"country":"United Kingdom","count":5},{"city":"Remote","state":null,"country":"United States","count":21}]},"facetList":{"tags4":[{"term":"Experienced Professional","count":29}],"tags5":[{"term":"Individual Contributor","count":27},{"term":"Director","count":1},{"term":"Senior Director","count":1}],"tags6":[{"term":"Yes","count":29}]}},"languageCounts":{"en-us":{"displayName":"English","count":29}},"request_id":false,"meta_data":{"ResponseMetadata":{"requestId":"34fb36ce-860b-451b-b513-b2301b8c3bfd:APAb7ISqWrK6fOptMCcu3tuyFmJmQezvlg=="}},"locations":[]}