{"jobs":[{"data":{"slug":"2412","language":"en-us","languages":["en-us"],"req_id":"2412","title":"Senior Software Engineer, Projects","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview Join us in shaping the future of GitHub Projects as a full-stack (Rails + React) Senior Software Engineer. In this role, you’ll work closely with a diverse and passionate community of engineers, product managers, and designers to build amazing project management features on GitHub. Want to see what you’ll work on? Learn more about GitHub’s project management tools here. We are looking for an empathetic and creative problem solver who will make positive contributions to the team through both code and culture. We believe that how we do things is as important as what we ship and that great products ultimately reflect the teams that build them. A week in the life: Although your core team will be based in North America, GitHub is distributed worldwide, which means we often work asynchronously. Your typical week will include: Collaborating with other members of the team in engineering, product, and design to understand the problems we want to solve and figuring out how we can solve them Pairing with other engineers in Slack or Zoom Opening Pull Requests to implement features or fix bugs Reviewing your teammates' Pull Requests and providing helpful and constructive feedback Working closely with your engineering manager in team and one-on-one meetings to grow your team and career Responsibilities Write, review and maintain code primarily in Ruby (Rails) and Javascript (React, Typescript) Scope and implement technical solutions that scale across multiple GitHub services Become intimately familiar with the systems you build and take pride in writing maintainable code Write architecture proposals, carry out code experiments, and build prototypes Provide technical leadership, mentorship, pairing opportunities, and code reviews to grow other engineers Qualifications Required Qualifications: 5+ years of experience as a software engineer 3+ years of hands-on experience in Rails or React Experience building real-time web applications at scale Experience breaking down complex problems into smaller tasks, weighing tradeoffs between maintainability and tempo Preferred Qualifications: Experience writing code with security, accessibility, and availability in mind Proven track record of clear and effective communication with code, pull request descriptions, discussion posts, or complex technical issues. Self-motivated; you know how to get things done and move with momentum, but you also know how to reach out for help when you need it Compensation Range USD $104,400.00 - USD $276,900.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 5+ years of experience as a software engineer 3+ years of hands-on experience in Rails or React Experience building real-time web applications at scale Experience breaking down complex problems into smaller tasks, weighing tradeoffs between maintainability and tempo Preferred Qualifications: Experience writing code with security, accessibility, and availability in mind Proven track record of clear and effective communication with code, pull request descriptions, discussion posts, or complex technical issues. Self-motivated; you know how to get things done and move with momentum, but you also know how to reach out for help when you need it","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542","responsibilities":"Write, review and maintain code primarily in Ruby (Rails) and Javascript (React, Typescript) Scope and implement technical solutions that scale across multiple GitHub services Become intimately familiar with the systems you build and take pride in writing maintainable code Write architecture proposals, carry out code experiments, and build prototypes Provide technical leadership, mentorship, pairing opportunities, and code reviews to grow other engineers","posted_date":"December 15, 2023","apply_url":"https://careers-githubinc.icims.com/jobs/2412/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2023-12-15T23:01:15Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-12-15T19:39:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":3,"uuid":"97d71389-8004-4eea-be1b-18cceb0fd0a3"},"import_id":"4ad19633-306f-4e2e-b0ea-beaeda78a73c","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/72101381831303878","jobHash":"bad9160acb43755d405a4e857c9910f0","derivedInfo":{"jobCategories":["SCIENCE_AND_ENGINEERING","COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.0000717042852578733}]},"jobSummary":"Write, review and maintain code primarily in Ruby (Rails) and Javascript (React, Typescript) Scope and implement technical solutions that scale across multiple GitHub services Become intimately familiar with the systems you build and take pride in writing maintainable code Write architecture proposals, carry out code experiments, and build prototypes Provide technical leadership, mentorship, pairing opportunities, and code reviews to grow other engineers","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2412?lang=en-us","last_mod":"2023-12-15T23:02:11+0000","gdpr":false},"update_date":"2023-12-15T23:02:11+0000","create_date":"2023-12-15T19:40:11+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2395","language":"en-us","languages":["en-us"],"req_id":"2395","title":"Staff Software Engineer, Codespaces","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is changing the way the world builds software, and we want you to help build GitHub. We’re looking for software engineers to join a passionate, collaborative, distributed group of engineers on our team. With Codespaces, we’re building and operating a new type of software development platform: instant-on, remote, container-based cloud development environments. In this model, Engineers work in cloud development environments — tailored for a specific project — where the overhead of launching a task-specific workbench is effectively zero. Work on a bug, review a change, or just try something out, all booted from a clean baseline ready for your commits. Our goal is for developers to spend more of their time writing code and less managing their environments. In this role you will play a critical role in shaping and implementing the future of the Codespaces product. You will work directly with developers and customers to help define the future of cloud development environments. You will work with a strong team of developers to design and build a platform that is secure, reliable and most of all fun to develop on. Note, this Staff position is not only one where you get to design solutions, but one where you will have the opportunity to write/ship large amounts of code/features as part of the job. Responsibilities Contribute as a leader and influencer for Codespaces engineering Maintain a high bar for developer experience and championing technical excellence Contribute where needed: from abstract design stages through to writing/reviewing code Review code and provide thoughtful, constructive feedback during code reviews Lead conversations around technical issues and engineering practices Participate in on-call rotations with your team Write clear positions or internal RFC for challenging technical problems Collaboratively define, scope, prioritize, and estimate work Work directly with customers and colleagues, debugging and otherwise advising Provide compassionate technical mentorship, pairing opportunities, and code reviews Offer and receive feedback to grow yourself and the team Qualifications Required Qualifications: 8+ years of hands-on experience as a full-time professional coder, demonstrating a deep understanding of programming languages such as C#, Ruby on Rails, Typescript, or similar languages Proven experience in technical leadership roles, such as a tech lead, team lead, or equivalent, showcasing the ability to guide and lead teams in achieving technical objectives Strong communication skills with the ability to articulate complex technical concepts to both technical and non-technical stakeholders, influencing and driving consensus among diverse audiences In-depth knowledge and practical experience in testing, profiling, and debugging practices, along with a track record of building, operating, and maintaining resilient, scalable distributed services Ability to meet GitHub, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft, GitHub’s parent company, Cloud Screen upon hire/transfer and every two years thereafter. Preferred Qualifications: Proven experience working asynchronously on a remote, distributed team, demonstrating adaptability and effective communication in a virtual work environment High degree of developer empathy, coupled with a passion for enhancing developer experience and tools Strong advocacy for fostering good engineering practices and processes Excellent analytical and communication skills, both verbal and written, emphasizing the ability to articulate complex ideas within a distributed team context Strong customer focus and a data-driven approach, showcasing an orientation towards delivering solutions that align with user needs and business objectives Broad technical proficiency, including experience in Rust, C#, and/or Azure, along with familiarity in SQL, Kusto Query Language, general database knowledge, Kubernetes, and or cloud-native service concepts A passion for mentoring and collaborating with peers throughout the organization, including experience in data centers and with vendors Compensation Range USD $118,100.00 - USD $313,300.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 8+ years of hands-on experience as a full-time professional coder, demonstrating a deep understanding of programming languages such as C#, Ruby on Rails, Typescript, or similar languages Proven experience in technical leadership roles, such as a tech lead, team lead, or equivalent, showcasing the ability to guide and lead teams in achieving technical objectives Strong communication skills with the ability to articulate complex technical concepts to both technical and non-technical stakeholders, influencing and driving consensus among diverse audiences In-depth knowledge and practical experience in testing, profiling, and debugging practices, along with a track record of building, operating, and maintaining resilient, scalable distributed services Ability to meet GitHub, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft, GitHub’s parent company, Cloud Screen upon hire/transfer and every two years thereafter. Preferred Qualifications: Proven experience working asynchronously on a remote, distributed team, demonstrating adaptability and effective communication in a virtual work environment High degree of developer empathy, coupled with a passion for enhancing developer experience and tools Strong advocacy for fostering good engineering practices and processes Excellent analytical and communication skills, both verbal and written, emphasizing the ability to articulate complex ideas within a distributed team context Strong customer focus and a data-driven approach, showcasing an orientation towards delivering solutions that align with user needs and business objectives Broad technical proficiency, including experience in Rust, C#, and/or Azure, along with familiarity in SQL, Kusto Query Language, general database knowledge, Kubernetes, and or cloud-native service concepts A passion for mentoring and collaborating with peers throughout the organization, including experience in data centers and with vendors","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542","responsibilities":"Contribute as a leader and influencer for Codespaces engineering Maintain a high bar for developer experience and championing technical excellence Contribute where needed: from abstract design stages through to writing/reviewing code Review code and provide thoughtful, constructive feedback during code reviews Lead conversations around technical issues and engineering practices Participate in on-call rotations with your team Write clear positions or internal RFC for challenging technical problems Collaboratively define, scope, prioritize, and estimate work Work directly with customers and colleagues, debugging and otherwise advising Provide compassionate technical mentorship, pairing opportunities, and code reviews Offer and receive feedback to grow yourself and the team","posted_date":"December 1, 2023","apply_url":"https://careers-githubinc.icims.com/jobs/2395/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2023-12-15T16:56:33Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-12-01T19:22:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":12,"uuid":"205a5baa-863e-4aaa-8964-fccc0a39ffe4"},"import_id":"4285a412-f22f-4111-9ddf-178984660f09","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/100230691825820358","jobHash":"cc63e291fe49e90a7e976b018faf542c","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.0000717042852578733}]},"jobSummary":"Contribute as a leader and influencer for Codespaces engineering Maintain a high bar for developer experience and championing technical excellence Contribute where needed: from abstract design stages through to writing/reviewing code Review code and provide thoughtful, constructive feedback during code reviews Lead conversations around technical issues and engineering practices Participate in on-call rotations with your team Write clear positions or internal RFC for challenging technical problems Collaboratively define, scope, prioritize, and estimate work Work directly with customers and colleagues, debugging and otherwise advising Provide compassionate technical mentorship, pairing opportunities, and code reviews Offer and receive feedback to grow yourself and the team","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2395?lang=en-us","last_mod":"2023-12-15T16:57:12+0000","gdpr":false},"update_date":"2023-12-15T16:57:12+0000","create_date":"2023-12-01T19:23:17+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2391","language":"en-us","languages":["en-us"],"req_id":"2391","title":"Senior Software Engineer, Copilot Platform","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub Copilot has changed the way software is built, and we have a unique opportunity to look further ahead to identify how software development can be faster, safer, easier, and more accessible. We’re looking for a talented and experienced Software Engineer to join us in this mission! GitHub Copilot Platform has a crucial role in advancing the core intelligence solutions that power the Copilot features in GitHub. GitHub Copilot Foundations owns the continued global scaling of GitHub’s code completion features and the expanding feature set to continue its industry-leading position. Both teams are also focused on ensuring other engineering teams at GitHub have the tools and processes necessary to build on top of our platform with as little friction as possible. As a Senior Software Engineer on the Copilot Platform or Foundations Team, you will work closely with a distributed, diverse, and passionate team of engineers and product managers with multiple teams across GitHub and Microsoft to improve and maintain our Platform that integrators depend on in their software development cycle. Together, we are dedicated to shaping the future of software development by continuously enhancing AI-powered capabilities in GitHub and beyond. The Copilot team is highly distributed and you will thrive in an environment of remote work and asynchronous communication. You're expected to have strong written communication skills and be able to develop working relationships with coworkers in locations around the globe. As an engineer at GitHub you'll always be challenged to solve interesting and novel problems that have real impact on how the world builds software. Responsibilities Lead technical decision making and architecture Design and implement scalable, reliable and performant solutions for problems like rate-limiting, request routing, etc. Write, review, and maintain code primarily in Go Mentor other engineers in their technical and architectural decision making Qualifications Required Qualifications: 3+ years experience building high traffic services at scale 2+ years experience building and/or consuming REST-style APIs 1+ years experience architecting highly available, high volume APIs Preferred Qualifications: Experience with Go and related tooling Experience with distributed systems at global scale Experience working with a remote, distributed team Excellent written and verbal communication skills Interest or prior experience in modern AI/machine learning technologies, Large Language Models or similar Passionate about fostering good API Design practices and processes Compensation Range USD $104,400.00 - USD $276,900.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications: 3+ years experience building high traffic services at scale 2+ years experience building and/or consuming REST-style APIs 1+ years experience architecting highly available, high volume APIs Preferred Qualifications: Experience with Go and related tooling Experience with distributed systems at global scale Experience working with a remote, distributed team Excellent written and verbal communication skills Interest or prior experience in modern AI/machine learning technologies, Large Language Models or similar Passionate about fostering good API Design practices and processes","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542","responsibilities":"Lead technical decision making and architecture Design and implement scalable, reliable and performant solutions for problems like rate-limiting, request routing, etc. Write, review, and maintain code primarily in Go Mentor other engineers in their technical and architectural decision making","posted_date":"November 29, 2023","apply_url":"https://careers-githubinc.icims.com/jobs/2391/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2023-11-29T23:40:21Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-11-29T23:40:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":1,"uuid":"f4c4df44-cf0d-482d-9fe7-330e23fafbb8"},"import_id":"23e75d26-34b9-43ce-b5ff-7857bf61639c","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/77028592371802822","jobHash":"c0fd0e42d45c083597f0a9a37805cdc3","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.0000717042852578733}]},"jobSummary":"Lead technical decision making and architecture Design and implement scalable, reliable and performant solutions for problems like rate-limiting, request routing, etc. Write, review, and maintain code primarily in Go Mentor other engineers in their technical and architectural decision making","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2391?lang=en-us","last_mod":"2023-11-29T23:40:53+0000","gdpr":false},"create_date":"2023-11-29T23:40:53+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2405","language":"en-us","languages":["en-us"],"req_id":"2405","title":"Senior Software Engineer, Copilot Platform","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview GitHub Copilot has changed the way software is built, and we have a unique opportunity to look further ahead to identify how software development can be faster, safer, easier, and more accessible. We’re looking for a talented and experienced Software Engineer to join us in this mission! GitHub Copilot Platform has a crucial role in advancing the core intelligence solutions that power the Copilot features in GitHub. GitHub Copilot Foundations owns the continued global scaling of GitHub’s code completion features and the expanding feature set to continue its industry-leading position. Both teams are also focused on ensuring other engineering teams at GitHub have the tools and processes necessary to build on top of our platform with as little friction as possible. As a Senior Software Engineer on the Copilot Platform or Foundations Team, you will work closely with a distributed, diverse, and passionate team of engineers and product managers with multiple teams across GitHub and Microsoft to improve and maintain our Platform that integrators depend on in their software development cycle. Together, we are dedicated to shaping the future of software development by continuously enhancing AI-powered capabilities in GitHub and beyond. The Copilot team is highly distributed and you will thrive in an environment of remote work and asynchronous communication. You're expected to have strong written communication skills and be able to develop working relationships with coworkers in locations around the globe. As an engineer at GitHub you'll always be challenged to solve interesting and novel problems that have real impact on how the world builds software. Responsibilities Lead technical decision making and architecture Design and implement scalable, reliable and performant solutions for problems like rate-limiting, request routing, etc. Write, review, and maintain code primarily in Go Mentor other engineers in their technical and architectural decision making Qualifications Required Qualifications: A few years of experience building high traffic services at scale A few years of experience building and/or consuming REST-style APIs Experience architecting highly available, high volume APIs Preferred Qualifications: Experience with Go and related tooling Experience with distributed systems at global scale Experience working with a remote, distributed team Excellent written and verbal communication skills Interest or prior experience in modern AI/machine learning technologies, Large Language Models or similar Passionate about fostering good API Design practices and processes GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"United Kingdom Remote","city":"Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications: A few years of experience building high traffic services at scale A few years of experience building and/or consuming REST-style APIs Experience architecting highly available, high volume APIs Preferred Qualifications: Experience with Go and related tooling Experience with distributed systems at global scale Experience working with a remote, distributed team Excellent written and verbal communication skills Interest or prior experience in modern AI/machine learning technologies, Large Language Models or similar Passionate about fostering good API Design practices and processes","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542","responsibilities":"Lead technical decision making and architecture Design and implement scalable, reliable and performant solutions for problems like rate-limiting, request routing, etc. Write, review, and maintain code primarily in Go Mentor other engineers in their technical and architectural decision making","posted_date":"November 29, 2023","apply_url":"https://globalcareers-githubinc.icims.com/jobs/2405/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2023-11-29T23:42:15Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-11-29T23:42:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":1,"uuid":"b00f89f7-90ed-457e-b6e6-bf93ed7c7093"},"import_id":"947c70c7-9619-49b0-8c96-225eeb83c953","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/98864893299434182","jobHash":"ed78a68a1d0e6a07a1bbb22bb11f1876","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"Lead technical decision making and architecture Design and implement scalable, reliable and performant solutions for problems like rate-limiting, request routing, etc. Write, review, and maintain code primarily in Go Mentor other engineers in their technical and architectural decision making","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2405?lang=en-us","last_mod":"2023-11-29T23:42:52+0000","gdpr":true},"create_date":"2023-11-29T23:42:52+0000","category":[" Engineering"],"full_location":"Remote, United Kingdom","short_location":"Remote, United Kingdom"}},{"data":{"slug":"2389","language":"en-us","languages":["en-us"],"req_id":"2389","title":"Staff Software Engineer - Search","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, Germany Overview GitHub is changing the way the world builds software, and we want you to help! We’re looking for a Staff level Software Engineer to join the Code Search team. More of the world’s development data lives on GitHub than anywhere else. Helping developers navigate and understand that data is a core part of GitHub’s mission, and an area with significant potential we’ve only begun to realize. We have high aspirations for how we can help developers understand and navigate code, and for making collaboration more seamless. The foundation for these efforts is our highly scalable code search engine, which we are now expanding to help power semantic/vector search to better support many of GitHub’s AI experiences. In this role, you will have the opportunity to be part of the team that’s reinventing the platform and infrastructure that millions of developers depend on for -- re-thinking everything from the experience to the system architecture supporting it. You will be involved in the design, rollout, and support of a highly performant, highly scalable and highly available search platform with your team. Code search, semantic search and AI are a complex, cutting edge problem space and you will help your senior team navigate uncertainty and make effective implementation tradeoff decisions, relying on careful reasoning and decision making around a significant infrastructure budget. Together we are creating the tools and products that are integral to how people build software. We pride ourselves on being thoughtful, intentional, and productive. We value learning, introspection and reflection, and we’re always looking for ways to improve as a team and as individuals. Responsibilities Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support a highly available service used by millions of users on a daily basis Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Help ensure that individuals on the team are learning, growing and advancing in their respective careers Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you Qualifications Required Qualifications: Proficiency in Rust, C or C++ Proficiency in systems programming, search index internals and information retrieval Experience designing, building, scaling and maintaining large-scale distributed systems Experience designing and implementing data structures and algorithms Preferred Qualifications: Experience effectively contributing to technical strategy and roadmaps Passionate about fostering good engineering practices and processes Solid understanding of testing principles and high quality software Understanding of production system monitoring and observability Troubleshooting skills across network, application, caching, queuing, load-balancing, storage and distributed services layers. Excellent analytical skills as well as communication skills both verbal and written. We’re a distributed team so we’re extra mindful about communication. Strong customer focus and data driven approach GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"Germany Remote","city":"Remote","country":"Germany","country_code":"DE","location_type":"ANY","latitude":51.165691,"longitude":10.451526,"categories":[{"name":"Engineering"}],"tags2":["DE-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: Proficiency in Rust, C or C++ Proficiency in systems programming, search index internals and information retrieval Experience designing, building, scaling and maintaining large-scale distributed systems Experience designing and implementing data structures and algorithms Preferred Qualifications: Experience effectively contributing to technical strategy and roadmaps Passionate about fostering good engineering practices and processes Solid understanding of testing principles and high quality software Understanding of production system monitoring and observability Troubleshooting skills across network, application, caching, queuing, load-balancing, storage and distributed services layers. Excellent analytical skills as well as communication skills both verbal and written. We’re a distributed team so we’re extra mindful about communication. Strong customer focus and data driven approach","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542","responsibilities":"Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support a highly available service used by millions of users on a daily basis Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Help ensure that individuals on the team are learning, growing and advancing in their respective careers Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you","posted_date":"November 22, 2023","apply_url":"https://globalcareers-githubinc.icims.com/jobs/2389/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2023-12-06T19:02:57Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-11-22T20:07:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":3,"uuid":"068fa2e0-ffe6-449f-8a31-a9febff2832e"},"import_id":"8ec3e62e-4c5e-497b-8b56-6b7e8b884af9","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/110991864993063622","jobHash":"459c5bbef02d477a790bf5457a4321b5","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":51.165691,"longitude":10.451526},"locationType":"COUNTRY","postalAddress":{"addressLines":["Germany"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"DE","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.21074213340642003}]},"jobSummary":"Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support a highly available service used by millions of users on a daily basis Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Help ensure that individuals on the team are learning, growing and advancing in their respective careers Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2389?lang=en-us","last_mod":"2023-12-06T19:03:28+0000","gdpr":true},"update_date":"2023-12-06T19:03:28+0000","create_date":"2023-11-22T20:07:52+0000","category":[" Engineering"],"full_location":"Remote, Germany","short_location":"Remote, Germany"}},{"data":{"slug":"2388","language":"en-us","languages":["en-us"],"req_id":"2388","title":"Staff Software Engineer - Search","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is changing the way the world builds software, and we want you to help! We’re looking for a Staff level Software Engineer to join the Code Search team. More of the world’s development data lives on GitHub than anywhere else. Helping developers navigate and understand that data is a core part of GitHub’s mission, and an area with significant potential we’ve only begun to realize. We have high aspirations for how we can help developers understand and navigate code, and for making collaboration more seamless. The foundation for these efforts is our highly scalable code search engine, which we are now expanding to help power semantic/vector search to better support many of GitHub’s AI experiences. In this role, you will have the opportunity to be part of the team that’s reinventing the platform and infrastructure that millions of developers depend on for -- re-thinking everything from the experience to the system architecture supporting it. You will be involved in the design, rollout, and support of a highly performant, highly scalable and highly available search platform with your team. Code search, semantic search and AI are a complex, cutting edge problem space and you will help your senior team navigate uncertainty and make effective implementation tradeoff decisions, relying on careful reasoning and decision making around a significant infrastructure budget. Together we are creating the tools and products that are integral to how people build software. We pride ourselves on being thoughtful, intentional, and productive. We value learning, introspection and reflection, and we’re always looking for ways to improve as a team and as individuals. Responsibilities Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support a highly available service used by millions of users on a daily basis Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Help ensure that individuals on the team are learning, growing and advancing in their respective careers Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you Qualifications Required Qualifications: Proficiency in Rust, C or C++ and proficiency in systems programming, search index internals and information retrieval 6+ years experience designing, building, scaling and maintaining large-scale distributed systems 4+ years experience designing and implementing data structures and algorithms Bachelor's degree or equivalent experience Preferred Qualifications: Experience effectively contributing to technical strategy and roadmaps Passionate about fostering good engineering practices and processes Solid understanding of testing principles and high quality software Understanding of production system monitoring and observability Troubleshooting skills across network, application, caching, queuing, load-balancing, storage and distributed services layers. Excellent analytical skills as well as communication skills both verbal and written. We’re a distributed team so we’re extra mindful about communication. Strong customer focus and data driven approach Compensation Range USD $118,100.00 - USD $313,300.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: Proficiency in Rust, C or C++ and proficiency in systems programming, search index internals and information retrieval 6+ years experience designing, building, scaling and maintaining large-scale distributed systems 4+ years experience designing and implementing data structures and algorithms Bachelor's degree or equivalent experience Preferred Qualifications: Experience effectively contributing to technical strategy and roadmaps Passionate about fostering good engineering practices and processes Solid understanding of testing principles and high quality software Understanding of production system monitoring and observability Troubleshooting skills across network, application, caching, queuing, load-balancing, storage and distributed services layers. Excellent analytical skills as well as communication skills both verbal and written. We’re a distributed team so we’re extra mindful about communication. Strong customer focus and data driven approach","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542","responsibilities":"Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support a highly available service used by millions of users on a daily basis Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Help ensure that individuals on the team are learning, growing and advancing in their respective careers Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you","posted_date":"November 22, 2023","apply_url":"https://careers-githubinc.icims.com/jobs/2388/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2023-12-06T19:01:34Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-11-22T19:58:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":3,"uuid":"85aef5dc-5d52-4941-9e85-eb5345a41825"},"import_id":"f12605ac-6fde-4ebc-8b87-5d7b96825c7f","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/139519793687339718","jobHash":"b58a49f3b794ad561b5fab51af8160dc","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.0000717042852578733}]},"jobSummary":"Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support a highly available service used by millions of users on a daily basis Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Help ensure that individuals on the team are learning, growing and advancing in their respective careers Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2388?lang=en-us","last_mod":"2023-12-06T19:02:27+0000","gdpr":false},"update_date":"2023-12-06T19:02:27+0000","create_date":"2023-11-22T19:58:52+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2390","language":"en-us","languages":["en-us"],"req_id":"2390","title":"Staff Software Engineer - Search","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview GitHub is changing the way the world builds software, and we want you to help! We’re looking for a Staff level Software Engineer to join the Code Search team. More of the world’s development data lives on GitHub than anywhere else. Helping developers navigate and understand that data is a core part of GitHub’s mission, and an area with significant potential we’ve only begun to realize. We have high aspirations for how we can help developers understand and navigate code, and for making collaboration more seamless. The foundation for these efforts is our highly scalable code search engine, which we are now expanding to help power semantic/vector search to better support many of GitHub’s AI experiences. In this role, you will have the opportunity to be part of the team that’s reinventing the platform and infrastructure that millions of developers depend on for -- re-thinking everything from the experience to the system architecture supporting it. You will be involved in the design, rollout, and support of a highly performant, highly scalable and highly available search platform with your team. Code search, semantic search and AI are a complex, cutting edge problem space and you will help your senior team navigate uncertainty and make effective implementation tradeoff decisions, relying on careful reasoning and decision making around a significant infrastructure budget. Together we are creating the tools and products that are integral to how people build software. We pride ourselves on being thoughtful, intentional, and productive. We value learning, introspection and reflection, and we’re always looking for ways to improve as a team and as individuals. Responsibilities Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support a highly available service used by millions of users on a daily basis Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Help ensure that individuals on the team are learning, growing and advancing in their respective careers Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you Qualifications Required Qualifications: Proficiency in Rust, C or C++ Proficiency in systems programming, search index internals and information retrieval Experience designing, building, scaling and maintaining large-scale distributed systems Experience designing and implementing data structures and algorithms Preferred Qualifications: Experience effectively contributing to technical strategy and roadmaps Passionate about fostering good engineering practices and processes Solid understanding of testing principles and high quality software Understanding of production system monitoring and observability Troubleshooting skills across network, application, caching, queuing, load-balancing, storage and distributed services layers. Excellent analytical skills as well as communication skills both verbal and written. We’re a distributed team so we’re extra mindful about communication. Strong customer focus and data driven approach GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"United Kingdom Remote","city":"Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: Proficiency in Rust, C or C++ Proficiency in systems programming, search index internals and information retrieval Experience designing, building, scaling and maintaining large-scale distributed systems Experience designing and implementing data structures and algorithms Preferred Qualifications: Experience effectively contributing to technical strategy and roadmaps Passionate about fostering good engineering practices and processes Solid understanding of testing principles and high quality software Understanding of production system monitoring and observability Troubleshooting skills across network, application, caching, queuing, load-balancing, storage and distributed services layers. Excellent analytical skills as well as communication skills both verbal and written. We’re a distributed team so we’re extra mindful about communication. Strong customer focus and data driven approach","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542","responsibilities":"Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support a highly available service used by millions of users on a daily basis Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Help ensure that individuals on the team are learning, growing and advancing in their respective careers Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you","posted_date":"November 22, 2023","apply_url":"https://globalcareers-githubinc.icims.com/jobs/2390/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2023-11-22T20:12:25Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-11-22T20:07:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":2,"uuid":"74a8ce1a-af32-48de-bc1a-2c6cec1b04d7"},"import_id":"e3e08298-a726-42e2-b3c7-9336ada1b75a","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/135638517641290438","jobHash":"769b419f5f8e9a924d6506108b6ec8c4","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support a highly available service used by millions of users on a daily basis Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Help ensure that individuals on the team are learning, growing and advancing in their respective careers Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2390?lang=en-us","last_mod":"2023-11-22T20:12:53+0000","gdpr":true},"update_date":"2023-11-22T20:12:53+0000","create_date":"2023-11-22T20:07:53+0000","category":[" Engineering"],"full_location":"Remote, United Kingdom","short_location":"Remote, United Kingdom"}},{"data":{"slug":"2387","language":"en-us","languages":["en-us"],"req_id":"2387","title":"Principal Software Engineer - Search","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview GitHub is changing the way the world builds software, and we want you to help! We’re looking for a Principal level Software Engineer to join the Code Search team. More of the world’s development data lives on GitHub than anywhere else. Helping developers navigate and understand that data is a core part of GitHub’s mission, and an area with significant potential we’ve only begun to realize. We have high aspirations for how we can help developers understand and navigate code, and for making collaboration more seamless. The foundation for these efforts is our highly scalable code search engine, which we are now expanding to help power semantic/vector search to better support many of GitHub’s AI experiences. In this role, you will have the opportunity to be part of the team that’s reinventing the platform and infrastructure that millions of developers depend on for -- re-thinking everything from the experience to the system architecture supporting it. You will be involved in the design, rollout, and support of a highly performant, highly scalable and highly available search platform with your team. Code search, semantic search and AI are a complex, cutting edge problem space and you will help your senior team navigate uncertainty and make effective implementation tradeoff decisions, relying on careful reasoning and decision making around a significant infrastructure budget. Together we are creating the tools and products that are integral to how people build software. We pride ourselves on being thoughtful, intentional, and productive. We value learning, introspection and reflection, and we’re always looking for ways to improve as a team and as individuals. Responsibilities Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support a highly available service used by millions of users on a daily basis Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Help ensure that individuals on the team are learning, growing and advancing in their respective careers Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you Qualifications Required Qualifications: Proficiency in Rust, C or C++ Proficiency in systems programming, search index internals and information retrieval Experience designing, building, scaling and maintaining large-scale distributed systems Experience designing and implementing data structures and algorithms Preferred Qualifications: Experience with vector database internals, ANN search and AI based retrieval a plus Passionate about fostering good engineering practices and processes Experience effectively contributing to technical strategy and roadmaps Solid understanding of testing principles and high quality software Understanding of production system monitoring and observability Troubleshooting skills across network, application, caching, queuing, load-balancing, storage and distributed services layers. Excellent analytical skills as well as communication skills both verbal and written. We’re a distributed team so we’re extra mindful about communication. Strong customer focus and data driven approach GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"United Kingdom Remote","city":"Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: Proficiency in Rust, C or C++ Proficiency in systems programming, search index internals and information retrieval Experience designing, building, scaling and maintaining large-scale distributed systems Experience designing and implementing data structures and algorithms Preferred Qualifications: Experience with vector database internals, ANN search and AI based retrieval a plus Passionate about fostering good engineering practices and processes Experience effectively contributing to technical strategy and roadmaps Solid understanding of testing principles and high quality software Understanding of production system monitoring and observability Troubleshooting skills across network, application, caching, queuing, load-balancing, storage and distributed services layers. Excellent analytical skills as well as communication skills both verbal and written. We’re a distributed team so we’re extra mindful about communication. Strong customer focus and data driven approach","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542","responsibilities":"Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support a highly available service used by millions of users on a daily basis Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Help ensure that individuals on the team are learning, growing and advancing in their respective careers Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you","posted_date":"November 22, 2023","apply_url":"https://globalcareers-githubinc.icims.com/jobs/2387/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2023-12-06T19:15:17Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-11-22T20:08:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":3,"uuid":"c6ce1ee2-3deb-46aa-9e56-dc900f20d986"},"import_id":"f97aff61-537a-40b1-80ca-a3e3502c78b3","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/129481252525744838","jobHash":"3cc2809bc2110bd87dcee53ab549c781","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"Work with the team to understand technical constraints, and develop, communicate, and track against realistic plans to consistently ship products, features, and bug fixes Coordinate with engineering and product leadership to define and prioritize projects that help us meet business objectives Ensure the team builds software that is architecturally consistent and of high quality to reliably meet customer needs Support a highly available service used by millions of users on a daily basis Help cultivate an environment where team members are empowered and demonstrate a strong sense of ownership and belonging Help ensure that individuals on the team are learning, growing and advancing in their respective careers Mentor, pair, and delegate work to encourage the professional and technical growth of your team and those around you","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2387?lang=en-us","last_mod":"2023-12-06T19:15:27+0000","gdpr":true},"update_date":"2023-12-06T19:15:27+0000","create_date":"2023-11-22T20:08:53+0000","category":[" Engineering"],"full_location":"Remote, United Kingdom","short_location":"Remote, United Kingdom"}},{"data":{"slug":"2368","language":"en-us","languages":["en-us"],"req_id":"2368","title":"Staff Webhooks Platform Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub powers the software industry. Third-party integrations and many of our flagship products are driven by GitHub webhooks. Help design, build, and maintain the systems that fuel GitHub integrations. GitHub is looking for an engineer to join a team focused on building and extending our real time event platform inside of our Extenstensibility group. This team is responsible for our webhook delivery pipeline that sends hundreds of millions of HTTP requests every day. In this role, you will work among a team of remote engineers to build product enhancements to our real time APIs as well as develop new systems that make it easier for customers to act on events that take place on GitHub. We work closely with other platform teams who support our databases, queues, and the GitHub network. Our tech stack is primarily Go and Ruby. The Engineering organization is highly distributed and you will thrive in an environment of remote work and asynchronous communication. As a member of our team, you’ll always be challenged to solve interesting and novel problems that have real impact on how the world builds software. Responsibilities Lead technical decision making and architecture in the webhooks space Design, implement, and maintain scalable, reliable and performant solutions for evented architecture Maintaining and improving our event services and APIs Improving the scalability and performance of our platform Debugging problems across a large distributed system Consulting and mentoring engineers across GitHub as they implement webhooks Qualifications Required Qualifications: 6+ years architecting and building web applications 4+ years experience maintaining highly available, high volume platforms 4+ years experience building and maintaining evented architecture Bachelor’s degree or equivalent experience Preferred Qualifications: Experience with queuing and streaming systems Kafka or RabbitMQ, etc Experience with relational databases You have worked on distributed teams Strong written and verbal communication skills Compensation Range USD $118,100.00 - USD $313,300.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 6+ years architecting and building web applications 4+ years experience maintaining highly available, high volume platforms 4+ years experience building and maintaining evented architecture Bachelor’s degree or equivalent experience Preferred Qualifications: Experience with queuing and streaming systems Kafka or RabbitMQ, etc Experience with relational databases You have worked on distributed teams Strong written and verbal communication skills","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542","responsibilities":"Lead technical decision making and architecture in the webhooks space Design, implement, and maintain scalable, reliable and performant solutions for evented architecture Maintaining and improving our event services and APIs Improving the scalability and performance of our platform Debugging problems across a large distributed system Consulting and mentoring engineers across GitHub as they implement webhooks","posted_date":"November 9, 2023","apply_url":"https://careers-githubinc.icims.com/jobs/2368/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2023-11-09T20:42:05Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-11-09T20:41:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":3,"uuid":"318af1bb-f771-43e6-93a2-f40e0e925802"},"import_id":"b1becb77-aeee-4063-be7f-7d1f08669dee","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/136117025584882374","jobHash":"6ff5fba0f44bca5784f5cadb0b127f3e","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.0000717042852578733}]},"jobSummary":"Lead technical decision making and architecture in the webhooks space Design, implement, and maintain scalable, reliable and performant solutions for evented architecture Maintaining and improving our event services and APIs Improving the scalability and performance of our platform Debugging problems across a large distributed system Consulting and mentoring engineers across GitHub as they implement webhooks","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2368?lang=en-us","last_mod":"2023-11-09T23:59:08+0000","gdpr":false},"create_date":"2023-11-09T23:59:08+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2315","language":"en-us","languages":["en-us"],"req_id":"2315","title":"Staff Software Engineer, Actions MacCloud","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is changing the way the world builds software, and we want you to help build GitHub! We’re looking for an experienced Staff Engineer to join the Actions Mac Cloud Platform and Infrastructure Team. Actions Mac Cloud owns the end to end lifecycle of the fleet of machines that power all our hosted Mac runners for GitHub Actions. This includes: Obtaining and provisioning hardware Working with data centers to deploy our hardware Building deployment and runtime software to provision and manage the Mac hardware and virtual machines Interfacing with multiple vendors and engineering teams to accomplish the above Actions is a core part of GitHub and enables developers around the world. Millions of GitHub customers will rely on your team's work every single day. In this role, you’ll collaborate closely with product and distributed engineers to grow and improve MacCloud with security, reliability, and operational efficiency at the forefront. You’ll help set business and product direction, and you’ll be involved in planning, implementation, scaling, reliability and customer success to ensure we’re setting our teams and customers up for success. The people on our teams believe that creating great products for GitHub users is a ton of fun, and you’ll be inspired by the opportunity to help enable developers all over the world to build world-changing things with our tools. Responsibilities Lead the development of software to manage, monitor, and maintain our fleet of Macs using reusable code and tooling Collaborate with our hardware engineers, vendors, TPM, and other engineers to plan next generation hardware releases Partner with your team, other engineering teams and product partners to enable the macOS runners capabilities needed by our customers. Drive the team to meet the service's high availability and scale requirements. Mentor and coach other engineers on the team Participate in long term planning and execution alongside engineering leadership, vendors, TPM, PM, and external stakeholders Participate in hiring and sourcing to build a diverse high performance engineering team Work with the team to develop, communicate, and track progress against long term plans Coordinate with engineering, product and design leadership to define and prioritize projects that help us meet business objectives Support a highly available service used by millions of users on a daily basis Drive data driven improvements to both product quality and engineering efficiency Qualifications Required Qualifications: 7+ years of experience as a software engineer 3+ years of experience delivering high availability, enterprise grade services, including monitoring, observability and diagnosing problems 3+ years of experience developing backend services for large scale systems Preferred Qualifications Passionate about fostering good engineering practices and processes Excellent analytical skills as well as communication skills both verbal and written. We’re a distributed team so we’re extra mindful about communication. Strong customer focus and data driven approach Experience in and passion for mentoring and coaching Experience working with data centers and vendors is a plus Experience in Golang, C#, and/or Azure is a plus. Experience with SQL, Kusto, or general database knowledge Compensation Range USD $118,100.00 - USD $313,300.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 7+ years of experience as a software engineer 3+ years of experience delivering high availability, enterprise grade services, including monitoring, observability and diagnosing problems 3+ years of experience developing backend services for large scale systems Preferred Qualifications Passionate about fostering good engineering practices and processes Excellent analytical skills as well as communication skills both verbal and written. We’re a distributed team so we’re extra mindful about communication. Strong customer focus and data driven approach Experience in and passion for mentoring and coaching Experience working with data centers and vendors is a plus Experience in Golang, C#, and/or Azure is a plus. Experience with SQL, Kusto, or general database knowledge","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542","responsibilities":"Lead the development of software to manage, monitor, and maintain our fleet of Macs using reusable code and tooling Collaborate with our hardware engineers, vendors, TPM, and other engineers to plan next generation hardware releases Partner with your team, other engineering teams and product partners to enable the macOS runners capabilities needed by our customers. Drive the team to meet the service's high availability and scale requirements. Mentor and coach other engineers on the team Participate in long term planning and execution alongside engineering leadership, vendors, TPM, PM, and external stakeholders Participate in hiring and sourcing to build a diverse high performance engineering team Work with the team to develop, communicate, and track progress against long term plans Coordinate with engineering, product and design leadership to define and prioritize projects that help us meet business objectives Support a highly available service used by millions of users on a daily basis Drive data driven improvements to both product quality and engineering efficiency","posted_date":"November 3, 2023","apply_url":"https://careers-githubinc.icims.com/jobs/2315/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2023-12-12T16:58:54Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-11-03T13:02:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":10,"uuid":"36cf11fc-346d-4751-9bc2-5e4fc3316587"},"import_id":"07311ee6-00a0-4c00-a159-073cc9d1dc73","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/120673733816787654","jobHash":"e32823e4ba95ace13b1c05cca5d92d1a","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.0000717042852578733}]},"jobSummary":"Lead the development of software to manage, monitor, and maintain our fleet of Macs using reusable code and tooling Collaborate with our hardware engineers, vendors, TPM, and other engineers to plan next generation hardware releases Partner with your team, other engineering teams and product partners to enable the macOS runners capabilities needed by our customers. Drive the team to meet the service's high availability and scale requirements. Mentor and coach other engineers on the team Participate in long term planning and execution alongside engineering leadership, vendors, TPM, PM, and external stakeholders Participate in hiring and sourcing to build a diverse high performance engineering team Work with the team to develop, communicate, and track progress against long term plans Coordinate with engineering, product and design leadership to define and prioritize projects that help us meet business objectives Support a highly available service used by millions of users on a daily basis Drive data driven improvements to both product quality and engineering efficiency","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2315?lang=en-us","last_mod":"2023-12-12T16:59:14+0000","gdpr":false},"update_date":"2023-12-12T16:59:14+0000","create_date":"2023-11-17T23:29:42+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}}],"totalCount":19,"count":19,"filter":{"displayLimit":10,"categories":{"all":[{"category":"Engineering","numJobs":19}],"shortlist":[{"category":"Engineering","numJobs":19}]},"brands":{"all":[],"shortlist":[]},"experienceLevels":{"all":[],"shortlist":[]},"locations":{"all":[{"city":"Remote","state":null,"country":"Germany","count":2},{"city":"Remote","state":null,"country":"Japan","count":1},{"city":"Remote","state":null,"country":"United Kingdom","count":3},{"city":"Remote","state":null,"country":"United States","count":13}],"shortlist":[{"city":"Remote","state":null,"country":"Germany","count":2},{"city":"Remote","state":null,"country":"Japan","count":1},{"city":"Remote","state":null,"country":"United Kingdom","count":3},{"city":"Remote","state":null,"country":"United States","count":13}]},"facetList":{"tags4":[{"term":"Experienced Professional","count":19}],"tags5":[{"term":"Individual Contributor","count":18},{"term":"Director","count":1}],"tags6":[{"term":"Yes","count":19}]}},"languageCounts":{"en-us":{"displayName":"English","count":19}},"request_id":false,"meta_data":{"ResponseMetadata":{"requestId":"1e29c6dd-86b8-48b2-99f3-d07a076a436b:APAb7IQFQEl9YLTSG9RWUqPpx721ezCxig=="}},"locations":[]}