{"jobs":[{"data":{"slug":"2995","language":"en-us","languages":["en-us"],"req_id":"2995","title":"Security Engineer III","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview Do you want to be part of the team enabling software development teams to do their best work, with the world’s most elegant, secure, reliable, and powerful developer platform? GitHub is changing the way the world builds software. To accomplish this, we need to ensure employees' use of GitHub’s internal systems is secure. On the Enterprise Security team, we're focused on maintaining conditional access, SaaS security, and how Hubbers access critical tooling. As a Security Engineer, you will work closely with a distributed, diverse, and passionate team of engineers to ensure GitHub remains a secure home for 100M+ developers. The Enterprise Security team is a fully remote team. We expect you to have the ability to communicate complex technical concepts and be able to create working relationships with coworkers in locations around the globe both synchronously and asynchronously. We are looking for creative problem solvers and diverse thinkers - people who care about culture as well as customers and features. We believe that how we do things is as important as what we do. Big vision, a common purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what lead to great results. Responsibilities Manage Okta authentication policies and other security configuration via Terraform Help Hubbers resolve endpoint security configuration problems via automated communication systems. Use data from automated systems to drive down tech debt, and miscellaneous misconfigurations Contribute to projects that impact security for all of GitHub Work closely with other teams within SecOps to work towards secure outcomes Qualifications Required Qualifications: Some experience with SAML/Oauth/REST APIs An abundance of experience in at least one programming language. Several years of experience with Okta, Azure, and LDAP Preferred Qualifications: History of contributing to complex cross functional projects. Python, Go Any experience with Python testing (unittest/pytest) Experience with fastapi/sqlalchemy would let you drop into a lot of our current projects. Experience communicating to a very broad range of technical abilities. Being willing and able to learn; more valuable than knowing a specific language or technology. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"United Kingdom Remote","city":"Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: Some experience with SAML/Oauth/REST APIs An abundance of experience in at least one programming language. Several years of experience with Okta, Azure, and LDAP Preferred Qualifications: History of contributing to complex cross functional projects. Python, Go Any experience with Python testing (unittest/pytest) Experience with fastapi/sqlalchemy would let you drop into a lot of our current projects. Experience communicating to a very broad range of technical abilities. Being willing and able to learn; more valuable than knowing a specific language or technology.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Manage Okta authentication policies and other security configuration via Terraform Help Hubbers resolve endpoint security configuration problems via automated communication systems. Use data from automated systems to drive down tech debt, and miscellaneous misconfigurations Contribute to projects that impact security for all of GitHub Work closely with other teams within SecOps to work towards secure outcomes","posted_date":"May 9, 2024","apply_url":"https://globalcareers-githubinc.icims.com/jobs/2995/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/116692451107709638","companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"9fb9ee62b9645f56b5298c9ead0816a7","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"Manage Okta authentication policies and other security configuration via Terraform Help Hubbers resolve endpoint security configuration problems via automated communication systems. Use data from automated systems to drive down tech debt, and miscellaneous misconfigurations Contribute to projects that impact security for all of GitHub Work closely with other teams within SecOps to work towards secure outcomes","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-05-09T17:46:33Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-05-09T17:16:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":2,"uuid":"4575df2b-0764-44db-b3e9-f7fac2d4ec4b"},"import_id":"19098cac-480c-4079-b03d-30d6fe46561d","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/2995?lang=en-us","last_mod":"2024-05-09T17:47:01+0000","gdpr":true},"update_date":"2024-05-09T17:47:01+0000","create_date":"2024-05-09T17:17:04+0000","category":[" Engineering"],"full_location":"Remote, United Kingdom","short_location":"Remote, United Kingdom"}},{"data":{"slug":"2991","language":"en-us","languages":["en-us"],"req_id":"2991","title":"Senior Applied Researcher-1","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub Copilot has changed the way software is built, and we have a unique opportunity to look further ahead to identify how software development can be faster, safer, easier, and more accessible. We’re looking for talented and passionate applied scientists to join us in this mission! The GitHub Copilot Applied Science team has a crucial role in improving and expanding the functionality of GitHub Copilot. Our responsibilities encompass various areas such as LLM fine-tuning generation, prompt engineering, and the development of end-to-end AI features using cutting-edge technologies. In this role, you will collaborate closely with a diverse and highly-skilled group of researchers, scientists, and software engineers within our team, while partnering with multiple teams across Github and Microsoft. Together, we are dedicated to shaping the future of software development by continuously enhancing the AI-powered capabilities in GitHub Copilot. Responsibilities Develop and implement techniques for applying generative AI to code in the context of GitHub Copilot, including LLM fine-tuning, RAG, and prompt engineering. Execute offline and online performance evaluation of new techniques. Lead collaborations within our team and with partner Teams across GitHub and Microsoft. Partner with engineering teams to productionize promising new techniques. Qualifications Minimum Qualifications: Bachelor's Degree in Statistics, Computer Science, Electrical or Computer Engineering, Mathematics, or related field AND 5+ years related experience (e.g., machine learning, natural language processing) OR Master's Degree in Statistics, Computer Science, Electrical or Computer Engineering, Mathematics,, or related field AND 3+ year(s) related experience (e.g., machine learning, natural language processing) OR Statistics, Computer Science, Electrical or Computer Engineering, Mathematics,, or related field 4 years of experience coding in languages such as Python and relevant machine learning libraries and frameworks Preferred Qualifications: These are more specific abilities we’re looking for, but it is the rare human who possesses them all. Think of this as a descriptive sketch, not a checklist of requirements. Be comfortable applying even if you don’t have all of them. Ph.D in computer science, machine learning, or a related field. Experience working with generative AI for code. Excellent analytical and problem-solving skills with a keen attention to detail Excellent written and verbal communication skills Compensation Range The base salary range for this job is USD $104,400.00 - USD $276,900.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Minimum Qualifications: Bachelor's Degree in Statistics, Computer Science, Electrical or Computer Engineering, Mathematics, or related field AND 5+ years related experience (e.g., machine learning, natural language processing) OR Master's Degree in Statistics, Computer Science, Electrical or Computer Engineering, Mathematics,, or related field AND 3+ year(s) related experience (e.g., machine learning, natural language processing) OR Statistics, Computer Science, Electrical or Computer Engineering, Mathematics,, or related field 4 years of experience coding in languages such as Python and relevant machine learning libraries and frameworks Preferred Qualifications: These are more specific abilities we’re looking for, but it is the rare human who possesses them all. Think of this as a descriptive sketch, not a checklist of requirements. Be comfortable applying even if you don’t have all of them. Ph.D in computer science, machine learning, or a related field. Experience working with generative AI for code. Excellent analytical and problem-solving skills with a keen attention to detail Excellent written and verbal communication skills","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Develop and implement techniques for applying generative AI to code in the context of GitHub Copilot, including LLM fine-tuning, RAG, and prompt engineering. Execute offline and online performance evaluation of new techniques. Lead collaborations within our team and with partner Teams across GitHub and Microsoft. Partner with engineering teams to productionize promising new techniques.","posted_date":"May 9, 2024","apply_url":"https://careers-githubinc.icims.com/jobs/2991/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-05-09T13:25:08Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-05-09T13:24:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":1,"uuid":"054a6a38-d08a-4e2f-99ec-d3f8e547d2b9"},"import_id":"171affc0-8155-4217-bbb5-994054953322","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/132888059816354502","jobHash":"9c0a301db75e1dc23166a92931860f21","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":7.17042852578733e-05}]},"jobSummary":"Develop and implement techniques for applying generative AI to code in the context of GitHub Copilot, including LLM fine-tuning, RAG, and prompt engineering. Execute offline and online performance evaluation of new techniques. Lead collaborations within our team and with partner Teams across GitHub and Microsoft. Partner with engineering teams to productionize promising new techniques.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2991?lang=en-us","last_mod":"2024-05-09T13:25:49+0000","gdpr":false},"create_date":"2024-05-09T13:25:49+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2958","language":"en-us","languages":["en-us"],"req_id":"2958","title":"Software Engineer, Git Storage","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is changing the way the world builds software, as the home for all developers! We’re looking for curious and empathetic engineers to join Git Systems – a critical organization in our Platform Engineering team. We are the Git teams at GitHub! Git Systems enables all Git Operations for GitHub dotcom. We maintain the various microservices, protocols, proxies, and GitHub’s fork of git. If you’ve ever run `git push` on your local machine to share changes on GitHub then you’ve interacted with our services and infrastructure. We serve billions of git requests daily; if you want to work at scale, Git Systems is an incredible opportunity! Git Systems is a highly distributed organization across Europe and North America comprised of 3 teams: Git Protocols, Git Platform, and Git Storage. Git Protocols provides external access by terminating all http and ssh requests. Git Platform serves and routes requests for access to git data. And finally, Git Storage stores, replicates, and hosts our git data. The 3 teams work in tandem, but this position is join the Git Storage team. Each team manages their own infrastructure to support their services, though we partner closely with our Infrastructure teams. To maintain high availability of our critical services we run a 24/7/365 on-call rotation. This is a shared rotation across our 3 teams, broken into two 12-hour shifts each day – one in North America and Europe respectively. Right now, our North America engineers have their on-call week, on average, once every 2 months. Engineers are expected to join the rotation within their first 6-9 months in the role. Want to know a little more about Git Storage? Storage is responsible for the persistent storage and replication of all repository data for Github dotcom. It is the infrastructure-heavy team in Git Systems, maintaining our fleet of file servers and MySQL databases that host 20+PiB of the world’s most valuable data. Git Storage also maintain GitHub’s backup and restore service and its data. Our team is directly responsible for the services that store and serve 450M+ Git repositories, both directly to users and to other layers in the GitHub software stack. Infrastructure experience is helpful for engineers on our team, but not a requirement. In this role you might work on extracting functionality from our Ruby on Rails monolith into greenfield Go microservices, work on distributed systems problems like ensuring a majority of repository replicas have persisted a push before returning success to a user or tackle scaling growth to ensure we keep ahead of our largest customer repositories. Examples of previous work within this group include: improving large monorepo performance, championing efficient ways of working with Git repositories and working on Git itself. Together we create the tools and products that are integral to how people build software. We pride ourselves on being thoughtful, intentional, and productive. We hope you are as well. Responsibilities Write, review, and maintain code primarily in Go and occasionally in Ruby Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to availability incidents when necessary. Offhour pages are rare, but possible. Document architectural designs, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems Communicate with professionalism and empathy to best support our customers and community Model a culture of psychological safety both within the team and cross-team, where differing views can be shared and heard Qualifications Minimum Qualifications: 2+ years of professional software engineering experience 1 year of professional experience with distributed systems Demonstrable experience in Go – you know how to run production applications in a Linux or Unix environment Bachelor's degree or equivalent experience Preferred Qualifications: Infrastructure experience running containerized applications in production environments Excellent technical writing skills Experience working asynchronously with a distributed team across multiple time zones 1 year of experience working on a remote, distributed team Compensation Range The base salary range for this job is USD $75,000.00 - USD $198,900.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Minimum Qualifications: 2+ years of professional software engineering experience 1 year of professional experience with distributed systems Demonstrable experience in Go – you know how to run production applications in a Linux or Unix environment Bachelor's degree or equivalent experience Preferred Qualifications: Infrastructure experience running containerized applications in production environments Excellent technical writing skills Experience working asynchronously with a distributed team across multiple time zones 1 year of experience working on a remote, distributed team","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Write, review, and maintain code primarily in Go and occasionally in Ruby Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to availability incidents when necessary. Offhour pages are rare, but possible. Document architectural designs, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems Communicate with professionalism and empathy to best support our customers and community Model a culture of psychological safety both within the team and cross-team, where differing views can be shared and heard","posted_date":"May 8, 2024","apply_url":"https://careers-githubinc.icims.com/jobs/2958/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-05-08T20:15:58Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-05-08T20:15:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":1,"uuid":"0b701252-9d75-43e6-a058-d991d87e2ff8"},"import_id":"701ca315-f7aa-4787-9b55-bb04d3c15d30","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/114322576200606406","jobHash":"cca5b61da837aa10261cb25a52846470","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":7.17042852578733e-05}]},"jobSummary":"Write, review, and maintain code primarily in Go and occasionally in Ruby Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to availability incidents when necessary. Offhour pages are rare, but possible. Document architectural designs, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems Communicate with professionalism and empathy to best support our customers and community Model a culture of psychological safety both within the team and cross-team, where differing views can be shared and heard","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2958?lang=en-us","last_mod":"2024-05-08T20:16:51+0000","gdpr":false},"create_date":"2024-05-08T20:16:51+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2920","language":"en-us","languages":["en-us"],"req_id":"2920","title":"Principal Software Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is revolutionizing the way developers collaborate and build software, and we are seeking a Principal Software Engineer to pioneer the UI Platform space, which entails areas of frontend performance, accessibility, consistency, and availability. This role is pivotal to defining GitHub's future UI architecture, ensuring accessibility for all users, delivering an exceptional user interface, enhancing developer experience, and positioning GitHub as a leader in UI innovation, thereby empowering millions of developers worldwide. Responsibilities Lead the architectural design and development of GitHub's web UI platform, ensuring scalability, reliability, accessibility, and performance. Collaborate with cross-functional teams to define and prioritize projects aimed at enhancing GitHub's user experience. Establish best practices, patterns, and guidelines for frontend development, fostering a culture of excellence and innovation. Provide technical leadership and mentorship to frontend engineering teams, promoting continuous learning and growth. Drive initiatives to improve engineering processes, tooling, and automation to streamline development workflows. Champion accessibility, performance, and usability standards, ensuring that GitHub's web interfaces are accessible to all users and optimized for performance. Stay abreast of emerging frontend technologies, trends, and best practices, advocating for their adoption when beneficial to GitHub's development ecosystem. Collaborate with product management and design teams to translate user needs and business requirements into technical solutions. Serve as a subject matter expert on web UI development, representing GitHub in industry conferences, forums, and technical communities. A week in the life of a Principal Engineer might consist of: Collaborating with other Principal Engineers to define the future of GitHub engineering and working together to implement that vision Collaborating with design, analytics, support, and product management to understand the problems we want to solve and exploring how we can solve them Digging into the most important issues the department is tackling by asking questions, creating plans, recognizing pitfalls, raising concerns, and creating clarity Discussing and collaboratively solving engineering and product problems with engineering collaborators in Slack or Zoom Planning and executing large-scale company-wide rollouts and migrations Supporting company-wide initiatives Bringing key plans and execution ideas to the management team Mentoring other engineers at all experience levels Providing comprehensive and high quality code or design reviews when requested by other teams at GitHub Reviewing teammates' Pull Requests and providing helpful feedback Serve as an engineering representative for critical customer conversations to discover what they love and what their pain points are Embedding in a squad periodically to enable others to tackle challenges and stretch assignments As a part of Engineering technical leadership, advising on key initiatives, gaps, and technical pitfalls we need to be aware of Qualifications Required Qualifications: Bachelor's degree in Computer Science, Engineering, or equivalent practical experience. 10+ years of professional experience in frontend development, with a strong proficiency in modern JavaScript frameworks (especially React) and with the last 4 years in a senior technical role (e.g. Staff / Principal or equivalent) 7+ years of experience in designing, building, and maintaining large-scale frontend applications and the backend systems that support these with an emphasis on performance, scalability, and maintainability. 7+ years of providing technical leadership and mentorship, guiding teams to deliver high-quality software solutions, demonstrating a proactive bias for action in ensuring timely execution of projects and initiatives. 3+ years of experience constructing APIs for front-end applications OR proficiency consuming those APIs while leveraging associated client libraries like Apollo, TRPC, Relay, etc. Preferred Qualifications: Experience navigating how different concerns within the frontend engineering space overlap (e.g. accessibility, performance, UX consistency) and crafting execution strategies that successfully take these areas into consideration and lead to meaningful and impactful deliverables. Deep expertise and knowledge of the inner workings of React and related technologies Passionate and active in the evolution of current front-end architecture trends and best practices, encompassing performance, accessibility, security, and usability. Extensive experience with TypeScript and other statically typed languages, Node.js, the Web platform, and UI architecture Experience with large-scale codebases with contributors that span teams, offices and time zones Prior experience with Ruby on Rails or other backend technologies. Proficiency in using and customizing build tools and automation frameworks, such as Webpack. Prior experience articulating complex technical concepts to both technical (engineers at all levels) and non-technical (stakeholders and executives) audiences Compensation Range The base salary range for this job is USD $134,800.00 - USD $357,500.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: Bachelor's degree in Computer Science, Engineering, or equivalent practical experience. 10+ years of professional experience in frontend development, with a strong proficiency in modern JavaScript frameworks (especially React) and with the last 4 years in a senior technical role (e.g. Staff / Principal or equivalent) 7+ years of experience in designing, building, and maintaining large-scale frontend applications and the backend systems that support these with an emphasis on performance, scalability, and maintainability. 7+ years of providing technical leadership and mentorship, guiding teams to deliver high-quality software solutions, demonstrating a proactive bias for action in ensuring timely execution of projects and initiatives. 3+ years of experience constructing APIs for front-end applications OR proficiency consuming those APIs while leveraging associated client libraries like Apollo, TRPC, Relay, etc. Preferred Qualifications: Experience navigating how different concerns within the frontend engineering space overlap (e.g. accessibility, performance, UX consistency) and crafting execution strategies that successfully take these areas into consideration and lead to meaningful and impactful deliverables. Deep expertise and knowledge of the inner workings of React and related technologies Passionate and active in the evolution of current front-end architecture trends and best practices, encompassing performance, accessibility, security, and usability. Extensive experience with TypeScript and other statically typed languages, Node.js, the Web platform, and UI architecture Experience with large-scale codebases with contributors that span teams, offices and time zones Prior experience with Ruby on Rails or other backend technologies. Proficiency in using and customizing build tools and automation frameworks, such as Webpack. Prior experience articulating complex technical concepts to both technical (engineers at all levels) and non-technical (stakeholders and executives) audiences","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Lead the architectural design and development of GitHub's web UI platform, ensuring scalability, reliability, accessibility, and performance. Collaborate with cross-functional teams to define and prioritize projects aimed at enhancing GitHub's user experience. Establish best practices, patterns, and guidelines for frontend development, fostering a culture of excellence and innovation. Provide technical leadership and mentorship to frontend engineering teams, promoting continuous learning and growth. Drive initiatives to improve engineering processes, tooling, and automation to streamline development workflows. Champion accessibility, performance, and usability standards, ensuring that GitHub's web interfaces are accessible to all users and optimized for performance. Stay abreast of emerging frontend technologies, trends, and best practices, advocating for their adoption when beneficial to GitHub's development ecosystem. Collaborate with product management and design teams to translate user needs and business requirements into technical solutions. Serve as a subject matter expert on web UI development, representing GitHub in industry conferences, forums, and technical communities. A week in the life of a Principal Engineer might consist of: Collaborating with other Principal Engineers to define the future of GitHub engineering and working together to implement that vision Collaborating with design, analytics, support, and product management to understand the problems we want to solve and exploring how we can solve them Digging into the most important issues the department is tackling by asking questions, creating plans, recognizing pitfalls, raising concerns, and creating clarity Discussing and collaboratively solving engineering and product problems with engineering collaborators in Slack or Zoom Planning and executing large-scale company-wide rollouts and migrations Supporting company-wide initiatives Bringing key plans and execution ideas to the management team Mentoring other engineers at all experience levels Providing comprehensive and high quality code or design reviews when requested by other teams at GitHub Reviewing teammates' Pull Requests and providing helpful feedback Serve as an engineering representative for critical customer conversations to discover what they love and what their pain points are Embedding in a squad periodically to enable others to tackle challenges and stretch assignments As a part of Engineering technical leadership, advising on key initiatives, gaps, and technical pitfalls we need to be aware of","posted_date":"May 6, 2024","apply_url":"https://careers-githubinc.icims.com/jobs/2920/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/132799753134973638","companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"4f8aaed393cb19d15f3652ac8bfc0da9","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":7.17042852578733e-05}]},"jobSummary":"Lead the architectural design and development of GitHub's web UI platform, ensuring scalability, reliability, accessibility, and performance. Collaborate with cross-functional teams to define and prioritize projects aimed at enhancing GitHub's user experience. Establish best practices, patterns, and guidelines for frontend development, fostering a culture of excellence and innovation. Provide technical leadership and mentorship to frontend engineering teams, promoting continuous learning and growth. Drive initiatives to improve engineering processes, tooling, and automation to streamline development workflows. Champion accessibility, performance, and usability standards, ensuring that GitHub's web interfaces are accessible to all users and optimized for performance. Stay abreast of emerging frontend technologies, trends, and best practices, advocating for their adoption when beneficial to GitHub's development ecosystem. Collaborate with product management and design teams to translate user needs and business requirements into technical solutions. Serve as a subject matter expert on web UI development, representing GitHub in industry conferences, forums, and technical communities. A week in the life of a Principal Engineer might consist of: Collaborating with other Principal Engineers to define the future of GitHub engineering and working together to implement that vision Collaborating with design, analytics, support, and product management to understand the problems we want to solve and exploring how we can solve them Digging into the most important issues the department is tackling by asking questions, creating plans, recognizing pitfalls, raising concerns, and creating clarity Discussing and collaboratively solving engineering and product problems with engineering collaborators in Slack or Zoom Planning and executing large-scale company-wide rollouts and migrations Supporting company-wide initiatives Bringing key plans and execution ideas to the management team Mentoring other engineers at all experience levels Providing comprehensive and high quality code or design reviews when requested by other teams at GitHub Reviewing teammates' Pull Requests and providing helpful feedback Serve as an engineering representative for critical customer conversations to discover what they love and what their pain points are Embedding in a squad periodically to enable others to tackle challenges and stretch assignments As a part of Engineering technical leadership, advising on key initiatives, gaps, and technical pitfalls we need to be aware of","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-05-09T13:51:10Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-05-06T20:26:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":8,"uuid":"7d98eada-9513-45b6-a982-20211313604f"},"import_id":"5d6ca2fe-c59a-475b-b2ff-c0986db17a68","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/2920?lang=en-us","last_mod":"2024-05-09T13:51:50+0000","gdpr":false},"update_date":"2024-05-09T13:51:50+0000","create_date":"2024-05-06T20:45:49+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2936","language":"en-us","languages":["en-us"],"req_id":"2936","title":"Software Engineer III","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, Denmark Overview GitHub is the home for software development, where we collaborate to build the world's leading developer platform. In the GitHub code scanning team, we are passionate about securing the world’s software - from open source to the enterprise. We believe that the best way to secure software is to detect security issues early in the development process, and deliver a great user experience that engages, supports, and motivates developers to fix security vulnerabilities in a way that integrates naturally in their workflows. Our team develops and operates the code scanning product that’s part of GitHub’s Advanced Security offering. A central part of code scanning is CodeQL, GitHub's own semantic code analysis engine that uses world-class static analysis research and technology to deeply analyze code, enabling the early detection of security vulnerabilities and correctness errors in software. CodeQL currently supports a wide range of programming languages, including C/C++, C#, Go, Java, JavaScript/TypeScript, Kotlin, Python, Ruby, and Swift. Come join one of the distributed engineering teams responsible for building and expanding the code analysis capabilities of CodeQL, used by hundreds of thousands of developers and projects every day. In this role, you will continuously innovate to expand the core capabilities of CodeQL in one of the following tracks: Responsibilities Security research In this track, you will work primarily on the CodeQL default queries and analysis libraries, as part of a CodeQL language analysis team. You will write queries in the CodeQL query language to detect new security vulnerabilities with high precision, reduce the false negative rate of the existing analysis by building models of widely-used libraries and frameworks, and contribute your expert security knowledge to refine the LLM-powered autofix capabilities included in GitHub code scanning for alerts produced by CodeQL. Program analysis In this track, you will work primarily on the CodeQL default queries, analysis libraries, and CodeQL extractors that process source code, as part of a CodeQL language analysis team. You will ensure CodeQL works well across a wide variety of programming language versions, operating systems, build systems, and customer environments. You will build and maintain analysis libraries in the CodeQL query language that reason precisely about the semantics of programs in multiple supported languages. CodeQL foundations In this track, you will be part of the CodeQL Foundations team, and work primarily on QL, the query language powering CodeQL analysis, and its underlying query compiler and evaluator within the CodeQL CLI. You will expand the expressive power of the CodeQL query language and speed up the performance of the underlying query engine, empowering the other CodeQL teams to write high-quality analysis that scales to the largest codebases in the world. CodeQL experiences In this track, you will be part of the CodeQL Experiences team, and work primarily on the CodeQL CLI, the CodeQL Action, the CodeQL extension for Visual Studio Code, GitHub backend services and APIs, and AI-powered autofix and threat modeling capabilities. You will work on integrating CodeQL as a code scanning tool into GitHub Actions, third-party CI systems, the command line, and the IDE. You will be responsible for shipping and monitoring CodeQL in production, and making its analysis even more powerful through AI-powered autofix suggestions and elegant mechanisms for customization and threat modeling. In any of the above tracks, you will work closely with various engineering teams, product managers, designers, and technical writers that build different aspects of the code scanning product, to influence product direction and deliver features to users, with clear focus on quality, reliability, and user experience. You will engage with internal users and external users (both from enterprise customers and the open-source community) to help them succeed with the product. You will grow and scale the product, working as part of our Security Products group towards our mission of securing the world’s software. You’ll influence and provide feedback on the organizational culture and processes, always looking for opportunities to improve in a continuous pursuit of excellence. Your application will be considered for each of the tracks above, based on your own experience and the availability of roles on our teams. Qualifications Minimum Qualifications: For this role, we’re looking for an experienced software engineer with: Many years of experience in software engineering or security research, with a high level of familiarity with Java, JavaScript/TypeScript, C++, C#, Rust, or a comparable programming language, and the interest and ability to learn additional languages as required and a high level of familiarity with one or more of the following areas: Software security, including static analysis, dynamic analysis, software supply chain security, or best practices in application security Experience building developer tools that operate on source code, such as compilers, parsers, static analyzers, debuggers, CLI tools, or IDE extensions Knowledge of compilers, program analysis, programming language design and implementation advanced knowledge of logic programming or database query languages (e.g. SQL, Prolog, Datalog, Kusto Query Language) Building integrations with CI/CD systems, such as GitHub Actions or Jenkins Machine learning applied to understanding source code, specifically using prompt engineering with large language models (LLMs) and systematic data collection and result evaluation Experience with the Python, Go, Ruby, or Swift programming languages Preferred Qualifications: Strong applicants will also have: The ability to work with multiple stakeholders and teams across engineering, product, and design Experience operating user-facing software at scale, including availability and observability Experience working in a distributed team, operating effectively across multiple time zones (our teams span a wide time zone range from Pacific time to Central European time) A passion for fostering good engineering practices, tools, and processes Focuses on static analysis of software, python, ruby, typescript and javascript GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"Denmark Remote","city":"Remote","country":"Denmark","country_code":"DK","location_type":"ANY","latitude":56.26392,"longitude":9.501785,"categories":[{"name":"Engineering"}],"tags2":["DK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Minimum Qualifications: For this role, we’re looking for an experienced software engineer with: Many years of experience in software engineering or security research, with a high level of familiarity with Java, JavaScript/TypeScript, C++, C#, Rust, or a comparable programming language, and the interest and ability to learn additional languages as required and a high level of familiarity with one or more of the following areas: Software security, including static analysis, dynamic analysis, software supply chain security, or best practices in application security Experience building developer tools that operate on source code, such as compilers, parsers, static analyzers, debuggers, CLI tools, or IDE extensions Knowledge of compilers, program analysis, programming language design and implementation advanced knowledge of logic programming or database query languages (e.g. SQL, Prolog, Datalog, Kusto Query Language) Building integrations with CI/CD systems, such as GitHub Actions or Jenkins Machine learning applied to understanding source code, specifically using prompt engineering with large language models (LLMs) and systematic data collection and result evaluation Experience with the Python, Go, Ruby, or Swift programming languages Preferred Qualifications: Strong applicants will also have: The ability to work with multiple stakeholders and teams across engineering, product, and design Experience operating user-facing software at scale, including availability and observability Experience working in a distributed team, operating effectively across multiple time zones (our teams span a wide time zone range from Pacific time to Central European time) A passion for fostering good engineering practices, tools, and processes Focuses on static analysis of software, python, ruby, typescript and javascript","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Security research In this track, you will work primarily on the CodeQL default queries and analysis libraries, as part of a CodeQL language analysis team. You will write queries in the CodeQL query language to detect new security vulnerabilities with high precision, reduce the false negative rate of the existing analysis by building models of widely-used libraries and frameworks, and contribute your expert security knowledge to refine the LLM-powered autofix capabilities included in GitHub code scanning for alerts produced by CodeQL. Program analysis In this track, you will work primarily on the CodeQL default queries, analysis libraries, and CodeQL extractors that process source code, as part of a CodeQL language analysis team. You will ensure CodeQL works well across a wide variety of programming language versions, operating systems, build systems, and customer environments. You will build and maintain analysis libraries in the CodeQL query language that reason precisely about the semantics of programs in multiple supported languages. CodeQL foundations In this track, you will be part of the CodeQL Foundations team, and work primarily on QL, the query language powering CodeQL analysis, and its underlying query compiler and evaluator within the CodeQL CLI. You will expand the expressive power of the CodeQL query language and speed up the performance of the underlying query engine, empowering the other CodeQL teams to write high-quality analysis that scales to the largest codebases in the world. CodeQL experiences In this track, you will be part of the CodeQL Experiences team, and work primarily on the CodeQL CLI, the CodeQL Action, the CodeQL extension for Visual Studio Code, GitHub backend services and APIs, and AI-powered autofix and threat modeling capabilities. You will work on integrating CodeQL as a code scanning tool into GitHub Actions, third-party CI systems, the command line, and the IDE. You will be responsible for shipping and monitoring CodeQL in production, and making its analysis even more powerful through AI-powered autofix suggestions and elegant mechanisms for customization and threat modeling. In any of the above tracks, you will work closely with various engineering teams, product managers, designers, and technical writers that build different aspects of the code scanning product, to influence product direction and deliver features to users, with clear focus on quality, reliability, and user experience. You will engage with internal users and external users (both from enterprise customers and the open-source community) to help them succeed with the product. You will grow and scale the product, working as part of our Security Products group towards our mission of securing the world’s software. You’ll influence and provide feedback on the organizational culture and processes, always looking for opportunities to improve in a continuous pursuit of excellence. Your application will be considered for each of the tracks above, based on your own experience and the availability of roles on our teams.","posted_date":"April 30, 2024","apply_url":"https://globalcareers-githubinc.icims.com/jobs/2936/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/100044121701262022","companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"f7c3f7dce0c0f2cf42c5f6ad2e51a9ab","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":56.26392,"longitude":9.501785},"locationType":"COUNTRY","postalAddress":{"addressLines":["Denmark"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"DK","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.15325112935815313}]},"jobSummary":"Security research In this track, you will work primarily on the CodeQL default queries and analysis libraries, as part of a CodeQL language analysis team. You will write queries in the CodeQL query language to detect new security vulnerabilities with high precision, reduce the false negative rate of the existing analysis by building models of widely-used libraries and frameworks, and contribute your expert security knowledge to refine the LLM-powered autofix capabilities included in GitHub code scanning for alerts produced by CodeQL. Program analysis In this track, you will work primarily on the CodeQL default queries, analysis libraries, and CodeQL extractors that process source code, as part of a CodeQL language analysis team. You will ensure CodeQL works well across a wide variety of programming language versions, operating systems, build systems, and customer environments. You will build and maintain analysis libraries in the CodeQL query language that reason precisely about the semantics of programs in multiple supported languages. CodeQL foundations In this track, you will be part of the CodeQL Foundations team, and work primarily on QL, the query language powering CodeQL analysis, and its underlying query compiler and evaluator within the CodeQL CLI. You will expand the expressive power of the CodeQL query language and speed up the performance of the underlying query engine, empowering the other CodeQL teams to write high-quality analysis that scales to the largest codebases in the world. CodeQL experiences In this track, you will be part of the CodeQL Experiences team, and work primarily on the CodeQL CLI, the CodeQL Action, the CodeQL extension for Visual Studio Code, GitHub backend services and APIs, and AI-powered autofix and threat modeling capabilities. You will work on integrating CodeQL as a code scanning tool into GitHub Actions, third-party CI systems, the command line, and the IDE. You will be responsible for shipping and monitoring CodeQL in production, and making its analysis even more powerful through AI-powered autofix suggestions and elegant mechanisms for customization and threat modeling. In any of the above tracks, you will work closely with various engineering teams, product managers, designers, and technical writers that build different aspects of the code scanning product, to influence product direction and deliver features to users, with clear focus on quality, reliability, and user experience. You will engage with internal users and external users (both from enterprise customers and the open-source community) to help them succeed with the product. You will grow and scale the product, working as part of our Security Products group towards our mission of securing the world’s software. You’ll influence and provide feedback on the organizational culture and processes, always looking for opportunities to improve in a continuous pursuit of excellence. Your application will be considered for each of the tracks above, based on your own experience and the availability of roles on our teams.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-05-06T15:00:22Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-04-30T19:24:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":5,"uuid":"084ce629-ceec-4dd9-a29f-ecd50afd9c18"},"import_id":"0bfd405d-22b3-41cd-ae9d-19ea8ecf68fa","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/2936?lang=en-us","last_mod":"2024-05-06T15:02:03+0000","gdpr":true},"update_date":"2024-05-06T15:02:03+0000","create_date":"2024-04-30T19:30:50+0000","category":[" Engineering"],"full_location":"Remote, Denmark","short_location":"Remote, Denmark"}},{"data":{"slug":"2940","language":"en-us","languages":["en-us"],"req_id":"2940","title":"Software Engineer, Copilot","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub Copilot has changed the way software is built, and we have a unique opportunity to look further ahead to identify how software development can be faster, safer, easier, and more accessible. We’re looking for a talented and experienced Software Engineer to join us in this mission! GitHub Copilot Extensibility owns the platform and marketplace that expands Copilot's abilities to a rich ecosystem of developer tools and services from directly within our industry-leading experiences. As a Software Engineer on the Copilot Extensibility Team, you will work closely with a distributed, diverse, and passionate team of engineers and product managers with multiple teams across GitHub and Microsoft to improve and maintain our platform that integrators depend on in their software development cycle. Together, we are dedicated to shaping the future of software development by continuously enhancing AI-powered capabilities in GitHub and beyond. The Copilot team is highly distributed and you will thrive in an environment of remote work and asynchronous communication. You're expected to have strong written communication skills and be able to develop working relationships with coworkers in locations around the globe. As an engineer at GitHub you'll always be challenged to solve interesting and novel problems that have real impact on how the world builds software. Responsibilities Lead technical decision making and architecture Design and implement scalable, reliable and performant solutions for problems like rate-limiting, request routing, etc. Write, review, and maintain code primarily in Go Mentor other engineers in their technical and architectural decision making Qualifications Required Qualifications: 2+ years experience building high traffic services at scale 2+ years experience building and/or consuming REST-style APIs 2+ years experience architecting highly available, high volume APIs 2+ years experience writing, reviewing and maintaining code in Go or Ruby on Rails or equivalent Bachelor's degree and or equivalent experience Preferred Qualifications: Experience with distributed systems at global scale Experience working with a remote, distributed team Excellent written and verbal communication skills Interest or prior experience in modern AI/machine learning technologies, Large Language Models or similar Passionate about fostering good API Design practices and processes Compensation Range The base salary range for this job is USD $90,700.00 - USD $240,500.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 2+ years experience building high traffic services at scale 2+ years experience building and/or consuming REST-style APIs 2+ years experience architecting highly available, high volume APIs 2+ years experience writing, reviewing and maintaining code in Go or Ruby on Rails or equivalent Bachelor's degree and or equivalent experience Preferred Qualifications: Experience with distributed systems at global scale Experience working with a remote, distributed team Excellent written and verbal communication skills Interest or prior experience in modern AI/machine learning technologies, Large Language Models or similar Passionate about fostering good API Design practices and processes","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Lead technical decision making and architecture Design and implement scalable, reliable and performant solutions for problems like rate-limiting, request routing, etc. Write, review, and maintain code primarily in Go Mentor other engineers in their technical and architectural decision making","posted_date":"April 30, 2024","apply_url":"https://careers-githubinc.icims.com/jobs/2940/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-04-30T18:57:26Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-04-30T18:57:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":1,"uuid":"c6a35a71-9fab-413c-a6e5-56fc887f8f98"},"import_id":"62575658-52c9-43ea-b524-50754bc432f6","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/112882569222988486","jobHash":"bacc251c974b72d23d750de642336180","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":7.17042852578733e-05}]},"jobSummary":"Lead technical decision making and architecture Design and implement scalable, reliable and performant solutions for problems like rate-limiting, request routing, etc. Write, review, and maintain code primarily in Go Mentor other engineers in their technical and architectural decision making","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2940?lang=en-us","last_mod":"2024-04-30T18:57:51+0000","gdpr":false},"create_date":"2024-04-30T18:57:51+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2931","language":"en-us","languages":["en-us"],"req_id":"2931","title":"Software Engineer II","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, Canada Overview The Client Apps organization at GitHub builds best-in-class experiences for our users to interact with Git and GitHub from whatever environment they choose. We are the small but mighty group responsible for the official GitHub CLI, GitHub Desktop, and GitHub Mobile apps. We are a product-driven organization that values building software collaboratively with our users as well as our internal partners. GitHub CLI (also known as gh) is an open source project that allows users to perform their tasks on GitHub without leaving the terminal. It has over 34K stars and is used by hundreds of thousands of developers and in many more automated workflows every day. The team is looking for a Software Engineer to help influence and build the future of GitHub CLI. Stack: - GitHub CLI is built in Go and is highly integrated with GitHub's REST and GraphQL APIs. - GitHub CLI is built using GitHub products and features such as GitHub Actions and GitHub Pages. Responsibilities Designing and building new features that will simplify developer workflows. Triaging community-reported issues and helping your teammates solve problems. Diving into unfamiliar codebases to debug issues. Collaborating with teammates and other GitHub teams to provide the best experience for our users. Qualifications Required Qualifications: A couple years of experience as a software engineer Solid understanding of testing principles and high quality software Strong analytical skills and experience Bachelor's degree or equivalent experience Preferred Qualifications: Experience with Go High degree of empathy Excellent communication skills both verbal and written Experience in working with a remote, distributed team Interest in being a part of an open source community Experience in building command line tools GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"Canada Remote","city":"Remote","country":"CAN","country_code":"CN","location_type":"ANY","latitude":23.11667,"longitude":113.25,"categories":[{"name":"Engineering"}],"tags2":["CAN-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: A couple years of experience as a software engineer Solid understanding of testing principles and high quality software Strong analytical skills and experience Bachelor's degree or equivalent experience Preferred Qualifications: Experience with Go High degree of empathy Excellent communication skills both verbal and written Experience in working with a remote, distributed team Interest in being a part of an open source community Experience in building command line tools","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Designing and building new features that will simplify developer workflows. Triaging community-reported issues and helping your teammates solve problems. Diving into unfamiliar codebases to debug issues. Collaborating with teammates and other GitHub teams to provide the best experience for our users.","posted_date":"April 29, 2024","apply_url":"https://globalcareers-githubinc.icims.com/jobs/2931/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/74927028400202438","companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"afa01aa841073f0f99f8378ff42cfb44","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[]},"jobSummary":"Designing and building new features that will simplify developer workflows. Triaging community-reported issues and helping your teammates solve problems. Diving into unfamiliar codebases to debug issues. Collaborating with teammates and other GitHub teams to provide the best experience for our users.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-05-06T15:00:58Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-04-29T18:34:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":3,"uuid":"712d0317-7cb2-4897-a945-260a2a7ac858"},"import_id":"17cc3e95-7056-42b8-8fdb-cfed49c41746","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/2931?lang=en-us","last_mod":"2024-05-06T15:02:01+0000","gdpr":false},"update_date":"2024-05-06T15:02:01+0000","create_date":"2024-04-29T18:35:53+0000","category":[" Engineering"],"full_location":"Remote, CAN","short_location":"Remote, CAN"}},{"data":{"slug":"2918","language":"en-us","languages":["en-us"],"req_id":"2918","title":"Software Engineer, CLI","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview The Client Apps organization at GitHub builds best-in-class experiences for our users to interact with Git and GitHub from whatever environment they choose. We are the small but mighty group responsible for the official GitHub CLI, GitHub Desktop, and GitHub Mobile apps. We are a product-driven organization that values building software collaboratively with our users as well as our internal partners. GitHub CLI (also known as gh) is an open source project that allows users to perform their tasks on GitHub without leaving the terminal. It has over 34K stars and is used by hundreds of thousands of developers and in many more automated workflows every day. The team is looking for a Software Engineer to help influence and build the future of GitHub CLI. Stack: - GitHub CLI is built in Go and is highly integrated with GitHub's REST and GraphQL APIs. - GitHub CLI is built using GitHub products and features such as GitHub Actions and GitHub Pages. Responsibilities Designing and building new features that will simplify developer workflows. Triaging community-reported issues and helping your teammates solve problems. Diving into unfamiliar codebases to debug issues. Collaborating with teammates and other GitHub teams to provide the best experience for our users. Qualifications Required Qualifications: A couple years of experience as a software engineer Solid understanding of testing principles and high quality software Strong analytical skills and experience Bachelor's degree or equivalent experience Preferred Qualifications: Experience with Go High degree of empathy Excellent communication skills both verbal and written Experience in working with a remote, distributed team Interest in being a part of an open source community Experience in building command line tools GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"United Kingdom Remote","city":"Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: A couple years of experience as a software engineer Solid understanding of testing principles and high quality software Strong analytical skills and experience Bachelor's degree or equivalent experience Preferred Qualifications: Experience with Go High degree of empathy Excellent communication skills both verbal and written Experience in working with a remote, distributed team Interest in being a part of an open source community Experience in building command line tools","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Designing and building new features that will simplify developer workflows. Triaging community-reported issues and helping your teammates solve problems. Diving into unfamiliar codebases to debug issues. Collaborating with teammates and other GitHub teams to provide the best experience for our users.","posted_date":"April 25, 2024","apply_url":"https://globalcareers-githubinc.icims.com/jobs/2918/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/105351653843968710","companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"9c6755c674cb2b0357a7191506c68d91","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"Designing and building new features that will simplify developer workflows. Triaging community-reported issues and helping your teammates solve problems. Diving into unfamiliar codebases to debug issues. Collaborating with teammates and other GitHub teams to provide the best experience for our users.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-05-06T15:00:53Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-04-25T14:15:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":8,"uuid":"d8f22830-aa3a-4204-b36f-4dd7fb3392f6"},"import_id":"c8f9d530-e552-4a03-9a7b-06e2c3fca069","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/2918?lang=en-us","last_mod":"2024-05-06T15:01:55+0000","gdpr":true},"update_date":"2024-05-06T15:01:55+0000","create_date":"2024-04-25T15:12:16+0000","category":[" Engineering"],"full_location":"Remote, United Kingdom","short_location":"Remote, United Kingdom"}},{"data":{"slug":"2919","language":"en-us","languages":["en-us"],"req_id":"2919","title":"Senior Software Engineering Manager","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub Copilot has changed the way software is built, and we have a unique opportunity to look further ahead to identify how software development can be faster, safer, easier, and more accessible. We’re looking for a talented and experienced Software Engineer Manager to join us in this mission! The Copilot engineering organization has the crucial role of driving GitHub’s vision for the future of AI-powered software development. Our primary responsibilities encompass various areas of enterprise enablement, such as Billing and License management, enterprise policies and other features. In this role, you will be responsible for driving the engineering related efforts and integrating these solutions into the Copilot product. You will collaborate closely with a diverse and highly skilled group of product managers, designers, researchers, and software engineers within our team, while partnering with many other teams across GitHub and Microsoft. Together, we are dedicated to shaping the future of software development by building AI-powered capabilities into GitHub’s existing and future portfolio of products. Responsibilities Problem Solving: Identifying and addressing complex challenges and providing creative solutions to advance the organization's goals. Engineering Excellence: Fostering strong engineering practices and processes, growing generational teams that value excellence. Team Leadership: Leading and managing a team of engineers, which may include hiring, mentoring, and providing guidance to team members to help them excel in their roles. Conducting performance evaluations, setting goals, and providing feedback to team members to help them grow and develop in their roles. Project Management: Overseeing the planning, execution, and successful completion of projects, ensuring they align with the organization's goals and objectives. Strategy: Developing and implementing a strategic roadmap that supports our organization's long-term vision and objectives, including identifying areas of focus and setting priorities. At times this will mean charting the strategic path through ambiguity and uncertainty. Collaboration: Collaborating with cross-functional teams, including engineers, product managers, designers, and data scientists to integrate solutions into product development and business strategies. Innovation: Driving innovation within the team by exploring new methodologies, tools, and technologies that can enhance research capabilities and outcomes. Communication: Effectively communicating status, findings, insights, and recommendations to the leadership team. Demonstration and encouragement around the importance of strong written and verbal communication skills. Quality Assurance: Ensuring that work conducted by the team meets high-quality standards and adheres to ethical guidelines and industry best practices. Qualifications Minimum Qualifications: 6+ years of professional engineering or related experience 2+ years of managing engineering teams 2+ years experience designing, building, scaling and maintaining distributed systems Experience in testing, production system monitoring, and observability Bachelor's degree or equivalent experience Preferred Qualifications: These are more specific abilities we’re looking for, but it’s rare that someone possesses them all. Think of this as a descriptive sketch, not a checklist of requirements. We encourage you to apply even if you don’t have all of them. Track record of strong analytical skills as well as communication skills both verbal and written. Interest or prior experience in modern AI/machine learning technologies, Large Language Models or similar Have significant experience with one or more backend technologies: server-side environments, compute, data stores, networking, infrastructure, devops, security, and programming languages. Have significant experience with open-source software, communities, and the systems these communities use to self-organize and ship software for others. Candidates located in PST (Pacific Standard Time) are strongly preferred Compensation Range The base salary range for this job is USD $104,400.00 - USD $276,900.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Senior Manager"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Minimum Qualifications: 6+ years of professional engineering or related experience 2+ years of managing engineering teams 2+ years experience designing, building, scaling and maintaining distributed systems Experience in testing, production system monitoring, and observability Bachelor's degree or equivalent experience Preferred Qualifications: These are more specific abilities we’re looking for, but it’s rare that someone possesses them all. Think of this as a descriptive sketch, not a checklist of requirements. We encourage you to apply even if you don’t have all of them. Track record of strong analytical skills as well as communication skills both verbal and written. Interest or prior experience in modern AI/machine learning technologies, Large Language Models or similar Have significant experience with one or more backend technologies: server-side environments, compute, data stores, networking, infrastructure, devops, security, and programming languages. Have significant experience with open-source software, communities, and the systems these communities use to self-organize and ship software for others. Candidates located in PST (Pacific Standard Time) are strongly preferred","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Problem Solving: Identifying and addressing complex challenges and providing creative solutions to advance the organization's goals. Engineering Excellence: Fostering strong engineering practices and processes, growing generational teams that value excellence. Team Leadership: Leading and managing a team of engineers, which may include hiring, mentoring, and providing guidance to team members to help them excel in their roles. Conducting performance evaluations, setting goals, and providing feedback to team members to help them grow and develop in their roles. Project Management: Overseeing the planning, execution, and successful completion of projects, ensuring they align with the organization's goals and objectives. Strategy: Developing and implementing a strategic roadmap that supports our organization's long-term vision and objectives, including identifying areas of focus and setting priorities. At times this will mean charting the strategic path through ambiguity and uncertainty. Collaboration: Collaborating with cross-functional teams, including engineers, product managers, designers, and data scientists to integrate solutions into product development and business strategies. Innovation: Driving innovation within the team by exploring new methodologies, tools, and technologies that can enhance research capabilities and outcomes. Communication: Effectively communicating status, findings, insights, and recommendations to the leadership team. Demonstration and encouragement around the importance of strong written and verbal communication skills. Quality Assurance: Ensuring that work conducted by the team meets high-quality standards and adheres to ethical guidelines and industry best practices.","posted_date":"April 24, 2024","apply_url":"https://careers-githubinc.icims.com/jobs/2919/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/133630822327427782","companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"cd2a53dd7ba6f67ca2175e0c4e63c32d","derivedInfo":{"jobCategories":["MANAGEMENT","COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":7.17042852578733e-05}]},"jobSummary":"Problem Solving: Identifying and addressing complex challenges and providing creative solutions to advance the organization's goals. Engineering Excellence: Fostering strong engineering practices and processes, growing generational teams that value excellence. Team Leadership: Leading and managing a team of engineers, which may include hiring, mentoring, and providing guidance to team members to help them excel in their roles. Conducting performance evaluations, setting goals, and providing feedback to team members to help them grow and develop in their roles. Project Management: Overseeing the planning, execution, and successful completion of projects, ensuring they align with the organization's goals and objectives. Strategy: Developing and implementing a strategic roadmap that supports our organization's long-term vision and objectives, including identifying areas of focus and setting priorities. At times this will mean charting the strategic path through ambiguity and uncertainty. Collaboration: Collaborating with cross-functional teams, including engineers, product managers, designers, and data scientists to integrate solutions into product development and business strategies. Innovation: Driving innovation within the team by exploring new methodologies, tools, and technologies that can enhance research capabilities and outcomes. Communication: Effectively communicating status, findings, insights, and recommendations to the leadership team. Demonstration and encouragement around the importance of strong written and verbal communication skills. Quality Assurance: Ensuring that work conducted by the team meets high-quality standards and adheres to ethical guidelines and industry best practices.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-05-06T15:00:53Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-04-24T20:22:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":3,"uuid":"8e38974b-b565-4098-b0fa-48ae24c21080"},"import_id":"704c1c8a-a9c0-4da4-8ef7-4685d4d251e4","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/2919?lang=en-us","last_mod":"2024-05-06T15:02:25+0000","gdpr":false},"update_date":"2024-05-06T15:02:25+0000","create_date":"2024-04-24T20:23:16+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2786","language":"en-us","languages":["en-us"],"req_id":"2786","title":"Senior Software Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is looking for engineers to join the Traffic Engineering team within our larger Infrastructure Engineering organization. You will focus on the systems and tools that enable our engineers to operate and scale the world's largest code hosting platform. You will help develop and maintain our edge and internal load balancing and caching infrastructure. You will also help improve end user performance through the expansion our global network. Nearly every byte in and out of GitHub’s network will traverse systems you own. The Infrastructure Engineering team is highly distributed and you will thrive in an environment of remote work and asynchronous communication. You're expected to have strong written communication skills and be able to develop working relationships with coworkers in locations around the globe. As an engineer at GitHub you'll always be challenged to solve interesting and novel problems that have real impact on how the world builds software. Responsibilities Design, build and maintain core components of the GitHub Edge stack. Cultivate GLB and other open source projects developed by GitHub and build things you are proud to share. Work closely with our application, network, observability, virtualization, and security teams to build secure, feature rich, and performant software in support of our global platform. Help to take your code to production, troubleshoot any issues that arise, and own fixing any associated bugs. Qualifications Minimum Qualifications: 5+ years of experience with Linux kernel, network programming and/or HAProxy at scale 5+ years experience with core functionality of standard protocols such as TCP, UDP, HTTP, TLS, GRE, and/or DNS 5+ years proficiency in one (or more) language(s) like Ruby, Python, or Golang 3+ years deploying systems with Terraform, Ansible, and/or Puppet Bachelor's degree or equivalent experience Preferred Qualifications: Application layer DDoS remediation techniques and experience, especially in a network edge environment Knowledge of when and how to deploy web acceleration techniques (e.g. caching, persistent connections, network stack tuning). Experience diagnosing and resolving performance problems at the intersection of software and hardware. You take a pragmatic approach to decision making and design choices. Azure technologies or cloud migrations of production environments Demonstrated experience with technologies such as anycast, BGP, XDP, eBPF, or P4. Experience using GitHub as a software development platform. Comfort working as part of a geographically distributed team and in a highly available environment. Hands-on experience running services in a distributed infrastructure. Compensation Range The base salary range for this job is USD $104,400.00 - USD $276,900.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Minimum Qualifications: 5+ years of experience with Linux kernel, network programming and/or HAProxy at scale 5+ years experience with core functionality of standard protocols such as TCP, UDP, HTTP, TLS, GRE, and/or DNS 5+ years proficiency in one (or more) language(s) like Ruby, Python, or Golang 3+ years deploying systems with Terraform, Ansible, and/or Puppet Bachelor's degree or equivalent experience Preferred Qualifications: Application layer DDoS remediation techniques and experience, especially in a network edge environment Knowledge of when and how to deploy web acceleration techniques (e.g. caching, persistent connections, network stack tuning). Experience diagnosing and resolving performance problems at the intersection of software and hardware. You take a pragmatic approach to decision making and design choices. Azure technologies or cloud migrations of production environments Demonstrated experience with technologies such as anycast, BGP, XDP, eBPF, or P4. Experience using GitHub as a software development platform. Comfort working as part of a geographically distributed team and in a highly available environment. Hands-on experience running services in a distributed infrastructure.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Design, build and maintain core components of the GitHub Edge stack. Cultivate GLB and other open source projects developed by GitHub and build things you are proud to share. Work closely with our application, network, observability, virtualization, and security teams to build secure, feature rich, and performant software in support of our global platform. Help to take your code to production, troubleshoot any issues that arise, and own fixing any associated bugs.","posted_date":"April 15, 2024","apply_url":"https://careers-githubinc.icims.com/jobs/2786/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/139109362619556550","companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"11cc27a401f9c3bbb512e9a7de569f34","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":7.17042852578733e-05}]},"jobSummary":"Design, build and maintain core components of the GitHub Edge stack. Cultivate GLB and other open source projects developed by GitHub and build things you are proud to share. Work closely with our application, network, observability, virtualization, and security teams to build secure, feature rich, and performant software in support of our global platform. Help to take your code to production, troubleshoot any issues that arise, and own fixing any associated bugs.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2024-05-06T15:00:33Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-04-15T14:50:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":3,"uuid":"7f137754-30dc-4c69-ac4c-6c00125c62c8"},"import_id":"a507aa99-71b9-4087-b5c3-bf9162223d2d","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/2786?lang=en-us","last_mod":"2024-05-06T15:00:57+0000","gdpr":false},"update_date":"2024-05-06T15:00:57+0000","create_date":"2024-04-15T14:51:18+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}}],"totalCount":25,"count":25,"filter":{"displayLimit":10,"categories":{"all":[{"category":"Engineering","numJobs":25}],"shortlist":[{"category":"Engineering","numJobs":25}]},"brands":{"all":[],"shortlist":[]},"experienceLevels":{"all":[],"shortlist":[]},"locations":{"all":[{"city":"Remote","state":null,"country":"CAN","count":1},{"city":"Remote","state":null,"country":"Denmark","count":1},{"city":"Remote","state":null,"country":"United Kingdom","count":7},{"city":"Remote","state":null,"country":"United States","count":16}],"shortlist":[{"city":"Remote","state":null,"country":"CAN","count":1},{"city":"Remote","state":null,"country":"Denmark","count":1},{"city":"Remote","state":null,"country":"United Kingdom","count":7},{"city":"Remote","state":null,"country":"United States","count":16}]},"facetList":{"tags4":[{"term":"Experienced Professional","count":25}],"tags5":[{"term":"Individual Contributor","count":22},{"term":"Senior Manager","count":2},{"term":"Director","count":1}],"tags6":[{"term":"Yes","count":25}]}},"languageCounts":{"en-us":{"displayName":"English","count":25}},"request_id":false,"locations":[]}