{"jobs":[{"data":{"slug":"4097","language":"en-us","languages":["en-us"],"req_id":"4097","title":"Staff Software Engineer - Client Apps","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, Germany Overview GitHub is seeking a Staff Software Engineer to help shape the future of our client-facing experiences, including GitHub Desktop, GitHub CLI, and our native mobile apps for iOS and Android. As a Staff Engineer, you'll bring deep technical expertise, broad system awareness, and a passion for crafting high-quality, user-centric tools. This role is ideal for someone who thrives at the intersection of product, platform, and user experience, balancing architectural leadership with hands-on contributions across multiple platforms. Responsibilities Provide technical leadership across client platforms (desktop, CLI, mobile), aligning engineering efforts with long-term product and architectural vision. Lead design and implementation efforts for high-impact projects, balancing performance, maintainability, and usability. Collaborate with cross-functional teams to design and deliver polished, user-focused features that scale across operating systems and developer workflows. Drive engineering excellence through thoughtful code reviews, clear documentation, and scalable testing strategies. Foster a culture of ownership, mentorship, and continuous learning, supporting the growth of engineers across multiple teams. Improve build systems, deployment processes, and release pipelines for native and cross-platform apps. Identify and reduce technical debt in long-lived codebases, guiding teams through meaningful refactors and modernization efforts. Champion GitHub's values of accessibility, security, and inclusivity in client software development. Qualifications Required: Minimum 9 years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, Rust, Python, JavaScript, C, C++, C#, Java, OR equivalent experience Experience of delivering high-quality software in one or more client domains (mobile, desktop, CLI). Experience with application packaging and distribution pipelines (e.g., App Store, Play Store, GitHub Releases). Experience with Swift, Kotlin, TypeScript. Preferred: Understanding of telemetry, crash reporting, and performance optimization for client applications. Architectural design skills, with experience guiding projects from concept to delivery. Experience mentoring engineers and shaping inclusive, growth-oriented team cultures. Ability to work collaboratively across engineering, design, and product to align technical solutions with user and business needs. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. Equal Employment Opportunity GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"Germany Remote","country":"Germany","country_code":"DE","location_type":"ANY","latitude":51.165691,"longitude":10.451526,"categories":[{"name":"Engineering"}],"tags2":["DE-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"tags7":["Global Careers (External)"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required: Minimum 9 years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, Rust, Python, JavaScript, C, C++, C#, Java, OR equivalent experience Experience of delivering high-quality software in one or more client domains (mobile, desktop, CLI). Experience with application packaging and distribution pipelines (e.g., App Store, Play Store, GitHub Releases). Experience with Swift, Kotlin, TypeScript. Preferred: Understanding of telemetry, crash reporting, and performance optimization for client applications. Architectural design skills, with experience guiding projects from concept to delivery. Experience mentoring engineers and shaping inclusive, growth-oriented team cultures. Ability to work collaboratively across engineering, design, and product to align technical solutions with user and business needs.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Provide technical leadership across client platforms (desktop, CLI, mobile), aligning engineering efforts with long-term product and architectural vision. Lead design and implementation efforts for high-impact projects, balancing performance, maintainability, and usability. Collaborate with cross-functional teams to design and deliver polished, user-focused features that scale across operating systems and developer workflows. Drive engineering excellence through thoughtful code reviews, clear documentation, and scalable testing strategies. Foster a culture of ownership, mentorship, and continuous learning, supporting the growth of engineers across multiple teams. Improve build systems, deployment processes, and release pipelines for native and cross-platform apps. Identify and reduce technical debt in long-lived codebases, guiding teams through meaningful refactors and modernization efforts. Champion GitHub's values of accessibility, security, and inclusivity in client software development.","posted_date":"2025-06-23T13:56:00+0000","posting_expiry_date":"2025-07-06T23:00:00+0000","apply_url":"https://globalcareers-githubinc.icims.com/jobs/4097/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"last_mod":"2025-07-01T03:54:56.366+00:00","icims":{"jps_is_public":true,"date_updated":"2025-06-26T18:51:44Z","primary_posted_site_object":{"site":"globalcareers-githubinc","validThrough":"2025-07-06T23:00:00+0000","siteId":"48855464-2bde-48e1-af86-f8c7872d8750","datePosted":"2025-06-23T13:56:00+0000"},"config_keys":null,"revision_int":7,"uuid":"5cb32b30-47b5-4671-8644-098ac1ca0f10"},"googlejobs":{"jobName":"projects/helpful-passage-853/jobs/136358712376730310","jobTitleSnippet":"","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","searchTextSnippet":"","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"radiusInMiles":0.21074204644792707,"postalAddress":{"regionCode":"DE","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["Germany"],"administrativeArea":"","languageCode":"","revision":0},"locationType":"COUNTRY","latLng":{"latitude":51.165691,"longitude":10.451526}}]},"jobHash":"82b5ec75bd3bd5b3f74e6a18b4861f0b","jobSummary":"Provide technical leadership across client platforms (desktop, CLI, mobile), aligning engineering efforts with long-term product and architectural vision. Lead design and implementation efforts for high-impact projects, balancing performance, maintainability, and usability. Collaborate with cross-functional teams to design and deliver polished, user-focused features that scale across operating systems and developer workflows. Drive engineering excellence through thoughtful code reviews, clear documentation, and scalable testing strategies. Foster a culture of ownership, mentorship, and continuous learning, supporting the growth of engineers across multiple teams. Improve build systems, deployment processes, and release pipelines for native and cross-platform apps. Identify and reduce technical debt in long-lived codebases, guiding teams through meaningful refactors and modernization efforts. Champion GitHub's values of accessibility, security, and inclusivity in client software development."},"import_id":"8f9dfe59-bed8-480f-9ca7-cca9117d8478","redirectOnApply":true,"import_source":"ImporterService","canonical_url":"https://githubinc.jibeapply.com/jobs/4097?lang=en-us","client_code":"githubinc","gdpr":true},"update_date":"2025-07-01T03:54:56+0000","create_date":"2025-07-01T03:54:56+0000","category":[" Engineering"],"full_location":"Germany","short_location":"Germany","multipleLocations":false}},{"data":{"slug":"4265","language":"en-us","languages":["en-us"],"req_id":"4265","title":"Senior Software Engineer, Supply Chain Security","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview As an engineer at GitHub, you will work with a distributed, diverse and passionate team delivering the services that millions of developers rely on to build their own software. The Dependabot team is looking for a Senior Software Engineer to help us create a world-class offering in the Software Composition Analysis (SCA) space. The ideal candidate will have a background in large distributed systems, high-throughput cloud architectures, and an obsession with getting genuine accuracy in squishy domains. You’re an outside-the-box thinker with an interest in the cutting edge, but a strong pragmatic streak. People tend to follow your lead because you go to sensible places. Responsibilities Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Mentor junior engineers Provide technical leadership, mentorship, pairing opportunities, and code reviews Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code. Qualifications Required Qualifications: 6+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related fie OR equivalent experience. 6+ years of experience with relational databases (MySQL, PSQL, MSSQL, etc) 1+ year experience shipping production software on a big 3 cloud platform (AWS, GCP, Azure) Preferred Qualifications: At least one year of experience as a non-management team lead Previous experience working at a senior level on a cyber security product working at a relatively large scale (billions of writes/day) building ETL pipelines and succeeding with asynchronous architectures building with frontier AI models maintaining non-obscure open source projects Interest in Software Composition Analysis Strong passion for Ruby and/or Go An understanding of GitHub’s place in the open source software world Deep opinions on Dependabot An unshakable belief that winners ship Compensation Range The base salary range for this job is USD $112,800.00 - USD $299,300.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"tags7":["US Careers (External)"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 6+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related fie OR equivalent experience. 6+ years of experience with relational databases (MySQL, PSQL, MSSQL, etc) 1+ year experience shipping production software on a big 3 cloud platform (AWS, GCP, Azure) Preferred Qualifications: At least one year of experience as a non-management team lead Previous experience working at a senior level on a cyber security product working at a relatively large scale (billions of writes/day) building ETL pipelines and succeeding with asynchronous architectures building with frontier AI models maintaining non-obscure open source projects Interest in Software Composition Analysis Strong passion for Ruby and/or Go An understanding of GitHub’s place in the open source software world Deep opinions on Dependabot An unshakable belief that winners ship","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Mentor junior engineers Provide technical leadership, mentorship, pairing opportunities, and code reviews Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","posted_date":"2025-06-19T21:13:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/4265/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"last_mod":"2025-07-01T03:54:56.366+00:00","icims":{"jps_is_public":true,"date_updated":"2025-06-30T19:55:40Z","primary_posted_site_object":{"site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9","datePosted":"2025-06-19T21:13:00+0000"},"config_keys":null,"revision_int":6,"uuid":"b68bc8dd-5670-44ef-8697-45dd995896bf"},"googlejobs":{"jobName":"projects/helpful-passage-853/jobs/87302901591876294","jobTitleSnippet":"","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","searchTextSnippet":"","derivedInfo":{"jobCategories":["COMPUTER_AND_IT","TRANSPORTATION_AND_LOGISTICS","BUSINESS_OPERATIONS"],"locations":[{"radiusInMiles":2.6691467883166546,"postalAddress":{"regionCode":"US","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["United States"],"administrativeArea":"","languageCode":"","revision":0},"locationType":"COUNTRY","latLng":{"latitude":38.7945952,"longitude":-106.5348379}}]},"jobHash":"8c9694d6a45d96b74518e929512f12f4","jobSummary":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Mentor junior engineers Provide technical leadership, mentorship, pairing opportunities, and code reviews Own and advocate for the health and quality of the systems that the team builds, including participating in on-call and first responder rotations Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code."},"import_id":"8f9dfe59-bed8-480f-9ca7-cca9117d8478","redirectOnApply":true,"import_source":"ImporterService","canonical_url":"https://githubinc.jibeapply.com/jobs/4265?lang=en-us","client_code":"githubinc","gdpr":false},"update_date":"2025-07-01T03:54:56+0000","create_date":"2025-07-01T03:54:56+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"4168","language":"en-us","languages":["en-us"],"req_id":"4168","title":"Staff Software Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview The Developer Experience (DX) and Migration department is seeking for a Staff Software Engineer to help lead the development of foundational components that power GitHub products and its migration tooling. This team is dedicated to improving the internal developer experience at GitHub, encompassing all phases of application development. Our responsibilities include optimizing the development process, delivering robust DevOps solutions, managing virtual infrastructure, and more. Additionally, we are tasked with creating the tools that facilitate customer migrations to GitHub and between different products. Our mission is enabling GitHub developers to work efficiently, ensure our platforms remain stable, secure, and reliable and provide a seamless migration experience to our customers. This role is critical in a fast-paced environment where you can make a high-impact contribution to our product offerings. As a Staff Software Engineer, you will collaborate with a globally distributed team of managers and engineers to enhance and scale our products, ensuring an exceptional experience that meets the unique needs of our diverse customer base. This role requires extensive experience in both platform and application development, a passion for using AI tools, and the ability to leverage them in our daily operations. You should be able to flex your skill sets to create innovative solutions and drive long-term positive strategic outcomes for GitHub. Responsibilities Lead and mentor team members in producing extensible and maintainable code, ensuring integration with downstream dependencies and adherence to quality standards. Partner with stakeholders to determine user requirements and lead discussions for technical solutions, including design and cost considerations, while ensuring system architecture meets security and compliance standards. Independently create and guide others in developing clear testing plans to assure solution quality, defining success metrics, and integrating customer feedback for continuous improvement. Drive project plans and release schedules by leveraging cross-product expertise, identifying dependencies, and coordinating with other teams to ensure timely delivery and alignment with business objectives. Lead efforts in applying debugging tools and telemetry to verify assumptions, proactively resolve issues, and optimize code performance and maintainability. Collect, classify, and analyze complex data to refine products, make informed engineering decisions, and ensure solutions are scalable and financially responsible. Maintain live service operations, implement solutions to complex issues, and develop playbooks for incident resolution, ensuring system health and reliability. Lead the development and enhancement of internal tools and processes to improve team performance and efficiency, encouraging the adoption of AI, new technologies and methodologies. Develop and maintain a technical roadmap that aligns with product goals, ensuring that engineering efforts are strategically prioritized, and resources are effectively allocated. Qualifications Required Qualifications: 9+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR associate’s degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 8+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR bachelor's degree in Computer Science or related field AND 7+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR master's degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR equivalent experience. Preferred Qualifications: Demonstrated experience with large-scale system architecture and design, particularly in cloud-based environments, with a strong understanding of distributed systems and microservices. Experience working closely with product management, design, and other engineering teams to drive cross-functional projects and deliver high-quality products Excellent analytical skills when proactively identifying risks and balancing priorities. Compensation Range The base salary range for this job is USD $127,600.00 - USD $338,500.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"tags7":["US Careers (External)"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 9+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR associate’s degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 8+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR bachelor's degree in Computer Science or related field AND 7+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR master's degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR equivalent experience. Preferred Qualifications: Demonstrated experience with large-scale system architecture and design, particularly in cloud-based environments, with a strong understanding of distributed systems and microservices. Experience working closely with product management, design, and other engineering teams to drive cross-functional projects and deliver high-quality products Excellent analytical skills when proactively identifying risks and balancing priorities.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Lead and mentor team members in producing extensible and maintainable code, ensuring integration with downstream dependencies and adherence to quality standards. Partner with stakeholders to determine user requirements and lead discussions for technical solutions, including design and cost considerations, while ensuring system architecture meets security and compliance standards. Independently create and guide others in developing clear testing plans to assure solution quality, defining success metrics, and integrating customer feedback for continuous improvement. Drive project plans and release schedules by leveraging cross-product expertise, identifying dependencies, and coordinating with other teams to ensure timely delivery and alignment with business objectives. Lead efforts in applying debugging tools and telemetry to verify assumptions, proactively resolve issues, and optimize code performance and maintainability. Collect, classify, and analyze complex data to refine products, make informed engineering decisions, and ensure solutions are scalable and financially responsible. Maintain live service operations, implement solutions to complex issues, and develop playbooks for incident resolution, ensuring system health and reliability. Lead the development and enhancement of internal tools and processes to improve team performance and efficiency, encouraging the adoption of AI, new technologies and methodologies. Develop and maintain a technical roadmap that aligns with product goals, ensuring that engineering efforts are strategically prioritized, and resources are effectively allocated.","posted_date":"2025-07-01T15:14:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/4168/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"last_mod":"2025-07-01T15:17:45.347+00:00","icims":{"jps_is_public":true,"date_updated":"2025-07-01T15:16:51Z","primary_posted_site_object":{"site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9","datePosted":"2025-07-01T15:14:00+0000"},"config_keys":null,"revision_int":7,"uuid":"9a7e2f91-4b56-409f-9412-920a239f51d4"},"googlejobs":{"jobName":"projects/helpful-passage-853/jobs/109453697204789958","jobTitleSnippet":"","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","searchTextSnippet":"","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"radiusInMiles":2.6691467883166546,"postalAddress":{"regionCode":"US","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["United States"],"administrativeArea":"","languageCode":"","revision":0},"locationType":"COUNTRY","latLng":{"latitude":38.7945952,"longitude":-106.5348379}}]},"jobHash":"2a1c9eac789f6f88d0fdd63baca419c5","jobSummary":"Lead and mentor team members in producing extensible and maintainable code, ensuring integration with downstream dependencies and adherence to quality standards. Partner with stakeholders to determine user requirements and lead discussions for technical solutions, including design and cost considerations, while ensuring system architecture meets security and compliance standards. Independently create and guide others in developing clear testing plans to assure solution quality, defining success metrics, and integrating customer feedback for continuous improvement. Drive project plans and release schedules by leveraging cross-product expertise, identifying dependencies, and coordinating with other teams to ensure timely delivery and alignment with business objectives. Lead efforts in applying debugging tools and telemetry to verify assumptions, proactively resolve issues, and optimize code performance and maintainability. Collect, classify, and analyze complex data to refine products, make informed engineering decisions, and ensure solutions are scalable and financially responsible. Maintain live service operations, implement solutions to complex issues, and develop playbooks for incident resolution, ensuring system health and reliability. Lead the development and enhancement of internal tools and processes to improve team performance and efficiency, encouraging the adoption of AI, new technologies and methodologies. Develop and maintain a technical roadmap that aligns with product goals, ensuring that engineering efforts are strategically prioritized, and resources are effectively allocated."},"import_id":"61258ccc-9ec0-4dd4-b9d2-e4f42a78cefe","redirectOnApply":true,"import_source":"ImporterService","canonical_url":"https://githubinc.jibeapply.com/jobs/4168?lang=en-us","client_code":"githubinc","gdpr":false},"update_date":"2025-07-01T15:17:45+0000","create_date":"2025-07-01T15:17:45+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"3856","language":"en-us","languages":["en-us"],"req_id":"3856","title":"Software Engineer III, Codespaces \u0026 Copilot Workspace","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, Germany Overview We’re building the future of cloud development with Codespaces: instant-on, container-based cloud environments tailored to specific projects, enabling developers to focus on writing code rather than managing setups. As a Software Engineer III on the compute team, you’ll design and implement a secure, reliable, and efficient platform that powers Codespaces, Copilot Workspace, and our LLM-based tooling. Your work will directly impact developers worldwide, ensuring these tools are always available, performant, cost-effective, and delightful to use. At GitHub, you’ll collaborate with a distributed, diverse, and passionate team of engineers and designers, delivering services that millions of developers depend on daily. In this role, you’ll design, prototype, implement, ship, and support highly performant, inspiring experiences that enhance collaboration and productivity for developers everywhere. We’re looking for creative problem solvers and diverse thinkers who value culture as much as customers and features. We believe how we work is just as important as what we deliver. Big vision, shared purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what drive great results. Great products reflect the teams that build them—come join us! Responsibilities Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary. Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code. Qualifications Required Qualifications: Experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR equivalent experience. Experience in cloud-native development, including designing, building, and deploying scalable applications using microservices architecture, containers (e.g., Docker), and orchestration tools like Kubernetes. Proficiency in leveraging cloud platforms (e.g., AWS, Azure, or GCP) for optimizing application performance and scalability. Experience with on-call rotations, incident response and site reliability, including diagnosing and resolving complex production issues under pressure. Experience implementing and maintaining compliance and security practices in software development, including secure coding, vulnerability management, data privacy, and regulatory standards (e.g., GDPR, SOC 2, HIPAA). Proficiency in designing systems with robust security measures and ensuring adherence to organizational and industry compliance requirements. Preferred Qualifications: Proficiency in modern programming languages such as C#, TypeScript, Go, and Rust. Excellent written and verbal communication via async collaboration, documentation, and visibility of work. Experience working with a remote, distributed team. Passionate about fostering effective Engineering practices and processes. Proficiency in Git and GitHub for version control and collaborative development and branching strategies. Experience with CI/CD Tools: Strong knowledge of CI/CD concepts and best practices. Experience with GitHub actions and workflows platform, familiar with other tools like Jenkins Contribute to open source software, engage with maintainers, and actively participate in community curation. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. Equal Employment Opportunity GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"Germany Remote","country":"Germany","country_code":"DE","location_type":"ANY","latitude":51.165691,"longitude":10.451526,"categories":[{"name":"Engineering"}],"tags2":["DE-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"tags7":["Global Careers (External)"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: Experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR equivalent experience. Experience in cloud-native development, including designing, building, and deploying scalable applications using microservices architecture, containers (e.g., Docker), and orchestration tools like Kubernetes. Proficiency in leveraging cloud platforms (e.g., AWS, Azure, or GCP) for optimizing application performance and scalability. Experience with on-call rotations, incident response and site reliability, including diagnosing and resolving complex production issues under pressure. Experience implementing and maintaining compliance and security practices in software development, including secure coding, vulnerability management, data privacy, and regulatory standards (e.g., GDPR, SOC 2, HIPAA). Proficiency in designing systems with robust security measures and ensuring adherence to organizational and industry compliance requirements. Preferred Qualifications: Proficiency in modern programming languages such as C#, TypeScript, Go, and Rust. Excellent written and verbal communication via async collaboration, documentation, and visibility of work. Experience working with a remote, distributed team. Passionate about fostering effective Engineering practices and processes. Proficiency in Git and GitHub for version control and collaborative development and branching strategies. Experience with CI/CD Tools: Strong knowledge of CI/CD concepts and best practices. Experience with GitHub actions and workflows platform, familiar with other tools like Jenkins Contribute to open source software, engage with maintainers, and actively participate in community curation.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary. Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","posted_date":"2024-12-20T21:43:00+0000","apply_url":"https://globalcareers-githubinc.icims.com/jobs/3856/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"last_mod":"2025-07-02T15:25:45.570+00:00","icims":{"jps_is_public":true,"date_updated":"2025-07-02T15:25:19Z","primary_posted_site_object":{"site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750","datePosted":"2024-12-20T21:43:00+0000"},"config_keys":null,"revision_int":36,"uuid":"da36c9fc-28b1-48b6-adf5-e38f6b5b0ba3"},"googlejobs":{"jobName":"projects/helpful-passage-853/jobs/74187926895764166","jobTitleSnippet":"","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","searchTextSnippet":"","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"radiusInMiles":0.21074204644792707,"postalAddress":{"regionCode":"DE","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["Germany"],"administrativeArea":"","languageCode":"","revision":0},"locationType":"COUNTRY","latLng":{"latitude":51.165691,"longitude":10.451526}}]},"jobHash":"d6e82f26d54e9609a49cca692bccae0e","jobSummary":"Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary. Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code."},"import_id":"afba67bc-ca65-4601-8e47-a7524501b56c","redirectOnApply":true,"import_source":"ImporterService","canonical_url":"https://githubinc.jibeapply.com/jobs/3856?lang=en-us","client_code":"githubinc","gdpr":true},"update_date":"2025-07-02T15:25:45+0000","create_date":"2025-07-01T03:54:56+0000","category":[" Engineering"],"full_location":"Germany","short_location":"Germany","multipleLocations":false}},{"data":{"slug":"3775","language":"en-us","languages":["en-us"],"req_id":"3775","title":"Software Engineer III, Runtime Platform","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is changing the way the world builds software, and we want you to help. At GitHub, we constantly strive to create an environment that allows our employees to do the best work of their lives. GitHub is looking for a talented Software Engineer to join our Platform Team in the Development Experience department. Our team is working on multiple products all aimed to enable GitHub’s engineers to deliver value in a faster and secure way. We work on the entire delivery stack from chatops infra to PR linting and up to the actual deployments of Github’s services both to k8s and vm environments. On this team, you’ll collaborate across functions and across teams to deliver the best possible developer experience for all engineers here at GitHub. In this role, you will be having the opportunity to work as an engineer with a globally distributed, diverse and passionate team where you will be expected to demonstrate independence and a drive to deliver. You will design, implement, rollout and support a highly performant, highly scalable and highly available infrastructure with your team and production managers. This team and its parent Development Experience department are highly distributed across the globe and span a variety of diverse backgrounds. We recognize the value this diversity brings to our teams and our products, so creating and maintaining an environment where every individual feels safe to bring their unique perspective to the challenges we're solving is important to us. Responsibilities Demonstrate a strong commitment to high quality software development practices Actively design, develop, document and maintain our deployment infrastructure services with a product mindset Provide compassionate technical mentorship, pairing opportunities, and code reviews to encourage professional and technical growth of those around you Build tools and systems that empathetically and pragmatically meet real operability needs of GitHub developers Develop and maintain scalable infrastructure Use data to understand the availability, reliability, and sustainability of our infrastructure Work closely with other teams from around the organization Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary Qualifications Required Qualifications: 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field OR equivalent experience. 2+ years experience with running, operating, and maintaining production systems 2+ years experience designing, building and running large scale and highly available cloud services or distributed systems Preferred Qualifications: Solid understanding of testing principles and high quality software Experience with Kubernetes or other container orchestration systems Experience building infrastructure automation Experience working with the Linux operating system Experience running, monitoring and troubleshooting issues in a production always-on service Excellent analytical skills and communication skills. Fluent in English both verbal and written. We are a global cross-countries team so we’re extra mindful about communication. Compensation Range The base salary range for this job is USD $97,900.00 - USD $259,900.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"tags7":["US Careers (External)"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field OR equivalent experience. 2+ years experience with running, operating, and maintaining production systems 2+ years experience designing, building and running large scale and highly available cloud services or distributed systems Preferred Qualifications: Solid understanding of testing principles and high quality software Experience with Kubernetes or other container orchestration systems Experience building infrastructure automation Experience working with the Linux operating system Experience running, monitoring and troubleshooting issues in a production always-on service Excellent analytical skills and communication skills. Fluent in English both verbal and written. We are a global cross-countries team so we’re extra mindful about communication.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Demonstrate a strong commitment to high quality software development practices Actively design, develop, document and maintain our deployment infrastructure services with a product mindset Provide compassionate technical mentorship, pairing opportunities, and code reviews to encourage professional and technical growth of those around you Build tools and systems that empathetically and pragmatically meet real operability needs of GitHub developers Develop and maintain scalable infrastructure Use data to understand the availability, reliability, and sustainability of our infrastructure Work closely with other teams from around the organization Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary","posted_date":"2025-05-20T14:48:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/3775/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"last_mod":"2025-07-02T15:13:45.996+00:00","icims":{"jps_is_public":true,"date_updated":"2025-07-02T15:12:58Z","primary_posted_site_object":{"site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9","datePosted":"2025-05-20T14:48:00+0000"},"config_keys":null,"revision_int":19,"uuid":"63ff5528-ca3e-4d6d-9efd-3f486d3089a2"},"googlejobs":{"jobName":"projects/helpful-passage-853/jobs/103363193060893382","jobTitleSnippet":"","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","searchTextSnippet":"","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"radiusInMiles":2.6691467883166546,"postalAddress":{"regionCode":"US","sortingCode":"","recipients":[],"organization":"","postalCode":"","locality":"","sublocality":"","addressLines":["United States"],"administrativeArea":"","languageCode":"","revision":0},"locationType":"COUNTRY","latLng":{"latitude":38.7945952,"longitude":-106.5348379}}]},"jobHash":"d3e862ca83149f8e3e66acf440ca0e48","jobSummary":"Demonstrate a strong commitment to high quality software development practices Actively design, develop, document and maintain our deployment infrastructure services with a product mindset Provide compassionate technical mentorship, pairing opportunities, and code reviews to encourage professional and technical growth of those around you Build tools and systems that empathetically and pragmatically meet real operability needs of GitHub developers Develop and maintain scalable infrastructure Use data to understand the availability, reliability, and sustainability of our infrastructure Work closely with other teams from around the organization Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary"},"import_id":"874842ac-3892-497c-8c6f-061c90a176b4","redirectOnApply":true,"import_source":"ImporterService","canonical_url":"https://githubinc.jibeapply.com/jobs/3775?lang=en-us","client_code":"githubinc","gdpr":false},"update_date":"2025-07-02T15:13:45+0000","create_date":"2025-07-01T03:54:50+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}}],"locations":[],"totalCount":5,"request_id":false,"count":5,"languageCounts":{"en-us":{"displayName":"English","count":5}},"filter":{"facetList":{"tags4":[{"term":"Experienced Professional","count":5}],"tags5":[{"term":"Individual Contributor","count":5}],"tags6":[{"term":"Yes","count":5}]},"displayLimit":10,"brands":{"all":[],"shortlist":[]},"categories":{"all":[{"category":"Engineering","numJobs":5}],"shortlist":[{"category":"Engineering","numJobs":5}]},"locations":{"all":[{"city":null,"state":null,"country":"Germany","count":2},{"city":null,"state":null,"country":"United States","count":3}],"shortlist":[{"city":null,"state":null,"country":"Germany","count":2},{"city":null,"state":null,"country":"United States","count":3}]},"experienceLevels":{"all":[],"shortlist":[]}}}