{"jobs":[{"data":{"slug":"2645","language":"en-us","languages":["en-us"],"req_id":"2645","title":"Senior Software Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, Canada Overview GitHub is looking for a Senior Software Engineer to join the Authentication team. This team is part of Identity and Enterprise Administration (IdEA) at GitHub. We are responsible for all things authentication. We build and maintain the account login services for GitHub, protecting the integrity of user credentials, and providing means of account recovery. The ideal candidate is a team player who is comfortable working in the context of both monoliths and micro-services. They don’t shy away from hard problems, and have a strong sense of customer empathy. They are comfortable working closely with engineers at all levels as well as product managers. Responsibilities Leveraging strong OS and cryptography skills, extending existing standards that protect web-facing credentials to the OS and native app side. Work on cross-cutting projects to independently scale authentication services. Implement new and maintain existing authentication flows and management interfaces. Integrate with third party services that support authentication interfaces - Troubleshoot customer authentication issues across our product suite in an on-call rotation. Qualifications Required Qualifications 6+ years of software engineering experience 4+ years experience building high-traffic applications 4+ years experience leading a team of engineers on projects from start to finish 2+ years experience designing and building large-scale services Preferred Qualifications Experience in Go, Ruby/Rails Experience in IAM space Familiarity with 2FA/MFA, WebAuthn, SSH, PAT, Passwordless authentication concepts Familiarity with cryptography systems such as TPMs and iCloud Keychain, OAuth 2 protocols, and native app development Comfortable in delivering large ambitious projects using iterative deliverables. Strong track record of delivering projects GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"Canada Remote","city":"Remote","country":"CAN","country_code":"CN","location_type":"ANY","latitude":23.11667,"longitude":113.25,"categories":[{"name":"Engineering"}],"tags2":["CAN-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications 6+ years of software engineering experience 4+ years experience building high-traffic applications 4+ years experience leading a team of engineers on projects from start to finish 2+ years experience designing and building large-scale services Preferred Qualifications Experience in Go, Ruby/Rails Experience in IAM space Familiarity with 2FA/MFA, WebAuthn, SSH, PAT, Passwordless authentication concepts Familiarity with cryptography systems such as TPMs and iCloud Keychain, OAuth 2 protocols, and native app development Comfortable in delivering large ambitious projects using iterative deliverables. Strong track record of delivering projects","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Leveraging strong OS and cryptography skills, extending existing standards that protect web-facing credentials to the OS and native app side. Work on cross-cutting projects to independently scale authentication services. Implement new and maintain existing authentication flows and management interfaces. Integrate with third party services that support authentication interfaces - Troubleshoot customer authentication issues across our product suite in an on-call rotation.","posted_date":"February 13, 2024","apply_url":"https://globalcareers-githubinc.icims.com/jobs/2645/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-02-13T22:24:11Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-02-13T22:23:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":3,"uuid":"b2269d6b-0452-454c-9eda-45b884db63fc"},"import_id":"5ff5f32c-989f-4479-9175-4b9397d216d8","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/110840172620194502","jobHash":"cedcda531edf972e6794bef80d55165a","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[]},"jobSummary":"Leveraging strong OS and cryptography skills, extending existing standards that protect web-facing credentials to the OS and native app side. Work on cross-cutting projects to independently scale authentication services. Implement new and maintain existing authentication flows and management interfaces. Integrate with third party services that support authentication interfaces - Troubleshoot customer authentication issues across our product suite in an on-call rotation.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2645?lang=en-us","last_mod":"2024-02-13T22:24:56+0000","gdpr":false},"create_date":"2024-02-13T22:24:56+0000","category":[" Engineering"],"full_location":"Remote, CAN","short_location":"Remote, CAN"}},{"data":{"slug":"2615","language":"en-us","languages":["en-us"],"req_id":"2615","title":"Staff Software Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open source community on earth (and 99% of the world’s software has open source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world together. As a software engineer at GitHub, you will enhance the collaboration experience at GitHub by working closely with a community of engineers and designers with a distributed, diverse and passionate team delivering the services that millions of developers depend on. In this role you will design, prototype, implement, ship and support highly performant and inspiring user experiences with your team. We are looking for creative problem solvers and diverse thinkers, people who care about culture as well as customers and features. We believe that how we do things is as important as what we do. Big vision, a common purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what lead to great results. Great products reflect the teams that build them Responsibilities Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code. Qualifications Required Qualifications: 10+ years of experience as a software engineer Experience leading a team in designing, building, scaling and maintaining distributed systems Experience leading a team in testing, production system monitoring, and observability Preferred Qualifications: Excellent written and verbal communication via async collaboration, documentation, and visibility of work Hands-on experience with distributed systems at global scale. Experience working with a remote, distributed team. Familiarity with SQL, Kusto Query Language, general database knowledge, Kubernetes, and/or cloud-native concepts Passionate about fostering effective Engineering practices and processes. Proficiency in Git and GitHub for version control and collaborative development and branching strategies. Experience with CI/CD Tools: Strong knowledge of CI/CD concepts and best practices. Experience with GitHub actions and workflows platform, familiar with other tools like Jenkins Contribute to open source software, engage with maintainers, and actively participate in community curation GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 10+ years of experience as a software engineer Experience leading a team in designing, building, scaling and maintaining distributed systems Experience leading a team in testing, production system monitoring, and observability Preferred Qualifications: Excellent written and verbal communication via async collaboration, documentation, and visibility of work Hands-on experience with distributed systems at global scale. Experience working with a remote, distributed team. Familiarity with SQL, Kusto Query Language, general database knowledge, Kubernetes, and/or cloud-native concepts Passionate about fostering effective Engineering practices and processes. Proficiency in Git and GitHub for version control and collaborative development and branching strategies. Experience with CI/CD Tools: Strong knowledge of CI/CD concepts and best practices. Experience with GitHub actions and workflows platform, familiar with other tools like Jenkins Contribute to open source software, engage with maintainers, and actively participate in community curation","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","posted_date":"February 13, 2024","apply_url":"https://globalcareers-githubinc.icims.com/jobs/2615/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-02-13T21:56:38Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-02-13T21:56:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":1,"uuid":"a634e1b3-fbb9-4354-bdf7-fd9b588b52dd"},"import_id":"67c7197d-536d-4d4c-bbbb-b964bdae1664","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/117844920682586822","jobHash":"8d3c3849824ce3097ce37772de653c41","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":7.17042852578733e-05}]},"jobSummary":"Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2615?lang=en-us","last_mod":"2024-02-13T21:56:55+0000","gdpr":false},"create_date":"2024-02-13T21:56:55+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2649","language":"en-us","languages":["en-us"],"req_id":"2649","title":"Senior Software Engineer, CLI","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview The Client Apps organization at GitHub builds best-in-class experiences for our users to interact with Git and GitHub from whatever environment they choose. We are the small but mighty group responsible for the official GitHub CLI, GitHub Desktop, and GitHub Mobile apps. We are a product-driven organization that values building software collaboratively with our users as well as our internal partners. GitHub CLI (also known as gh) is an open source project that allows users to perform their tasks on GitHub without leaving the terminal. It has over 34K stars and is used by hundreds of thousands of developers and in many more automated workflows every day. The team is looking for a Senior Software Engineer to help influence and build the future of GitHub CLI. Stack: GitHub CLI is built in Go and is highly integrated with GitHub's REST and GraphQL APIs. GitHub CLI is built using GitHub products and features such as GitHub Actions and GitHub Pages. Responsibilities Designing and building new features that will simplify developer workflows. Influencing product direction by participating in design and architecture discussions. Triaging community-reported issues and helping your teammates solve problems. Diving into unfamiliar codebases to debug issues. Collaborating with other GitHub teams to provide the best experience for our users Qualifications Required Qualifications: Many years of experience as a software engineer Experience with Go Solid understanding of testing principles and high quality software Strong analytical skills and experience Preferred Qualifications: Excellent communication skills both verbal and written High degree of empathy Experience in building command line tools Experience in being a part of an open source community, especially as a maintainer Experience in working with a remote, distributed team GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"United Kingdom Remote","city":"Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: Many years of experience as a software engineer Experience with Go Solid understanding of testing principles and high quality software Strong analytical skills and experience Preferred Qualifications: Excellent communication skills both verbal and written High degree of empathy Experience in building command line tools Experience in being a part of an open source community, especially as a maintainer Experience in working with a remote, distributed team","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Designing and building new features that will simplify developer workflows. Influencing product direction by participating in design and architecture discussions. Triaging community-reported issues and helping your teammates solve problems. Diving into unfamiliar codebases to debug issues. Collaborating with other GitHub teams to provide the best experience for our users","posted_date":"February 7, 2024","apply_url":"https://globalcareers-githubinc.icims.com/jobs/2649/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-02-14T20:26:24Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-02-07T20:54:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":2,"uuid":"a6b04d8e-dfac-4b84-87d4-70490ae16f65"},"import_id":"2a44567e-cc05-46df-a9e1-fb8861eebf89","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/76132535995638470","jobHash":"ed81d6ce795adb0e7ebcd507bcb919e5","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"Designing and building new features that will simplify developer workflows. Influencing product direction by participating in design and architecture discussions. Triaging community-reported issues and helping your teammates solve problems. Diving into unfamiliar codebases to debug issues. Collaborating with other GitHub teams to provide the best experience for our users","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2649?lang=en-us","last_mod":"2024-02-14T20:26:55+0000","gdpr":true},"update_date":"2024-02-14T20:26:55+0000","create_date":"2024-02-07T20:55:23+0000","category":[" Engineering"],"full_location":"Remote, United Kingdom","short_location":"Remote, United Kingdom"}},{"data":{"slug":"2630","language":"en-us","languages":["en-us"],"req_id":"2630","title":"Senior Software Engineer, Copilot in the CLI ","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub Copilot has changed the way software is built, and we have a unique opportunity to look further ahead and identify how software development can be faster, safer, easier, and more accessible. We’re looking for a talented, experienced Software Engineer to join the GitHub CLI team on this mission! GitHub CLI (gh) bridges the gap between GitHub primitives and workflows (e.g. Pull Requests, Issues, Repositories) and is a companion of git (not a replacement). With the addition of Copilot in the CLI (gh-copilot), the team is looking for someone who is passionate not only about command line interfaces but also about bringing the power of AI to further boost the productivity straight from the terminal. Come join the team and influence the future of GitHub CLI and Copilot in the CLI! Stack: GitHub CLI is built in Go and is highly integrated with GitHub's REST and GraphQL APIs. GitHub CLI is built using GitHub products and features such as GitHub Actions and GitHub Pages. Responsibilities Designing and building new features that will simplify developer workflows. Influencing product direction by participating in design and architecture discussions. Triaging community-reported issues and helping your teammates solve problems. Diving into unfamiliar codebases to debug issues. Collaborating with other GitHub teams to provide the best experience for our users Qualifications Required Qualifications: 5+ years experience as a software engineer Experience with Go Solid understanding of testing principles and high quality software Strong analytical skills and experience Preferred Qualifications: Excellent communication skills both verbal and written High degree of empathy Experience in building command line tools Experience in being a part of an open source community, especially as a maintainer Experience in working with a remote, distributed team Interest or prior experience in modern AI/machine learning technologies, LLMs, or similar Compensation Range USD $104,400.00 - USD $276,900.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 5+ years experience as a software engineer Experience with Go Solid understanding of testing principles and high quality software Strong analytical skills and experience Preferred Qualifications: Excellent communication skills both verbal and written High degree of empathy Experience in building command line tools Experience in being a part of an open source community, especially as a maintainer Experience in working with a remote, distributed team Interest or prior experience in modern AI/machine learning technologies, LLMs, or similar","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Designing and building new features that will simplify developer workflows. Influencing product direction by participating in design and architecture discussions. Triaging community-reported issues and helping your teammates solve problems. Diving into unfamiliar codebases to debug issues. Collaborating with other GitHub teams to provide the best experience for our users","posted_date":"February 7, 2024","apply_url":"https://careers-githubinc.icims.com/jobs/2630/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-02-14T20:26:59Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-02-07T21:04:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":2,"uuid":"82949597-92ba-48c7-b8f9-bf56bfa05ea4"},"import_id":"74897dd1-0ac9-4e13-b2fc-6ff6eced7e42","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/74044563414491846","jobHash":"2fbcd8c31f4e034d607b52dd127b416b","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":7.17042852578733e-05}]},"jobSummary":"Designing and building new features that will simplify developer workflows. Influencing product direction by participating in design and architecture discussions. Triaging community-reported issues and helping your teammates solve problems. Diving into unfamiliar codebases to debug issues. Collaborating with other GitHub teams to provide the best experience for our users","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2630?lang=en-us","last_mod":"2024-02-14T20:27:55+0000","gdpr":false},"update_date":"2024-02-14T20:27:55+0000","create_date":"2024-02-07T21:05:22+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2658","language":"en-us","languages":["en-us"],"req_id":"2658","title":"Staff Engineering Manager","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, Germany Overview GitHub Issues are the foundation for planning \u0026 tracking work on GitHub. This role is an Staff Engineering Manager on the Issues team, specifically leading the team responsible for the Issues Platform with a focus on availability, performance and evolving the architecture. As a leader and manager, you will directly influence engineering culture, mentor and grow other engineers, engage in long term architectural planning, and partner closely with key partners across the company to help deliver a highly available and scalable planning \u0026 tracking experience. While your direct team is located in Europe, you will join a fully distributed org - you will thrive in an environment of asynchronous communication. We expect you to have the ability to communicate complex technical concepts, and be able to create working relationships with coworkers in locations around the globe. Responsibilities Clear and effective communication skills, be it when you write code, send emails, or explain complex technical issues to non-technical co-workers. A desire to take up new challenges and lead a group of highly skilled, dedicated and smart engineers. You're always looking for ways we can be better as a team. Reliable and responsible work ethic. You enjoy taking on responsibility within your role, on projects you have initiated, and you also enjoy bringing out the best in your teammates. Drive to provide clarity and a shared understanding of decision making, direction, and progress for the team and the company. Qualifications Required Qualifications: Several years experience building and shipping software using a variety of technology stacks, or equivalent experience. Experience leading teams as people manager or technical leader Experience working with a distributed team Experience developing a strategy and roadmap for your teams Preferred Qualifications: Passionate about fostering good engineering practices and processes Have previous experience building and maintaining highly available and scalable services. Have significant experience with one or more backend technologies: server-side environments, compute, datastores, networking, infrastructure, devops, security, and programming languages. Have significant experience with open-source software, communities, and the systems these communities use to self-organize and ship software for others. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"Germany Remote","city":"Remote","country":"Germany","country_code":"DE","location_type":"ANY","latitude":51.165691,"longitude":10.451526,"categories":[{"name":"Engineering"}],"tags2":["DE-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Director"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: Several years experience building and shipping software using a variety of technology stacks, or equivalent experience. Experience leading teams as people manager or technical leader Experience working with a distributed team Experience developing a strategy and roadmap for your teams Preferred Qualifications: Passionate about fostering good engineering practices and processes Have previous experience building and maintaining highly available and scalable services. Have significant experience with one or more backend technologies: server-side environments, compute, datastores, networking, infrastructure, devops, security, and programming languages. Have significant experience with open-source software, communities, and the systems these communities use to self-organize and ship software for others.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Clear and effective communication skills, be it when you write code, send emails, or explain complex technical issues to non-technical co-workers. A desire to take up new challenges and lead a group of highly skilled, dedicated and smart engineers. You're always looking for ways we can be better as a team. Reliable and responsible work ethic. You enjoy taking on responsibility within your role, on projects you have initiated, and you also enjoy bringing out the best in your teammates. Drive to provide clarity and a shared understanding of decision making, direction, and progress for the team and the company.","posted_date":"February 1, 2024","apply_url":"https://globalcareers-githubinc.icims.com/jobs/2658/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-02-15T14:47:58Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-02-01T15:00:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":6,"uuid":"a146702d-6ea0-4e73-844e-85efd2d6aee6"},"import_id":"e2899f1a-a15f-4221-8d59-648c34ae63ed","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/95014728352309958","jobHash":"9e9fecaf120e54267600d06d80e4766a","derivedInfo":{"jobCategories":["MANAGEMENT","COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":51.165691,"longitude":10.451526},"locationType":"COUNTRY","postalAddress":{"addressLines":["Germany"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"DE","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.21074213340642003}]},"jobSummary":"Clear and effective communication skills, be it when you write code, send emails, or explain complex technical issues to non-technical co-workers. A desire to take up new challenges and lead a group of highly skilled, dedicated and smart engineers. You're always looking for ways we can be better as a team. Reliable and responsible work ethic. You enjoy taking on responsibility within your role, on projects you have initiated, and you also enjoy bringing out the best in your teammates. Drive to provide clarity and a shared understanding of decision making, direction, and progress for the team and the company.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2658?lang=en-us","last_mod":"2024-02-15T14:48:56+0000","gdpr":true},"update_date":"2024-02-15T14:48:56+0000","create_date":"2024-02-06T12:12:39+0000","category":[" Engineering"],"full_location":"Remote, Germany","short_location":"Remote, Germany"}},{"data":{"slug":"2640","language":"en-us","languages":["en-us"],"req_id":"2640","title":"Senior Software Engineer, Copilot Platform","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, Germany Overview GitHub Copilot has changed the way software is built, and we have a unique opportunity to look further ahead to identify how software development can be faster, safer, easier, and more accessible. We’re looking for a talented and experienced Software Engineer to join us in this mission! GitHub Copilot Platform has a crucial role in advancing the core intelligence solutions that power the Copilot features in GitHub. GitHub Copilot Foundations owns the continued global scaling of GitHub’s code completion features and the expanding feature set to continue its industry-leading position. Both teams are also focused on ensuring other engineering teams at GitHub have the tools and processes necessary to build on top of our platform with as little friction as possible. As a Senior Software Engineer on the Copilot Platform or Foundations Team, you will work closely with a distributed, diverse, and passionate team of engineers and product managers with multiple teams across GitHub and Microsoft to improve and maintain our Platform that integrators depend on in their software development cycle. Together, we are dedicated to shaping the future of software development by continuously enhancing AI-powered capabilities in GitHub and beyond. The Copilot team is highly distributed and you will thrive in an environment of remote work and asynchronous communication. You're expected to have strong written communication skills and be able to develop working relationships with coworkers in locations around the globe. As an engineer at GitHub you'll always be challenged to solve interesting and novel problems that have real impact on how the world builds software. Responsibilities Lead technical decision making and architecture Design and implement scalable, reliable and performant solutions for problems like rate-limiting, request routing, etc. Write, review, and maintain code primarily in Go Mentor other engineers in their technical and architectural decision making Qualifications Required Qualifications: A few years of experience building high traffic services at scale A few years of experience building and/or consuming REST-style APIs Experience architecting highly available, high volume APIs Preferred Qualifications: Experience with Go and related tooling Experience with distributed systems at global scale Experience working with a remote, distributed team Excellent written and verbal communication skills Interest or prior experience in modern AI/machine learning technologies, Large Language Models or similar Passionate about fostering good API Design practices and processes GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"Germany Remote","city":"Remote","country":"Germany","country_code":"DE","location_type":"ANY","latitude":51.165691,"longitude":10.451526,"categories":[{"name":"Engineering"}],"tags2":["DE-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: A few years of experience building high traffic services at scale A few years of experience building and/or consuming REST-style APIs Experience architecting highly available, high volume APIs Preferred Qualifications: Experience with Go and related tooling Experience with distributed systems at global scale Experience working with a remote, distributed team Excellent written and verbal communication skills Interest or prior experience in modern AI/machine learning technologies, Large Language Models or similar Passionate about fostering good API Design practices and processes","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Lead technical decision making and architecture Design and implement scalable, reliable and performant solutions for problems like rate-limiting, request routing, etc. Write, review, and maintain code primarily in Go Mentor other engineers in their technical and architectural decision making","posted_date":"January 22, 2024","apply_url":"https://globalcareers-githubinc.icims.com/jobs/2640/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-02-13T15:09:20Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-01-22T16:06:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":8,"uuid":"6cb0bd75-b2e7-4af3-9ccc-5dea5f4b1172"},"import_id":"a9581304-f00c-4ff7-8259-1913ab29e87e","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/121121532442223302","jobHash":"574285fb3458d00339ebc0750f6fc7f4","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":51.165691,"longitude":10.451526},"locationType":"COUNTRY","postalAddress":{"addressLines":["Germany"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"DE","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.21074213340642003}]},"jobSummary":"Lead technical decision making and architecture Design and implement scalable, reliable and performant solutions for problems like rate-limiting, request routing, etc. Write, review, and maintain code primarily in Go Mentor other engineers in their technical and architectural decision making","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2640?lang=en-us","last_mod":"2024-02-13T15:09:55+0000","gdpr":true},"update_date":"2024-02-13T15:09:55+0000","create_date":"2024-02-06T12:12:39+0000","category":[" Engineering"],"full_location":"Remote, Germany","short_location":"Remote, Germany"}},{"data":{"slug":"2484","language":"en-us","languages":["en-us"],"req_id":"2484","title":"Software Engineer, Internal Development Experience","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview GitHub is the home for software development, where developers collaborate to build some of the world’s most important software. In the GitHub code scanning team, we are passionate about securing the world’s software - from open source to the enterprise. We believe that the best way to secure software is to detect security issues early in the development process, and deliver a great user experience that engages, supports, and motivates developers to fix security vulnerabilities in a way that integrates naturally in their workflows. Our team develops and operates the code scanning product that’s part of GitHub’s Advanced Security offering. The challenges our developers face on a daily basis include rapid development lifecycle, thorough automated testing, and a complex technology stack with a wide support of the major operating systems. The opportunity: Come join our engineering team and help design and improve the code scanning internal developer experience team! You’ll belong to a distributed engineering team responsible for creating safe, delightful, and inclusive solutions for GitHub code scanning engineers to efficiently develop, test, ship, and operate software, by constantly improving and evolving the tools, processes, and support structures that enable our engineers to be productive, collaborative, and effective in delivering high-quality products and services to our customers. Responsibilities You will be continuously innovating to integrate new technologies into our tooling and pipelines. You will work closely with other engineering teams that build different aspects of code scanning products, and help release their work into the hands of developers and security teams. You will engage with internal users to help them succeed with the product. You will grow and scale the processes, pipelines and internal tooling, working as part of our Security Products group towards our mission of securing the world’s software. You’ll influence and provide feedback on the organizational culture and processes, always looking for opportunities to improve in a continuous pursuit for excellence. Qualifications Required Qualifications: For this role, we’re looking for an experienced software engineer with: Several years of experience as a software engineer, with many years of experience using JavaScript/TypeScript, Java, or a comparable programming language, and the interest and ability to learn additional languages as required. Experience building developer tools and pipelines that streamline and automate software lifecycle, including development, testing and releasing, with focus on speed, reliability and scalability. Preferred Qualifications: Additionally, experience in any of the following areas would be considered a plus. We do not expect applicants to be familiar with all these areas, but encourage you to apply if you have some experience, or are strongly interested in developing these skills with us. Excellent verbal and written communication skills, with the ability to clearly explain technical concepts to diverse audiences and write comprehensive technical doc; Collaboration skills, with demonstrated experience in successful projects in multi-team settings; the ability to listen to our internal users and understand their challenges, with a record of successfully resolved user-reported issues, or features implemented based on user feedback; and use that information to effectively contribute to building the team roadmap, with evidence of contributions to strategic decisions. Experience with CI/CD Tools, Strong knowledge of CI/CD concepts, GitHub actions and workflows platform, and other tools like Jenkins, Travis CI, CircleCI, GitLab, etc. Advanced knowledge of Git usage and branching strategies. Knowledge of build systems, specially Bazel. Monitoring and Logging: Experience with tools like Datadog or Grafana for monitoring infrastructure and applications is beneficial. Kusto query language and ADX dashboards familiarity would prove useful. Infrastructure management: Familiarity with Cloud Platforms, Containerization, Infrastructure as Code (and related automation tools such as Packer) and Orchestration stacks such as Kubernetes and its ecosystem (ex. Kustomize) is a nice-to-have. Software security, including static analysis, dynamic analysis, software supply chain security, or best practices in application security. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"United Kingdom Remote","city":"Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: For this role, we’re looking for an experienced software engineer with: Several years of experience as a software engineer, with many years of experience using JavaScript/TypeScript, Java, or a comparable programming language, and the interest and ability to learn additional languages as required. Experience building developer tools and pipelines that streamline and automate software lifecycle, including development, testing and releasing, with focus on speed, reliability and scalability. Preferred Qualifications: Additionally, experience in any of the following areas would be considered a plus. We do not expect applicants to be familiar with all these areas, but encourage you to apply if you have some experience, or are strongly interested in developing these skills with us. Excellent verbal and written communication skills, with the ability to clearly explain technical concepts to diverse audiences and write comprehensive technical doc; Collaboration skills, with demonstrated experience in successful projects in multi-team settings; the ability to listen to our internal users and understand their challenges, with a record of successfully resolved user-reported issues, or features implemented based on user feedback; and use that information to effectively contribute to building the team roadmap, with evidence of contributions to strategic decisions. Experience with CI/CD Tools, Strong knowledge of CI/CD concepts, GitHub actions and workflows platform, and other tools like Jenkins, Travis CI, CircleCI, GitLab, etc. Advanced knowledge of Git usage and branching strategies. Knowledge of build systems, specially Bazel. Monitoring and Logging: Experience with tools like Datadog or Grafana for monitoring infrastructure and applications is beneficial. Kusto query language and ADX dashboards familiarity would prove useful. Infrastructure management: Familiarity with Cloud Platforms, Containerization, Infrastructure as Code (and related automation tools such as Packer) and Orchestration stacks such as Kubernetes and its ecosystem (ex. Kustomize) is a nice-to-have. Software security, including static analysis, dynamic analysis, software supply chain security, or best practices in application security.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"You will be continuously innovating to integrate new technologies into our tooling and pipelines. You will work closely with other engineering teams that build different aspects of code scanning products, and help release their work into the hands of developers and security teams. You will engage with internal users to help them succeed with the product. You will grow and scale the processes, pipelines and internal tooling, working as part of our Security Products group towards our mission of securing the world’s software. You’ll influence and provide feedback on the organizational culture and processes, always looking for opportunities to improve in a continuous pursuit for excellence.","posted_date":"January 11, 2024","apply_url":"https://globalcareers-githubinc.icims.com/jobs/2484/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-02-07T20:10:20Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-01-11T03:56:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":11,"uuid":"3d72ce0c-a154-4284-a0c3-ffe9ebb6291e"},"import_id":"b90ffcb8-af83-42b4-995a-25d0bf1f6f56","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/111973595699126982","jobHash":"da025cf7e0eea7d34f9b9a0ee9807cd6","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"You will be continuously innovating to integrate new technologies into our tooling and pipelines. You will work closely with other engineering teams that build different aspects of code scanning products, and help release their work into the hands of developers and security teams. You will engage with internal users to help them succeed with the product. You will grow and scale the processes, pipelines and internal tooling, working as part of our Security Products group towards our mission of securing the world’s software. You’ll influence and provide feedback on the organizational culture and processes, always looking for opportunities to improve in a continuous pursuit for excellence.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2484?lang=en-us","last_mod":"2024-02-07T20:10:22+0000","gdpr":true},"update_date":"2024-02-07T20:10:22+0000","create_date":"2024-02-06T12:12:37+0000","category":[" Engineering"],"full_location":"Remote, United Kingdom","short_location":"Remote, United Kingdom"}},{"data":{"slug":"2503","language":"en-us","languages":["en-us"],"req_id":"2503","title":"Staff Software Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview Join us in shaping the future of project planning and tracking on GitHub. Our team enables customers to bring their ideas to life, innovate and collaborate throughout the whole project lifecycle. GitHub Issues is a market-leading service to manage and track work right where it happens. Learn more about GitHub’s project management tools: https://github.com/features/#features-project-management Work closely with a diverse and passionate community of engineers and designers to enhance project management on GitHub. Join our distributed team in delivering reliable services to millions of developers worldwide.In this role you will design, prototype, implement, ship and support highly performant and inspiring user experiences with your team. We are looking for creative problem solvers and diverse thinkers, people who care about culture as well as customers and features. We believe that how we do things is as important as what we do. Big vision, a common purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what lead to great results. Great products reflect the teams that build them. Responsibilities As part of this team you’ll work on GitHub Issues and Projects and deliver customer value with everything we do. This job provides an opportunity to Build experiences that millions of people love and use every day, helping them to be more productive, collaborate more effectively and achieve their goals. Have a real impact, take on ownership of GitHub.com. Contribute to and improve our code base from day one. Grow your technical skills and learn about other technology stacks and disciplines. Investigate and play with new approaches that could be applied to our products. Write, review and maintain code primarily in Ruby and JavaScript (React, TypeScript) Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems Coordinate with engineering and product leads to define, prioritize, and task projects that help us meet business objectives Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others Qualifications Required Qualifications Several years of experience as a software engineer. React experience on a senior level. Experience in technical leadership. Preferred Qualifications 1+ years of experience working remote as part of a software engineering team. 3+ years of hands-on experience in modern web stacks (e.g. Rails, Go, React, MySQL, GraphQL, ...). You have experience in building top-notch, design-driven user interfaces You have a strong customer focus and data driven approach with a demonstrated ability to work in a fast-paced environment You have experience in designing and writing realtime web applications. You have excellent analytical skills as well as communication skills both verbal and written. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"United Kingdom Remote","city":"Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications Several years of experience as a software engineer. React experience on a senior level. Experience in technical leadership. Preferred Qualifications 1+ years of experience working remote as part of a software engineering team. 3+ years of hands-on experience in modern web stacks (e.g. Rails, Go, React, MySQL, GraphQL, ...). You have experience in building top-notch, design-driven user interfaces You have a strong customer focus and data driven approach with a demonstrated ability to work in a fast-paced environment You have experience in designing and writing realtime web applications. You have excellent analytical skills as well as communication skills both verbal and written.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"As part of this team you’ll work on GitHub Issues and Projects and deliver customer value with everything we do. This job provides an opportunity to Build experiences that millions of people love and use every day, helping them to be more productive, collaborate more effectively and achieve their goals. Have a real impact, take on ownership of GitHub.com. Contribute to and improve our code base from day one. Grow your technical skills and learn about other technology stacks and disciplines. Investigate and play with new approaches that could be applied to our products. Write, review and maintain code primarily in Ruby and JavaScript (React, TypeScript) Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems Coordinate with engineering and product leads to define, prioritize, and task projects that help us meet business objectives Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others","posted_date":"January 10, 2024","apply_url":"https://globalcareers-githubinc.icims.com/jobs/2503/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-02-14T19:43:38Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-01-10T15:31:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":12,"uuid":"ffbf60c8-bd5e-4bb1-b7c8-5c24d7db45a0"},"import_id":"92b25b7a-3982-4432-b9fd-2ec827c94890","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/141431711230501574","jobHash":"a9159465f0b67303ccf5b864a28f9b00","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"As part of this team you’ll work on GitHub Issues and Projects and deliver customer value with everything we do. This job provides an opportunity to Build experiences that millions of people love and use every day, helping them to be more productive, collaborate more effectively and achieve their goals. Have a real impact, take on ownership of GitHub.com. Contribute to and improve our code base from day one. Grow your technical skills and learn about other technology stacks and disciplines. Investigate and play with new approaches that could be applied to our products. Write, review and maintain code primarily in Ruby and JavaScript (React, TypeScript) Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems Coordinate with engineering and product leads to define, prioritize, and task projects that help us meet business objectives Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2503?lang=en-us","last_mod":"2024-02-14T19:43:55+0000","gdpr":true},"update_date":"2024-02-14T19:43:55+0000","create_date":"2024-02-06T12:12:37+0000","category":[" Engineering"],"full_location":"Remote, United Kingdom","short_location":"Remote, United Kingdom"}},{"data":{"slug":"2590","language":"en-us","languages":["en-us"],"req_id":"2590","title":"Senior Software Engineer, CodeQL Experiences","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview GitHub is the home for software development, where developers collaborate to build some of the world’s most important software. In the GitHub code scanning team, we are passionate about securing the world’s software - from open source to the enterprise. We believe that the best way to secure software is to detect security issues early in the development process, and deliver a great user experience that engages, supports, and motivates developers to fix security vulnerabilities in a way that integrates naturally in their workflows. Our team develops and operates the code scanning product that’s part of GitHub’s Advanced Security offering. A central part of code scanning is CodeQL, GitHub's own semantic code analysis engine that uses world-class static analysis research and technology to deeply analyze code, enabling the early detection of security vulnerabilities and correctness errors in software. Come join our engineering team and help build CodeQL, GitHub’s first-party code scanning tool! You’ll belong to a distributed engineering team responsible for making CodeQL available to thousands of developers and hundreds of thousands of projects every day, by integrating it into GitHub Actions, third-party CI systems, the command line, and the IDE. You will build new features across a variety of products and systems, including the CodeQL CLI, the CodeQL Action, the CodeQL query libraries, the CodeQL extension for Visual Studio Code, GitHub core services, and AI-powered autofix and threat modeling capabilities. You will be continuously innovating to expand the core capabilities of CodeQL, building elegant customization mechanisms and integrations with machine learning to make its analysis even more powerful. Responsibilities You will work closely with other engineering teams that build different aspects of CodeQL analysis and the code scanning product, and help release their work into the hands of developers and security teams. You will engage with internal users and external users (both from enterprise customers and the open-source community) to help them succeed with the product. You will grow and scale the product, working as part of our Security Products group towards our mission of securing the world’s software. You’ll work closely with product managers, designers, technical writers, and engineers from multiple teams to influence product direction and deliver features to users, with clear focus on quality, reliability, and user experience. You’ll influence and provide feedback on the organizational culture and processes, always looking for opportunities to improve in a continuous pursuit for excellence. Qualifications Required Qualifications: Many years of experience as a software engineer, with a high level of familiarity with JavaScript/TypeScript, Java, or a comparable programming language, and the interest and ability to learn additional languages as required Experience building developer tools that operate on source code, such as compilers, static analyzers, debuggers, CLI tools, or IDE extensions Preferred Qualifications: Additionally, experience in any of the following areas would be considered a plus. We do not expect applicants to be familiar with all these areas, but encourage you to apply if you have some experience, or are strongly interested in developing these skills with us. software security, including static analysis, dynamic analysis, software supply chain security, or best practices in application security building integrations with CI/CD systems, such as GitHub Actions or Jenkins machine learning, including large language models (LLMs) and prompt engineering, applying machine learning to understanding source code, systematic data collection and result evaluation, and MLOps operating user-facing software at scale, including availability and observability experience with the Python, Go, Ruby, or C++ programming languages knowledge of compilers, logic programming or database query languages (e.g. SQL, Prolog, Datalog), program analysis, programming language design and implementation the ability to work with multiple stakeholders and teams across engineering, product, and design excellent verbal and written communication skills working in a distributed team, operating effectively across multiple time zones (this team spans a wide time zone range from Pacific time to Central European time) a passion for fostering good engineering practices, tools, and processes GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"United Kingdom Remote","city":"Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications: Many years of experience as a software engineer, with a high level of familiarity with JavaScript/TypeScript, Java, or a comparable programming language, and the interest and ability to learn additional languages as required Experience building developer tools that operate on source code, such as compilers, static analyzers, debuggers, CLI tools, or IDE extensions Preferred Qualifications: Additionally, experience in any of the following areas would be considered a plus. We do not expect applicants to be familiar with all these areas, but encourage you to apply if you have some experience, or are strongly interested in developing these skills with us. software security, including static analysis, dynamic analysis, software supply chain security, or best practices in application security building integrations with CI/CD systems, such as GitHub Actions or Jenkins machine learning, including large language models (LLMs) and prompt engineering, applying machine learning to understanding source code, systematic data collection and result evaluation, and MLOps operating user-facing software at scale, including availability and observability experience with the Python, Go, Ruby, or C++ programming languages knowledge of compilers, logic programming or database query languages (e.g. SQL, Prolog, Datalog), program analysis, programming language design and implementation the ability to work with multiple stakeholders and teams across engineering, product, and design excellent verbal and written communication skills working in a distributed team, operating effectively across multiple time zones (this team spans a wide time zone range from Pacific time to Central European time) a passion for fostering good engineering practices, tools, and processes","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"You will work closely with other engineering teams that build different aspects of CodeQL analysis and the code scanning product, and help release their work into the hands of developers and security teams. You will engage with internal users and external users (both from enterprise customers and the open-source community) to help them succeed with the product. You will grow and scale the product, working as part of our Security Products group towards our mission of securing the world’s software. You’ll work closely with product managers, designers, technical writers, and engineers from multiple teams to influence product direction and deliver features to users, with clear focus on quality, reliability, and user experience. You’ll influence and provide feedback on the organizational culture and processes, always looking for opportunities to improve in a continuous pursuit for excellence.","posted_date":"January 1, 2024","apply_url":"https://globalcareers-githubinc.icims.com/jobs/2590/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-02-11T01:56:40Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-01-01T18:43:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":14,"uuid":"61dc2ae4-3d90-4d4e-96fb-61394427dcff"},"import_id":"623accdc-29c6-4cbf-9a9a-eaf21388ca6a","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/113029126861791942","jobHash":"4368ae8be590b6d8936aa90a5301c50a","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"You will work closely with other engineering teams that build different aspects of CodeQL analysis and the code scanning product, and help release their work into the hands of developers and security teams. You will engage with internal users and external users (both from enterprise customers and the open-source community) to help them succeed with the product. You will grow and scale the product, working as part of our Security Products group towards our mission of securing the world’s software. You’ll work closely with product managers, designers, technical writers, and engineers from multiple teams to influence product direction and deliver features to users, with clear focus on quality, reliability, and user experience. You’ll influence and provide feedback on the organizational culture and processes, always looking for opportunities to improve in a continuous pursuit for excellence.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2590?lang=en-us","last_mod":"2024-02-11T01:56:55+0000","gdpr":true},"update_date":"2024-02-11T01:56:55+0000","create_date":"2024-02-06T12:12:38+0000","category":[" Engineering"],"full_location":"Remote, United Kingdom","short_location":"Remote, United Kingdom"}},{"data":{"slug":"2543","language":"en-us","languages":["en-us"],"req_id":"2543","title":"Enterprise Advocate","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from San Francisco, California United States Overview GitHub is uniquely positioned to help enterprises and start-ups grow as well as help the world of software development and open source collaboration be better, safer and more welcoming to people of all backgrounds. We are looking for an experienced developer and communicator who is based in the Bay Area of the United States to join our well established and growing global Developer Relations team working closely with product, engineering, marketing and sales leaders across the company. What does Developer Relations at GitHub do? Whether the person is brand new to coding, a maker, a hobbyist, someone working on a personal project, someone contributing to open source, a team launching their first startup or someone working as part of a group in a large enterprise - they are a developer and we want to be there to support them and help them make awesome things. You can check out some of our recent work on keynotes, with the GitHub Stars, short-form video, live-streams, hackathons, social media, animated-gif goodness and more. Be on the ground, serving developers in regions around the world from our position in the core of the product team at GitHub Spark creativity and excitement around GitHub, and are always finding new ways to connect with developers Help IT professionals see how new features can make them faster, collaborate better, be more efficient, and more creative Connect product teams with the people they need to learn from to make GitHub work better for them - and help the engineering org learn from our customers Keep open source communities up to speed with the latest changes they can take advantage of and help maintainers be even more awesome than they already are. Success? That's based on happiness of developers, success of open source, ability to influence product direction and enabling the creativity of our super fans and the community around GitHub. Responsibilities What would you do? Learn: Everything about GitHub and what problems developers are trying to solve so you know how best to communicate with them and advocate for their needs with-in the wider product team. You are not alone in this, you will be joining an established team who are there to share ideas and work together but we also have access to the amazing engineering, support and professional services teams at GitHub along with our wonderful community. Share: Your industry knowledge and details about how GitHub build products and organize teams with peers and C-Levels at our customer and partner companies in the Bay Area and beyond. You will drive briefings with customer executives, run workshops with our customers and partners as well as create public facing content particularly focused on the needs of startups and enterprise developers. Nurture: Communities of engineers in the Bay Area and across the world that are using GitHub for their collaboration along with helping to grow the DevRel teams and helping the wider company improve how they communicate with other engineers outside of GitHub Teach: Define, create and execute on technical content creation programs across the company, helping our team in creating content but also helping others in the company ensure that content is appealing to our community. Communicate: Represent the company speaking at technical events and in interviews with press and analysts. You are a subject matter expert on all things dev and you help bring nerd cred to other teams in GitHub, such as the PR and social media teams. You help build channels that identify and share community content as well as measure how much that content is resonating Relationship management: Build a wide and diverse network amongst the developer community so they know someone they trust inside GitHub to advocate for their needs and you have a diverse network to seek out advice from and to connect to product teams when they are looking for people to give feedback on ideas and plans. Create Events: Organize and participate in online or virtual events, hackathons and manage Q\u0026As. You will be a core contributor to the team creating keynote and launch content (both stage delivered and pre-recorded produced video formats) Qualifications Required Qualifications: 8+ years of experience in a developer relations, consulting, or facilitation roles within software engineering 5+ years experience leading technical conversations with engineers and their leaders around the end to end DevOps workflows including planning, source control, CI/CD and deployment to a variety of cloud providers 5+ years experience communicating with a range of audiences including C-Level Executives about topics related to software development. 1+ experience with Git and GitHub and an understanding of their position in the marketplace Preferred Qualifications: Past experience working with GitHub and an array of our partners in the cloud platforms space. Significant knowledge and experience of current trends in software development Experience with applying DevOps principles in engineering teams. Experience as a technical meet-up leader or community builder. Compensation Range USD $104,400.00 - USD $276,900.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"San Francisco California","city":"San Francisco","state":"California","country":"United States","country_code":"US","location_type":"ANY","latitude":37.7749295,"longitude":-122.4194155,"categories":[{"name":"Engineering"}],"tags2":["US-CA-San Francisco"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Senior Manager"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 8+ years of experience in a developer relations, consulting, or facilitation roles within software engineering 5+ years experience leading technical conversations with engineers and their leaders around the end to end DevOps workflows including planning, source control, CI/CD and deployment to a variety of cloud providers 5+ years experience communicating with a range of audiences including C-Level Executives about topics related to software development. 1+ experience with Git and GitHub and an understanding of their position in the marketplace Preferred Qualifications: Past experience working with GitHub and an array of our partners in the cloud platforms space. Significant knowledge and experience of current trends in software development Experience with applying DevOps principles in engineering teams. Experience as a technical meet-up leader or community builder.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"What would you do? Learn: Everything about GitHub and what problems developers are trying to solve so you know how best to communicate with them and advocate for their needs with-in the wider product team. You are not alone in this, you will be joining an established team who are there to share ideas and work together but we also have access to the amazing engineering, support and professional services teams at GitHub along with our wonderful community. Share: Your industry knowledge and details about how GitHub build products and organize teams with peers and C-Levels at our customer and partner companies in the Bay Area and beyond. You will drive briefings with customer executives, run workshops with our customers and partners as well as create public facing content particularly focused on the needs of startups and enterprise developers. Nurture: Communities of engineers in the Bay Area and across the world that are using GitHub for their collaboration along with helping to grow the DevRel teams and helping the wider company improve how they communicate with other engineers outside of GitHub Teach: Define, create and execute on technical content creation programs across the company, helping our team in creating content but also helping others in the company ensure that content is appealing to our community. Communicate: Represent the company speaking at technical events and in interviews with press and analysts. You are a subject matter expert on all things dev and you help bring nerd cred to other teams in GitHub, such as the PR and social media teams. You help build channels that identify and share community content as well as measure how much that content is resonating Relationship management: Build a wide and diverse network amongst the developer community so they know someone they trust inside GitHub to advocate for their needs and you have a diverse network to seek out advice from and to connect to product teams when they are looking for people to give feedback on ideas and plans. Create Events: Organize and participate in online or virtual events, hackathons and manage Q\u0026As. You will be a core contributor to the team creating keynote and launch content (both stage delivered and pre-recorded produced video formats)","posted_date":"December 29, 2023","apply_url":"https://careers-githubinc.icims.com/jobs/2543/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-02-09T16:52:45Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-12-29T15:49:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":15,"uuid":"93be1b79-2d48-4a2d-b861-683b1fd85215"},"import_id":"d06cc79d-dfc7-4347-bea4-86c8a5a06166","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/120050058360955590","jobHash":"7870a66f0e25b995c07bba1873e17390","derivedInfo":{"jobCategories":["SOCIAL_SERVICES_AND_NON_PROFIT","COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":37.7749295,"longitude":-122.4194155},"locationType":"LOCALITY","postalAddress":{"addressLines":["San Francisco, CA, USA"],"administrativeArea":"CA","languageCode":"","locality":"San Francisco","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.00476906649485292}]},"jobSummary":"What would you do? Learn: Everything about GitHub and what problems developers are trying to solve so you know how best to communicate with them and advocate for their needs with-in the wider product team. You are not alone in this, you will be joining an established team who are there to share ideas and work together but we also have access to the amazing engineering, support and professional services teams at GitHub along with our wonderful community. Share: Your industry knowledge and details about how GitHub build products and organize teams with peers and C-Levels at our customer and partner companies in the Bay Area and beyond. You will drive briefings with customer executives, run workshops with our customers and partners as well as create public facing content particularly focused on the needs of startups and enterprise developers. Nurture: Communities of engineers in the Bay Area and across the world that are using GitHub for their collaboration along with helping to grow the DevRel teams and helping the wider company improve how they communicate with other engineers outside of GitHub Teach: Define, create and execute on technical content creation programs across the company, helping our team in creating content but also helping others in the company ensure that content is appealing to our community. Communicate: Represent the company speaking at technical events and in interviews with press and analysts. You are a subject matter expert on all things dev and you help bring nerd cred to other teams in GitHub, such as the PR and social media teams. You help build channels that identify and share community content as well as measure how much that content is resonating Relationship management: Build a wide and diverse network amongst the developer community so they know someone they trust inside GitHub to advocate for their needs and you have a diverse network to seek out advice from and to connect to product teams when they are looking for people to give feedback on ideas and plans. Create Events: Organize and participate in online or virtual events, hackathons and manage Q\u0026As. You will be a core contributor to the team creating keynote and launch content (both stage delivered and pre-recorded produced video formats)","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2543?lang=en-us","last_mod":"2024-02-09T16:53:22+0000","gdpr":false},"update_date":"2024-02-09T16:53:22+0000","create_date":"2024-02-06T12:12:29+0000","category":[" Engineering"],"full_location":"San Francisco, California","short_location":"San Francisco, California"}}],"totalCount":39,"count":39,"filter":{"displayLimit":10,"categories":{"all":[{"category":"Engineering","numJobs":39}],"shortlist":[{"category":"Engineering","numJobs":39}]},"brands":{"all":[],"shortlist":[]},"experienceLevels":{"all":[],"shortlist":[]},"locations":{"all":[{"city":"San Francisco","state":"California","country":"United States","count":1},{"city":"Remote","state":null,"country":"CAN","count":1},{"city":"Remote","state":null,"country":"Germany","count":2},{"city":"Remote","state":null,"country":"Spain","count":1},{"city":"Remote","state":null,"country":"United Kingdom","count":9},{"city":"Remote","state":null,"country":"United States","count":25}],"shortlist":[{"city":"San Francisco","state":"California","country":"United States","count":1},{"city":"Remote","state":null,"country":"CAN","count":1},{"city":"Remote","state":null,"country":"Germany","count":2},{"city":"Remote","state":null,"country":"Spain","count":1},{"city":"Remote","state":null,"country":"United Kingdom","count":9},{"city":"Remote","state":null,"country":"United States","count":25}]},"facetList":{"tags4":[{"term":"Experienced Professional","count":39}],"tags5":[{"term":"Individual Contributor","count":35},{"term":"Director","count":3},{"term":"Senior Manager","count":1}],"tags6":[{"term":"Yes","count":39}]}},"languageCounts":{"en-us":{"displayName":"English","count":39}},"request_id":false,"locations":[]}