{"jobs":[{"data":{"slug":"2664","language":"en-us","languages":["en-us"],"req_id":"2664","title":"Software Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview As a software engineer at GitHub, you will enhance the collaboration experience at GitHub by working closely with a community of engineers and designers with a distributed, diverse and passionate team delivering the services that millions of developers depend on. In this role you will design, prototype, implement, ship and support highly performant and inspiring user experiences with your team. We are looking for creative problem solvers and diverse thinkers, people who care about culture as well as customers and features. We believe that how we do things is as important as what we do. Big vision, a common purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what lead to great results. Great products reflect the teams that build them. Responsibilities Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code. Qualifications Required Qualifications Three or more years of experience as a software engineer or related field Bachelor's degree in Computer Science, Software Engineering or equivalent work experience 2+ years of experience delivering high availability, enterprise grade services, including monitoring, observability and diagnosing problems Four or more years of experience in two or more of the following skill sets: Ruby (Rails) Go and related tooling JavaScript (React, TypeScript, Relay) MySQL and database management NodeJS development Design and build REST and/or GraphQL APIs Experience with CI/CD tools and automated pipelines Preferred Qualifications Experience with Git, GitHub , Actions \u0026 workflow platform for version control and collaborative development. Internals of web development frameworks, tools, and client performance optimization. Building developer tools and pipelines that streamline and automate software lifecycle, including development, testing and releasing, with focus on speed, reliability and scalability. Excellent written and verbal communication via async collaboration, documentation, and visibility of work Hands-on experience with distributed systems at global scale. Experience working with a remote, distributed team. Familiarity with SQL, Kusto Query Language, general database knowledge, Kubernetes, and/or cloud-native concepts Passionate about fostering effective Engineering practices and processes and contribute to open source software, engage with maintainers, and actively participate in community curation. Compensation Range USD $90,700.00 - USD $240,500.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications Three or more years of experience as a software engineer or related field Bachelor's degree in Computer Science, Software Engineering or equivalent work experience 2+ years of experience delivering high availability, enterprise grade services, including monitoring, observability and diagnosing problems Four or more years of experience in two or more of the following skill sets: Ruby (Rails) Go and related tooling JavaScript (React, TypeScript, Relay) MySQL and database management NodeJS development Design and build REST and/or GraphQL APIs Experience with CI/CD tools and automated pipelines Preferred Qualifications Experience with Git, GitHub , Actions \u0026 workflow platform for version control and collaborative development. Internals of web development frameworks, tools, and client performance optimization. Building developer tools and pipelines that streamline and automate software lifecycle, including development, testing and releasing, with focus on speed, reliability and scalability. Excellent written and verbal communication via async collaboration, documentation, and visibility of work Hands-on experience with distributed systems at global scale. Experience working with a remote, distributed team. Familiarity with SQL, Kusto Query Language, general database knowledge, Kubernetes, and/or cloud-native concepts Passionate about fostering effective Engineering practices and processes and contribute to open source software, engage with maintainers, and actively participate in community curation.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","posted_date":"January 29, 2024","apply_url":"https://careers-githubinc.icims.com/jobs/2664/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-01-29T22:11:10Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-01-29T22:11:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":1,"uuid":"579cd39a-588b-480a-b140-8dbf8130aeda"},"import_id":"82764e38-9b92-44d7-905e-01556bbba416","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/112466361860399814","jobHash":"72bb1dce5f7d13eed42762fc0dc26a5e","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":7.17042852578733e-05}]},"jobSummary":"Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2664?lang=en-us","last_mod":"2024-01-29T22:11:25+0000","gdpr":false},"create_date":"2024-01-29T22:11:25+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2640","language":"en-us","languages":["en-us"],"req_id":"2640","title":"Senior Software Engineer, Copilot Platform","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, Germany Overview GitHub Copilot has changed the way software is built, and we have a unique opportunity to look further ahead to identify how software development can be faster, safer, easier, and more accessible. We’re looking for a talented and experienced Software Engineer to join us in this mission! GitHub Copilot Platform has a crucial role in advancing the core intelligence solutions that power the Copilot features in GitHub. GitHub Copilot Foundations owns the continued global scaling of GitHub’s code completion features and the expanding feature set to continue its industry-leading position. Both teams are also focused on ensuring other engineering teams at GitHub have the tools and processes necessary to build on top of our platform with as little friction as possible. As a Senior Software Engineer on the Copilot Platform or Foundations Team, you will work closely with a distributed, diverse, and passionate team of engineers and product managers with multiple teams across GitHub and Microsoft to improve and maintain our Platform that integrators depend on in their software development cycle. Together, we are dedicated to shaping the future of software development by continuously enhancing AI-powered capabilities in GitHub and beyond. The Copilot team is highly distributed and you will thrive in an environment of remote work and asynchronous communication. You're expected to have strong written communication skills and be able to develop working relationships with coworkers in locations around the globe. As an engineer at GitHub you'll always be challenged to solve interesting and novel problems that have real impact on how the world builds software. Responsibilities Lead technical decision making and architecture Design and implement scalable, reliable and performant solutions for problems like rate-limiting, request routing, etc. Write, review, and maintain code primarily in Go Mentor other engineers in their technical and architectural decision making Qualifications Required Qualifications: A few years of experience building high traffic services at scale A few years of experience building and/or consuming REST-style APIs Experience architecting highly available, high volume APIs Preferred Qualifications: Experience with Go and related tooling Experience with distributed systems at global scale Experience working with a remote, distributed team Excellent written and verbal communication skills Interest or prior experience in modern AI/machine learning technologies, Large Language Models or similar Passionate about fostering good API Design practices and processes GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"Germany Remote","city":"Remote","country":"Germany","country_code":"DE","location_type":"ANY","latitude":51.165691,"longitude":10.451526,"categories":[{"name":"Engineering"}],"tags2":["DE-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: A few years of experience building high traffic services at scale A few years of experience building and/or consuming REST-style APIs Experience architecting highly available, high volume APIs Preferred Qualifications: Experience with Go and related tooling Experience with distributed systems at global scale Experience working with a remote, distributed team Excellent written and verbal communication skills Interest or prior experience in modern AI/machine learning technologies, Large Language Models or similar Passionate about fostering good API Design practices and processes","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Lead technical decision making and architecture Design and implement scalable, reliable and performant solutions for problems like rate-limiting, request routing, etc. Write, review, and maintain code primarily in Go Mentor other engineers in their technical and architectural decision making","posted_date":"January 22, 2024","apply_url":"https://globalcareers-githubinc.icims.com/jobs/2640/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-01-25T18:54:56Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-01-22T16:06:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":3,"uuid":"6cb0bd75-b2e7-4af3-9ccc-5dea5f4b1172"},"import_id":"2417a095-664b-43e1-9c19-8d527190e6b5","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/77775046648439494","jobHash":"b52d4f57dd8bd1118ff876d77c52cba1","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":51.165691,"longitude":10.451526},"locationType":"COUNTRY","postalAddress":{"addressLines":["Germany"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"DE","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.21074213340642003}]},"jobSummary":"Lead technical decision making and architecture Design and implement scalable, reliable and performant solutions for problems like rate-limiting, request routing, etc. Write, review, and maintain code primarily in Go Mentor other engineers in their technical and architectural decision making","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2640?lang=en-us","last_mod":"2024-01-25T18:55:12+0000","gdpr":true},"update_date":"2024-01-25T18:55:12+0000","create_date":"2024-01-22T16:06:12+0000","category":[" Engineering"],"full_location":"Remote, Germany","short_location":"Remote, Germany"}},{"data":{"slug":"2484","language":"en-us","languages":["en-us"],"req_id":"2484","title":"Software Engineer, Internal Development Experience","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview GitHub is the home for software development, where developers collaborate to build some of the world’s most important software. In the GitHub code scanning team, we are passionate about securing the world’s software - from open source to the enterprise. We believe that the best way to secure software is to detect security issues early in the development process, and deliver a great user experience that engages, supports, and motivates developers to fix security vulnerabilities in a way that integrates naturally in their workflows. Our team develops and operates the code scanning product that’s part of GitHub’s Advanced Security offering. The challenges our developers face on a daily basis include rapid development lifecycle, thorough automated testing, and a complex technology stack with a wide support of the major operating systems. The opportunity: Come join our engineering team and help design and improve the code scanning internal developer experience team! You’ll belong to a distributed engineering team responsible for creating safe, delightful, and inclusive solutions for GitHub code scanning engineers to efficiently develop, test, ship, and operate software, by constantly improving and evolving the tools, processes, and support structures that enable our engineers to be productive, collaborative, and effective in delivering high-quality products and services to our customers. Responsibilities You will be continuously innovating to integrate new technologies into our tooling and pipelines. You will work closely with other engineering teams that build different aspects of code scanning products, and help release their work into the hands of developers and security teams. You will engage with internal users to help them succeed with the product. You will grow and scale the processes, pipelines and internal tooling, working as part of our Security Products group towards our mission of securing the world’s software. You’ll influence and provide feedback on the organizational culture and processes, always looking for opportunities to improve in a continuous pursuit for excellence. Qualifications Required Qualifications: For this role, we’re looking for an experienced software engineer with: Several years of experience as a software engineer, with many years of experience using JavaScript/TypeScript, Java, or a comparable programming language, and the interest and ability to learn additional languages as required. Experience building developer tools and pipelines that streamline and automate software lifecycle, including development, testing and releasing, with focus on speed, reliability and scalability. Preferred Qualifications: Additionally, experience in any of the following areas would be considered a plus. We do not expect applicants to be familiar with all these areas, but encourage you to apply if you have some experience, or are strongly interested in developing these skills with us. Excellent verbal and written communication skills, with the ability to clearly explain technical concepts to diverse audiences and write comprehensive technical doc; Collaboration skills, with demonstrated experience in successful projects in multi-team settings; the ability to listen to our internal users and understand their challenges, with a record of successfully resolved user-reported issues, or features implemented based on user feedback; and use that information to effectively contribute to building the team roadmap, with evidence of contributions to strategic decisions. Experience with CI/CD Tools, Strong knowledge of CI/CD concepts, GitHub actions and workflows platform, and other tools like Jenkins, Travis CI, CircleCI, GitLab, etc. Advanced knowledge of Git usage and branching strategies. Knowledge of build systems, specially Bazel. Monitoring and Logging: Experience with tools like Datadog or Grafana for monitoring infrastructure and applications is beneficial. Kusto query language and ADX dashboards familiarity would prove useful. Infrastructure management: Familiarity with Cloud Platforms, Containerization, Infrastructure as Code (and related automation tools such as Packer) and Orchestration stacks such as Kubernetes and its ecosystem (ex. Kustomize) is a nice-to-have. Software security, including static analysis, dynamic analysis, software supply chain security, or best practices in application security. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"United Kingdom Remote","city":"Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: For this role, we’re looking for an experienced software engineer with: Several years of experience as a software engineer, with many years of experience using JavaScript/TypeScript, Java, or a comparable programming language, and the interest and ability to learn additional languages as required. Experience building developer tools and pipelines that streamline and automate software lifecycle, including development, testing and releasing, with focus on speed, reliability and scalability. Preferred Qualifications: Additionally, experience in any of the following areas would be considered a plus. We do not expect applicants to be familiar with all these areas, but encourage you to apply if you have some experience, or are strongly interested in developing these skills with us. Excellent verbal and written communication skills, with the ability to clearly explain technical concepts to diverse audiences and write comprehensive technical doc; Collaboration skills, with demonstrated experience in successful projects in multi-team settings; the ability to listen to our internal users and understand their challenges, with a record of successfully resolved user-reported issues, or features implemented based on user feedback; and use that information to effectively contribute to building the team roadmap, with evidence of contributions to strategic decisions. Experience with CI/CD Tools, Strong knowledge of CI/CD concepts, GitHub actions and workflows platform, and other tools like Jenkins, Travis CI, CircleCI, GitLab, etc. Advanced knowledge of Git usage and branching strategies. Knowledge of build systems, specially Bazel. Monitoring and Logging: Experience with tools like Datadog or Grafana for monitoring infrastructure and applications is beneficial. Kusto query language and ADX dashboards familiarity would prove useful. Infrastructure management: Familiarity with Cloud Platforms, Containerization, Infrastructure as Code (and related automation tools such as Packer) and Orchestration stacks such as Kubernetes and its ecosystem (ex. Kustomize) is a nice-to-have. Software security, including static analysis, dynamic analysis, software supply chain security, or best practices in application security.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"You will be continuously innovating to integrate new technologies into our tooling and pipelines. You will work closely with other engineering teams that build different aspects of code scanning products, and help release their work into the hands of developers and security teams. You will engage with internal users to help them succeed with the product. You will grow and scale the processes, pipelines and internal tooling, working as part of our Security Products group towards our mission of securing the world’s software. You’ll influence and provide feedback on the organizational culture and processes, always looking for opportunities to improve in a continuous pursuit for excellence.","posted_date":"January 11, 2024","apply_url":"https://globalcareers-githubinc.icims.com/jobs/2484/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-01-18T19:29:54Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-01-11T03:56:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":5,"uuid":"3d72ce0c-a154-4284-a0c3-ffe9ebb6291e"},"import_id":"03c3beff-4348-4f62-b9bb-564b6fb77d1b","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/79598379585151686","jobHash":"1b45e4fcd7c276dd34411e7aeb84e3bc","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"You will be continuously innovating to integrate new technologies into our tooling and pipelines. You will work closely with other engineering teams that build different aspects of code scanning products, and help release their work into the hands of developers and security teams. You will engage with internal users to help them succeed with the product. You will grow and scale the processes, pipelines and internal tooling, working as part of our Security Products group towards our mission of securing the world’s software. You’ll influence and provide feedback on the organizational culture and processes, always looking for opportunities to improve in a continuous pursuit for excellence.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2484?lang=en-us","last_mod":"2024-01-18T19:30:03+0000","gdpr":true},"update_date":"2024-01-18T19:30:03+0000","create_date":"2024-01-11T03:58:36+0000","category":[" Engineering"],"full_location":"Remote, United Kingdom","short_location":"Remote, United Kingdom"}},{"data":{"slug":"2503","language":"en-us","languages":["en-us"],"req_id":"2503","title":"Staff Software Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview Join us in shaping the future of project planning and tracking on GitHub. Our team enables customers to bring their ideas to life, innovate and collaborate throughout the whole project lifecycle. GitHub Issues is a market-leading service to manage and track work right where it happens. Learn more about GitHub’s project management tools: https://github.com/features/#features-project-management Work closely with a diverse and passionate community of engineers and designers to enhance project management on GitHub. Join our distributed team in delivering reliable services to millions of developers worldwide.In this role you will design, prototype, implement, ship and support highly performant and inspiring user experiences with your team. We are looking for creative problem solvers and diverse thinkers, people who care about culture as well as customers and features. We believe that how we do things is as important as what we do. Big vision, a common purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what lead to great results. Great products reflect the teams that build them. Responsibilities As part of this team you’ll work on GitHub Issues and Projects and deliver customer value with everything we do. This job provides an opportunity to Build experiences that millions of people love and use every day, helping them to be more productive, collaborate more effectively and achieve their goals. Have a real impact, take on ownership of GitHub.com. Contribute to and improve our code base from day one. Grow your technical skills and learn about other technology stacks and disciplines. Investigate and play with new approaches that could be applied to our products. Write, review and maintain code primarily in Ruby and JavaScript (React, TypeScript) Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems Coordinate with engineering and product leads to define, prioritize, and task projects that help us meet business objectives Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others Qualifications Required Qualifications Several years of experience as a software engineer. React experience on a senior level. Experience in technical leadership. Preferred Qualifications 1+ years of experience working remote as part of a software engineering team. 3+ years of hands-on experience in modern web stacks (e.g. Rails, Go, React, MySQL, GraphQL, ...). You have experience in building top-notch, design-driven user interfaces You have a strong customer focus and data driven approach with a demonstrated ability to work in a fast-paced environment You have experience in designing and writing realtime web applications. You have excellent analytical skills as well as communication skills both verbal and written. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"United Kingdom Remote","city":"Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications Several years of experience as a software engineer. React experience on a senior level. Experience in technical leadership. Preferred Qualifications 1+ years of experience working remote as part of a software engineering team. 3+ years of hands-on experience in modern web stacks (e.g. Rails, Go, React, MySQL, GraphQL, ...). You have experience in building top-notch, design-driven user interfaces You have a strong customer focus and data driven approach with a demonstrated ability to work in a fast-paced environment You have experience in designing and writing realtime web applications. You have excellent analytical skills as well as communication skills both verbal and written.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"As part of this team you’ll work on GitHub Issues and Projects and deliver customer value with everything we do. This job provides an opportunity to Build experiences that millions of people love and use every day, helping them to be more productive, collaborate more effectively and achieve their goals. Have a real impact, take on ownership of GitHub.com. Contribute to and improve our code base from day one. Grow your technical skills and learn about other technology stacks and disciplines. Investigate and play with new approaches that could be applied to our products. Write, review and maintain code primarily in Ruby and JavaScript (React, TypeScript) Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems Coordinate with engineering and product leads to define, prioritize, and task projects that help us meet business objectives Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others","posted_date":"January 10, 2024","apply_url":"https://globalcareers-githubinc.icims.com/jobs/2503/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-01-11T23:12:49Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-01-10T15:31:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":8,"uuid":"ffbf60c8-bd5e-4bb1-b7c8-5c24d7db45a0"},"import_id":"056113f5-d82a-4ce5-8d3a-c0f59d56c385","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/75048673483858630","jobHash":"6aea633c6713b904b13712124c975a1c","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"As part of this team you’ll work on GitHub Issues and Projects and deliver customer value with everything we do. This job provides an opportunity to Build experiences that millions of people love and use every day, helping them to be more productive, collaborate more effectively and achieve their goals. Have a real impact, take on ownership of GitHub.com. Contribute to and improve our code base from day one. Grow your technical skills and learn about other technology stacks and disciplines. Investigate and play with new approaches that could be applied to our products. Write, review and maintain code primarily in Ruby and JavaScript (React, TypeScript) Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems Coordinate with engineering and product leads to define, prioritize, and task projects that help us meet business objectives Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2503?lang=en-us","last_mod":"2024-01-11T23:12:52+0000","gdpr":true},"update_date":"2024-01-11T23:12:52+0000","create_date":"2024-01-10T15:32:37+0000","category":[" Engineering"],"full_location":"Remote, United Kingdom","short_location":"Remote, United Kingdom"}},{"data":{"slug":"2522","language":"en-us","languages":["en-us"],"req_id":"2522","title":"Senior Director, Engineering - Supply Chain Security","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is changing the way the world builds software, and we want you to help build GitHub! We’re looking for an experienced Senior Director of Engineering to join us. The GitHub Security Products organization is on a mission to secure the world’s software. We firmly believe that software supply chain security needs to be at the center of this journey. The Supply Chain Security group, within Security Products, is focused on vulnerability awareness and management, dependency inventorying, package version management, security alert generation, and remediation. In addition to being responsible for this wide-reaching mission, you’ll support Engineering Managers and Engineers distributed across the United States and Europe. You’ll help set product direction and drive implementation, scale, reliability, and customer success. You’ll closely collaborate with your product, design, and field partners to achieve this. Together we are creating the tools and products that are integral to how people build software. We pride ourselves on being thoughtful, intentional, and productive. We hope you do as well. Responsibilities Drive defining organizational vision \u0026 objectives with leaders across Product, Design, and Engineering Communicate and reinforce vision and culture, lead teams to track and deliver business objectives Think creatively while balancing technical constraints and customer needs to enable your team to build architecturally consistent, high quality software to reliably meet customer needs and exceed their expectations Own and advocate for the health and quality of the systems that the team builds, participate in a manager on-call rotation, and respond to incidents as necessary Drive data driven improvements to both product quality and engineering efficiency across your organization Help ensure that individuals on the team are learning, growing and advancing in their respective careers through mentorship, pairing, and delegating work Participate in hiring and sourcing to build a diverse high performance team of managers and engineers Cultivate an environment across the company where team members are empowered and demonstrate a strong sense of ownership and belonging Ensure the team, the company and the community have a clear understanding of the direction of the projects and the reasoning behind decisions Qualifications Required Qualifications: 4+ years of experience building and launching SaaS products to market Bachelor’s degree in computer science or related field AND 8+ years of experience developing web applications or large scale distributed systems OR equivalent experience 5+ years of experience leading engineering teams delivering high availability, enterprise grade services 2+ years of experience managing through managers Other Qualifications: Ability to meet GitHub, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft, GitHub’s parent company, Cloud Screen upon hire/transfer and every two years thereafter. Preferred Qualifications: Experience delivering supply chain security products is a huge plus At least 1 year of remote work experience leading a distributed software team Experience developing engineering strategy, fostering best practices and processes Experience building, scaling, and managing a diverse team within a rapidly changing environment. Experience scaling a large service through years of growth with proven technical leadership and a passion for technology Experience with maintaining production systems including: monitoring, observability and diagnosing problems Excellent analytical skills as well as communication skills both verbal and written. We’re a distributed team so we’re extra mindful about communication Strong customer focus and data driven approach Experience in Go, Ruby is a plus Compensation Range USD $134,800.00 - USD $357,500.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Senior Director"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 4+ years of experience building and launching SaaS products to market Bachelor’s degree in computer science or related field AND 8+ years of experience developing web applications or large scale distributed systems OR equivalent experience 5+ years of experience leading engineering teams delivering high availability, enterprise grade services 2+ years of experience managing through managers Other Qualifications: Ability to meet GitHub, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft, GitHub’s parent company, Cloud Screen upon hire/transfer and every two years thereafter. Preferred Qualifications: Experience delivering supply chain security products is a huge plus At least 1 year of remote work experience leading a distributed software team Experience developing engineering strategy, fostering best practices and processes Experience building, scaling, and managing a diverse team within a rapidly changing environment. Experience scaling a large service through years of growth with proven technical leadership and a passion for technology Experience with maintaining production systems including: monitoring, observability and diagnosing problems Excellent analytical skills as well as communication skills both verbal and written. We’re a distributed team so we’re extra mindful about communication Strong customer focus and data driven approach Experience in Go, Ruby is a plus","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Drive defining organizational vision \u0026 objectives with leaders across Product, Design, and Engineering Communicate and reinforce vision and culture, lead teams to track and deliver business objectives Think creatively while balancing technical constraints and customer needs to enable your team to build architecturally consistent, high quality software to reliably meet customer needs and exceed their expectations Own and advocate for the health and quality of the systems that the team builds, participate in a manager on-call rotation, and respond to incidents as necessary Drive data driven improvements to both product quality and engineering efficiency across your organization Help ensure that individuals on the team are learning, growing and advancing in their respective careers through mentorship, pairing, and delegating work Participate in hiring and sourcing to build a diverse high performance team of managers and engineers Cultivate an environment across the company where team members are empowered and demonstrate a strong sense of ownership and belonging Ensure the team, the company and the community have a clear understanding of the direction of the projects and the reasoning behind decisions","posted_date":"January 4, 2024","apply_url":"https://careers-githubinc.icims.com/jobs/2522/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-01-26T22:12:10Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-01-04T23:06:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":6,"uuid":"8517d3fc-61ef-4f28-8a70-4ff1529e682e"},"import_id":"6b662d15-bc94-4753-a7ad-4260d5d5a6b7","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/84918722004689606","jobHash":"bdd725899df30bd34a587f6d83d11dc1","derivedInfo":{"jobCategories":["SALES_AND_RETAIL","MANAGEMENT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":7.17042852578733e-05}]},"jobSummary":"Drive defining organizational vision \u0026 objectives with leaders across Product, Design, and Engineering Communicate and reinforce vision and culture, lead teams to track and deliver business objectives Think creatively while balancing technical constraints and customer needs to enable your team to build architecturally consistent, high quality software to reliably meet customer needs and exceed their expectations Own and advocate for the health and quality of the systems that the team builds, participate in a manager on-call rotation, and respond to incidents as necessary Drive data driven improvements to both product quality and engineering efficiency across your organization Help ensure that individuals on the team are learning, growing and advancing in their respective careers through mentorship, pairing, and delegating work Participate in hiring and sourcing to build a diverse high performance team of managers and engineers Cultivate an environment across the company where team members are empowered and demonstrate a strong sense of ownership and belonging Ensure the team, the company and the community have a clear understanding of the direction of the projects and the reasoning behind decisions","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2522?lang=en-us","last_mod":"2024-01-26T22:12:12+0000","gdpr":false},"update_date":"2024-01-26T22:12:12+0000","create_date":"2024-01-04T23:07:39+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2590","language":"en-us","languages":["en-us"],"req_id":"2590","title":"Senior Software Engineer, CodeQL Experiences","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview GitHub is the home for software development, where developers collaborate to build some of the world’s most important software. In the GitHub code scanning team, we are passionate about securing the world’s software - from open source to the enterprise. We believe that the best way to secure software is to detect security issues early in the development process, and deliver a great user experience that engages, supports, and motivates developers to fix security vulnerabilities in a way that integrates naturally in their workflows. Our team develops and operates the code scanning product that’s part of GitHub’s Advanced Security offering. A central part of code scanning is CodeQL, GitHub's own semantic code analysis engine that uses world-class static analysis research and technology to deeply analyze code, enabling the early detection of security vulnerabilities and correctness errors in software. Come join our engineering team and help build CodeQL, GitHub’s first-party code scanning tool! You’ll belong to a distributed engineering team responsible for making CodeQL available to thousands of developers and hundreds of thousands of projects every day, by integrating it into GitHub Actions, third-party CI systems, the command line, and the IDE. You will build new features across a variety of products and systems, including the CodeQL CLI, the CodeQL Action, the CodeQL query libraries, the CodeQL extension for Visual Studio Code, GitHub core services, and AI-powered autofix and threat modeling capabilities. You will be continuously innovating to expand the core capabilities of CodeQL, building elegant customization mechanisms and integrations with machine learning to make its analysis even more powerful. Responsibilities You will work closely with other engineering teams that build different aspects of CodeQL analysis and the code scanning product, and help release their work into the hands of developers and security teams. You will engage with internal users and external users (both from enterprise customers and the open-source community) to help them succeed with the product. You will grow and scale the product, working as part of our Security Products group towards our mission of securing the world’s software. You’ll work closely with product managers, designers, technical writers, and engineers from multiple teams to influence product direction and deliver features to users, with clear focus on quality, reliability, and user experience. You’ll influence and provide feedback on the organizational culture and processes, always looking for opportunities to improve in a continuous pursuit for excellence. Qualifications Required Qualifications: Many years of experience as a software engineer, with a high level of familiarity with JavaScript/TypeScript, Java, or a comparable programming language, and the interest and ability to learn additional languages as required Experience building developer tools that operate on source code, such as compilers, static analyzers, debuggers, CLI tools, or IDE extensions Preferred Qualifications: Additionally, experience in any of the following areas would be considered a plus. We do not expect applicants to be familiar with all these areas, but encourage you to apply if you have some experience, or are strongly interested in developing these skills with us. software security, including static analysis, dynamic analysis, software supply chain security, or best practices in application security building integrations with CI/CD systems, such as GitHub Actions or Jenkins machine learning, including large language models (LLMs) and prompt engineering, applying machine learning to understanding source code, systematic data collection and result evaluation, and MLOps operating user-facing software at scale, including availability and observability experience with the Python, Go, Ruby, or C++ programming languages knowledge of compilers, logic programming or database query languages (e.g. SQL, Prolog, Datalog), program analysis, programming language design and implementation the ability to work with multiple stakeholders and teams across engineering, product, and design excellent verbal and written communication skills working in a distributed team, operating effectively across multiple time zones (this team spans a wide time zone range from Pacific time to Central European time) a passion for fostering good engineering practices, tools, and processes GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"United Kingdom Remote","city":"Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications: Many years of experience as a software engineer, with a high level of familiarity with JavaScript/TypeScript, Java, or a comparable programming language, and the interest and ability to learn additional languages as required Experience building developer tools that operate on source code, such as compilers, static analyzers, debuggers, CLI tools, or IDE extensions Preferred Qualifications: Additionally, experience in any of the following areas would be considered a plus. We do not expect applicants to be familiar with all these areas, but encourage you to apply if you have some experience, or are strongly interested in developing these skills with us. software security, including static analysis, dynamic analysis, software supply chain security, or best practices in application security building integrations with CI/CD systems, such as GitHub Actions or Jenkins machine learning, including large language models (LLMs) and prompt engineering, applying machine learning to understanding source code, systematic data collection and result evaluation, and MLOps operating user-facing software at scale, including availability and observability experience with the Python, Go, Ruby, or C++ programming languages knowledge of compilers, logic programming or database query languages (e.g. SQL, Prolog, Datalog), program analysis, programming language design and implementation the ability to work with multiple stakeholders and teams across engineering, product, and design excellent verbal and written communication skills working in a distributed team, operating effectively across multiple time zones (this team spans a wide time zone range from Pacific time to Central European time) a passion for fostering good engineering practices, tools, and processes","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"You will work closely with other engineering teams that build different aspects of CodeQL analysis and the code scanning product, and help release their work into the hands of developers and security teams. You will engage with internal users and external users (both from enterprise customers and the open-source community) to help them succeed with the product. You will grow and scale the product, working as part of our Security Products group towards our mission of securing the world’s software. You’ll work closely with product managers, designers, technical writers, and engineers from multiple teams to influence product direction and deliver features to users, with clear focus on quality, reliability, and user experience. You’ll influence and provide feedback on the organizational culture and processes, always looking for opportunities to improve in a continuous pursuit for excellence.","posted_date":"January 1, 2024","apply_url":"https://globalcareers-githubinc.icims.com/jobs/2590/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-01-11T20:55:28Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-01-01T18:43:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":5,"uuid":"61dc2ae4-3d90-4d4e-96fb-61394427dcff"},"import_id":"841130b3-d50a-41b7-b9cb-279d895705ad","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/107879523216696006","jobHash":"93cb20da22159e02b9e2290ff42dc326","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"You will work closely with other engineering teams that build different aspects of CodeQL analysis and the code scanning product, and help release their work into the hands of developers and security teams. You will engage with internal users and external users (both from enterprise customers and the open-source community) to help them succeed with the product. You will grow and scale the product, working as part of our Security Products group towards our mission of securing the world’s software. You’ll work closely with product managers, designers, technical writers, and engineers from multiple teams to influence product direction and deliver features to users, with clear focus on quality, reliability, and user experience. You’ll influence and provide feedback on the organizational culture and processes, always looking for opportunities to improve in a continuous pursuit for excellence.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2590?lang=en-us","last_mod":"2024-01-11T20:55:52+0000","gdpr":true},"update_date":"2024-01-11T20:55:52+0000","create_date":"2024-01-01T18:43:39+0000","category":[" Engineering"],"full_location":"Remote, United Kingdom","short_location":"Remote, United Kingdom"}},{"data":{"slug":"2543","language":"en-us","languages":["en-us"],"req_id":"2543","title":"Enterprise Advocate","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from San Francisco, California United States Overview GitHub is uniquely positioned to help enterprises and start-ups grow as well as help the world of software development and open source collaboration be better, safer and more welcoming to people of all backgrounds. We are looking for an experienced developer and communicator who is based in the Bay Area of the United States to join our well established and growing global Developer Relations team working closely with product, engineering, marketing and sales leaders across the company. What does Developer Relations at GitHub do? Whether the person is brand new to coding, a maker, a hobbyist, someone working on a personal project, someone contributing to open source, a team launching their first startup or someone working as part of a group in a large enterprise - they are a developer and we want to be there to support them and help them make awesome things. You can check out some of our recent work on keynotes, with the GitHub Stars, short-form video, live-streams, hackathons, social media, animated-gif goodness and more. Be on the ground, serving developers in regions around the world from our position in the core of the product team at GitHub Spark creativity and excitement around GitHub, and are always finding new ways to connect with developers Help IT professionals see how new features can make them faster, collaborate better, be more efficient, and more creative Connect product teams with the people they need to learn from to make GitHub work better for them - and help the engineering org learn from our customers Keep open source communities up to speed with the latest changes they can take advantage of and help maintainers be even more awesome than they already are. Success? That's based on happiness of developers, success of open source, ability to influence product direction and enabling the creativity of our super fans and the community around GitHub. Responsibilities What would you do? Learn: Everything about GitHub and what problems developers are trying to solve so you know how best to communicate with them and advocate for their needs with-in the wider product team. You are not alone in this, you will be joining an established team who are there to share ideas and work together but we also have access to the amazing engineering, support and professional services teams at GitHub along with our wonderful community. Share: Your industry knowledge and details about how GitHub build products and organize teams with peers and C-Levels at our customer and partner companies in the Bay Area and beyond. You will drive briefings with customer executives, run workshops with our customers and partners as well as create public facing content particularly focused on the needs of startups and enterprise developers. Nurture: Communities of engineers in the Bay Area and across the world that are using GitHub for their collaboration along with helping to grow the DevRel teams and helping the wider company improve how they communicate with other engineers outside of GitHub Teach: Define, create and execute on technical content creation programs across the company, helping our team in creating content but also helping others in the company ensure that content is appealing to our community. Communicate: Represent the company speaking at technical events and in interviews with press and analysts. You are a subject matter expert on all things dev and you help bring nerd cred to other teams in GitHub, such as the PR and social media teams. You help build channels that identify and share community content as well as measure how much that content is resonating Relationship management: Build a wide and diverse network amongst the developer community so they know someone they trust inside GitHub to advocate for their needs and you have a diverse network to seek out advice from and to connect to product teams when they are looking for people to give feedback on ideas and plans. Create Events: Organize and participate in online or virtual events, hackathons and manage Q\u0026As. You will be a core contributor to the team creating keynote and launch content (both stage delivered and pre-recorded produced video formats) Qualifications Required Qualifications: 8+ years of experience in a developer relations, consulting, or facilitation roles within software engineering 5+ years experience leading technical conversations with engineers and their leaders around the end to end DevOps workflows including planning, source control, CI/CD and deployment to a variety of cloud providers 5+ years experience communicating with a range of audiences including C-Level Executives about topics related to software development. 1+ experience with Git and GitHub and an understanding of their position in the marketplace Preferred Qualifications: Past experience working with GitHub and an array of our partners in the cloud platforms space. Significant knowledge and experience of current trends in software development Experience with applying DevOps principles in engineering teams. Experience as a technical meet-up leader or community builder. Compensation Range USD $104,400.00 - USD $276,900.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"San Francisco California","city":"San Francisco","state":"California","country":"United States","country_code":"US","location_type":"ANY","latitude":37.7749295,"longitude":-122.4194155,"categories":[{"name":"Engineering"}],"tags2":["US-CA-San Francisco"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Senior Manager"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 8+ years of experience in a developer relations, consulting, or facilitation roles within software engineering 5+ years experience leading technical conversations with engineers and their leaders around the end to end DevOps workflows including planning, source control, CI/CD and deployment to a variety of cloud providers 5+ years experience communicating with a range of audiences including C-Level Executives about topics related to software development. 1+ experience with Git and GitHub and an understanding of their position in the marketplace Preferred Qualifications: Past experience working with GitHub and an array of our partners in the cloud platforms space. Significant knowledge and experience of current trends in software development Experience with applying DevOps principles in engineering teams. Experience as a technical meet-up leader or community builder.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"What would you do? Learn: Everything about GitHub and what problems developers are trying to solve so you know how best to communicate with them and advocate for their needs with-in the wider product team. You are not alone in this, you will be joining an established team who are there to share ideas and work together but we also have access to the amazing engineering, support and professional services teams at GitHub along with our wonderful community. Share: Your industry knowledge and details about how GitHub build products and organize teams with peers and C-Levels at our customer and partner companies in the Bay Area and beyond. You will drive briefings with customer executives, run workshops with our customers and partners as well as create public facing content particularly focused on the needs of startups and enterprise developers. Nurture: Communities of engineers in the Bay Area and across the world that are using GitHub for their collaboration along with helping to grow the DevRel teams and helping the wider company improve how they communicate with other engineers outside of GitHub Teach: Define, create and execute on technical content creation programs across the company, helping our team in creating content but also helping others in the company ensure that content is appealing to our community. Communicate: Represent the company speaking at technical events and in interviews with press and analysts. You are a subject matter expert on all things dev and you help bring nerd cred to other teams in GitHub, such as the PR and social media teams. You help build channels that identify and share community content as well as measure how much that content is resonating Relationship management: Build a wide and diverse network amongst the developer community so they know someone they trust inside GitHub to advocate for their needs and you have a diverse network to seek out advice from and to connect to product teams when they are looking for people to give feedback on ideas and plans. Create Events: Organize and participate in online or virtual events, hackathons and manage Q\u0026As. You will be a core contributor to the team creating keynote and launch content (both stage delivered and pre-recorded produced video formats)","posted_date":"December 29, 2023","apply_url":"https://careers-githubinc.icims.com/jobs/2543/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-01-12T17:53:50Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-12-29T15:49:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":10,"uuid":"93be1b79-2d48-4a2d-b861-683b1fd85215"},"import_id":"499d28e9-44d8-4bd2-9029-d865646ab68a","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/117954440603804358","jobHash":"a91edbd0c8833025e15f2500bc47dd35","derivedInfo":{"jobCategories":["SOCIAL_SERVICES_AND_NON_PROFIT","COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":37.7749295,"longitude":-122.4194155},"locationType":"LOCALITY","postalAddress":{"addressLines":["San Francisco, CA, USA"],"administrativeArea":"CA","languageCode":"","locality":"San Francisco","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.00476906649485292}]},"jobSummary":"What would you do? Learn: Everything about GitHub and what problems developers are trying to solve so you know how best to communicate with them and advocate for their needs with-in the wider product team. You are not alone in this, you will be joining an established team who are there to share ideas and work together but we also have access to the amazing engineering, support and professional services teams at GitHub along with our wonderful community. Share: Your industry knowledge and details about how GitHub build products and organize teams with peers and C-Levels at our customer and partner companies in the Bay Area and beyond. You will drive briefings with customer executives, run workshops with our customers and partners as well as create public facing content particularly focused on the needs of startups and enterprise developers. Nurture: Communities of engineers in the Bay Area and across the world that are using GitHub for their collaboration along with helping to grow the DevRel teams and helping the wider company improve how they communicate with other engineers outside of GitHub Teach: Define, create and execute on technical content creation programs across the company, helping our team in creating content but also helping others in the company ensure that content is appealing to our community. Communicate: Represent the company speaking at technical events and in interviews with press and analysts. You are a subject matter expert on all things dev and you help bring nerd cred to other teams in GitHub, such as the PR and social media teams. You help build channels that identify and share community content as well as measure how much that content is resonating Relationship management: Build a wide and diverse network amongst the developer community so they know someone they trust inside GitHub to advocate for their needs and you have a diverse network to seek out advice from and to connect to product teams when they are looking for people to give feedback on ideas and plans. Create Events: Organize and participate in online or virtual events, hackathons and manage Q\u0026As. You will be a core contributor to the team creating keynote and launch content (both stage delivered and pre-recorded produced video formats)","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2543?lang=en-us","last_mod":"2024-01-12T17:53:52+0000","gdpr":false},"update_date":"2024-01-12T17:53:52+0000","create_date":"2023-12-29T15:50:39+0000","category":[" Engineering"],"full_location":"San Francisco, California","short_location":"San Francisco, California"}},{"data":{"slug":"2542","language":"en-us","languages":["en-us"],"req_id":"2542","title":"Director of Enterprise Advocacy","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview Join our team to help the world of software development and open source collaboration be better, safer and welcoming to people of all backgrounds. GitHub is uniquely positioned to help developers grow and also help grow the next generation of people becoming developers. We are looking for a highly experienced Director of Developer Advocacy to join our well established and growing global Developer Relations team. What does Developer Relations at GitHub do? Whether the person is brand new to coding, a maker, a hobbyist, someone working on a personal project, someone contributing to open source, a team launching their first startup or someone working as part of a group in a large enterprise - they are a developer and we want to be there to support them and help them make awesome things. You can check out some of our recent work on keynotes, with the GitHub Stars, short-form video, live-streams, hackathons, social media, animated-gif goodness and more. Help IT professionals see how new features can make them faster, collaborate better, be more efficient, and more creative Be on the ground, serving developers in regions around the world from our position in the core of the product team at GitHub Spark creativity and excitement around GitHub, and are always finding new ways to connect with developers Connect product teams with the people they need to learn from to make GitHub work better for them - and help the engineering org learn from our customers Keep open source communities up to speed with the latest changes they can take advantage of and help maintainers be even more awesome than they already are. Success? That's based on the happiness of developers, success of open source, ability to influence product direction and enabling the creativity of our super fans and the community around GitHub Responsibilities What would you do? Lead: Provide the direction, guidance and mentoring for a growing team of developer advocates based around the globe. Define the strategies, targets, tactics the team will use and define how we will measure the impact that the team will undoubtedly have on our business goals Nurture: Your team and through them nurture communities of engineers across the world that are using GitHub for their collaboration - especially focused on communities with-in the Enterprise and Start-up space. Learn: Everything about GitHub and what problems developers are trying to solve so you know how best to communicate with them and advocate for their needs with-in the wider product team. You are not alone in this, you will be joining an established team who are there to share ideas and work together but we also work very closely with the amazing engineering, support and professional services teams at GitHub along with our wonderful community. Teach: Define, create and execute on technical content creation programs across the company, helping your team in creating content but also helping others in the company ensure that content is appealing to developers by developing appropriate systems to measure and improve content targeting and improve the feedback loops to help focus future content. Communicate: Represent the company speaking at technical events and in interviews with press and analysts. You are a subject matter expert on all things dev and you help other teams in GitHub, such as the PR and social media teams. You help build channels that identify and share community content as well as help us measure how much that content is resonating. Relationship management: Build a wide and diverse network amongst the developer community so they know someone they trust inside GitHub to advocate for their needs and you have a diverse network to seek out advice from and to connect to product teams when they are looking for people to give feedback on ideas and plans. Qualifications Required Qualifications: 5+ years of overall team management experience 2+ years experience leading Developer Advocates / Developer Evangelists for a company focused on developer products and services 7+ years experience in having technical conversations with developer \u0026 technical communities focused on DevOps (source control, CI/CD, deployment to a variety of cloud providers, etc.) Experience working with Git / GitHub including deploying applications and services to one or more key cloud platforms such as AWS, Azure or GCP. 10+ years of experience creating and delivering technical presentations, demos and keynotes to a range of audiences Preferred Qualifications: Existing relationships with technical leaders in the industry. Past experience as a technical meet-up leader or community builder. Experience working in a remote team spread across global time zones. Compensation Range USD $118,100.00 - USD $313,300.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Director"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 5+ years of overall team management experience 2+ years experience leading Developer Advocates / Developer Evangelists for a company focused on developer products and services 7+ years experience in having technical conversations with developer \u0026 technical communities focused on DevOps (source control, CI/CD, deployment to a variety of cloud providers, etc.) Experience working with Git / GitHub including deploying applications and services to one or more key cloud platforms such as AWS, Azure or GCP. 10+ years of experience creating and delivering technical presentations, demos and keynotes to a range of audiences Preferred Qualifications: Existing relationships with technical leaders in the industry. Past experience as a technical meet-up leader or community builder. Experience working in a remote team spread across global time zones.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"What would you do? Lead: Provide the direction, guidance and mentoring for a growing team of developer advocates based around the globe. Define the strategies, targets, tactics the team will use and define how we will measure the impact that the team will undoubtedly have on our business goals Nurture: Your team and through them nurture communities of engineers across the world that are using GitHub for their collaboration - especially focused on communities with-in the Enterprise and Start-up space. Learn: Everything about GitHub and what problems developers are trying to solve so you know how best to communicate with them and advocate for their needs with-in the wider product team. You are not alone in this, you will be joining an established team who are there to share ideas and work together but we also work very closely with the amazing engineering, support and professional services teams at GitHub along with our wonderful community. Teach: Define, create and execute on technical content creation programs across the company, helping your team in creating content but also helping others in the company ensure that content is appealing to developers by developing appropriate systems to measure and improve content targeting and improve the feedback loops to help focus future content. Communicate: Represent the company speaking at technical events and in interviews with press and analysts. You are a subject matter expert on all things dev and you help other teams in GitHub, such as the PR and social media teams. You help build channels that identify and share community content as well as help us measure how much that content is resonating. Relationship management: Build a wide and diverse network amongst the developer community so they know someone they trust inside GitHub to advocate for their needs and you have a diverse network to seek out advice from and to connect to product teams when they are looking for people to give feedback on ideas and plans.","posted_date":"December 28, 2023","apply_url":"https://careers-githubinc.icims.com/jobs/2542/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-01-12T17:54:45Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-12-28T21:33:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":13,"uuid":"3e386e49-14ee-4be4-82ec-81d5d871129e"},"import_id":"9a7f10da-0be0-47ad-9a6f-1be2ce01269c","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/114566872122172102","jobHash":"82515445c17756341dc1c1d4e3a5c349","derivedInfo":{"jobCategories":["MANAGEMENT","COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":7.17042852578733e-05}]},"jobSummary":"What would you do? Lead: Provide the direction, guidance and mentoring for a growing team of developer advocates based around the globe. Define the strategies, targets, tactics the team will use and define how we will measure the impact that the team will undoubtedly have on our business goals Nurture: Your team and through them nurture communities of engineers across the world that are using GitHub for their collaboration - especially focused on communities with-in the Enterprise and Start-up space. Learn: Everything about GitHub and what problems developers are trying to solve so you know how best to communicate with them and advocate for their needs with-in the wider product team. You are not alone in this, you will be joining an established team who are there to share ideas and work together but we also work very closely with the amazing engineering, support and professional services teams at GitHub along with our wonderful community. Teach: Define, create and execute on technical content creation programs across the company, helping your team in creating content but also helping others in the company ensure that content is appealing to developers by developing appropriate systems to measure and improve content targeting and improve the feedback loops to help focus future content. Communicate: Represent the company speaking at technical events and in interviews with press and analysts. You are a subject matter expert on all things dev and you help other teams in GitHub, such as the PR and social media teams. You help build channels that identify and share community content as well as help us measure how much that content is resonating. Relationship management: Build a wide and diverse network amongst the developer community so they know someone they trust inside GitHub to advocate for their needs and you have a diverse network to seek out advice from and to connect to product teams when they are looking for people to give feedback on ideas and plans.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2542?lang=en-us","last_mod":"2024-01-12T17:54:52+0000","gdpr":false},"update_date":"2024-01-12T17:54:52+0000","create_date":"2023-12-27T23:29:39+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2523","language":"en-us","languages":["en-us"],"req_id":"2523","title":"Staff Software Engineering Manager - Database Infrastructure","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview Database Infrastructure is responsible for managing, scaling and operating a fleet of data stores. We build tools and microservices to operate our databases and create self-service platforms for developers at GitHub. We're looking for an experienced engineering manager to help lead a distributed team of Platform Engineers. This role is not about dictating or managing a team member’s work directly, but rather guiding and serving to ensure the happiness and productivity of the team. As a leader and manager, you will directly influence engineering culture, mentor and grow other engineers, engage in long term architectural planning, and partner closely with key partners across the company to help deliver a highly available, resilient and scalable database platform. The engineers are responsible for the scalability, maintainability and performance of our MySQL database and provide robust APIs on top of our data model. For more about our work, read our blog posts on MySQL 8.0 upgrade and partitioning our data. The team is highly distributed and the right candidate can thrive in an environment of asynchronous communication. We expect you to have strong written and verbal communication skills and be able to create working relationships with coworkers in locations around the globe. Responsibilities Scale our database and application across multiple regions and in the Cloud. Oversee and guide a distributed team, guiding the team’s vision, best practices, and priorities. Provide clarity and a shared understanding of decision making, direction, and progress for the team and the company. Meeting 1-1 with team members on a regular basis. Provide career development plans and guided performance feedback. Review code, design docs and lead small group discussions about technical problems Drive incident response and facilitate blameless postmortems Plan and execute complex technical projects, coordinating work with engineering teams across the stack. Qualifications Required Qualifications 6+ years professional experience 2+ years of managing engineering teams 2+ years experience building, scaling and maintaining distributed, highly available systems. Preferred Qualifications Strong written and verbal communication skills. Passionate about resiliency and reliable infrastructure and building for high availability Experience managing and working on distributed teams. Experience with relational databases especially MySQL or Vitess Experience with reliability engineering or experience being oncall for highly available systems Experience designing large scale cloud services and distributed systems Experience maintaining production environments including monitoring, observability, and incident remediation Experience with cloud platforms like Microsoft Azure and Amazon Web Services Strong focus on customer and data driven decision making Excellent analytical skills when proactively identifying risks and balancing priorities Excellent communication skills including experience writing design documents and strategy documents Passionate about creating and fostering good engineering practices and processes Compensation Range USD $118,100.00 - USD $313,300.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Director"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications 6+ years professional experience 2+ years of managing engineering teams 2+ years experience building, scaling and maintaining distributed, highly available systems. Preferred Qualifications Strong written and verbal communication skills. Passionate about resiliency and reliable infrastructure and building for high availability Experience managing and working on distributed teams. Experience with relational databases especially MySQL or Vitess Experience with reliability engineering or experience being oncall for highly available systems Experience designing large scale cloud services and distributed systems Experience maintaining production environments including monitoring, observability, and incident remediation Experience with cloud platforms like Microsoft Azure and Amazon Web Services Strong focus on customer and data driven decision making Excellent analytical skills when proactively identifying risks and balancing priorities Excellent communication skills including experience writing design documents and strategy documents Passionate about creating and fostering good engineering practices and processes","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Scale our database and application across multiple regions and in the Cloud. Oversee and guide a distributed team, guiding the team’s vision, best practices, and priorities. Provide clarity and a shared understanding of decision making, direction, and progress for the team and the company. Meeting 1-1 with team members on a regular basis. Provide career development plans and guided performance feedback. Review code, design docs and lead small group discussions about technical problems Drive incident response and facilitate blameless postmortems Plan and execute complex technical projects, coordinating work with engineering teams across the stack.","posted_date":"December 28, 2023","apply_url":"https://careers-githubinc.icims.com/jobs/2523/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-01-11T20:44:24Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-12-28T19:57:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":8,"uuid":"fb4dac38-a7b3-4436-94a9-c6d5bec1a534"},"import_id":"8d232946-bfa1-430b-a2f9-5cb887b91c26","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/80520962719523526","jobHash":"73aec512e429e794ba6a1f6f714c2da0","derivedInfo":{"jobCategories":["MANAGEMENT","COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":7.17042852578733e-05}]},"jobSummary":"Scale our database and application across multiple regions and in the Cloud. Oversee and guide a distributed team, guiding the team’s vision, best practices, and priorities. Provide clarity and a shared understanding of decision making, direction, and progress for the team and the company. Meeting 1-1 with team members on a regular basis. Provide career development plans and guided performance feedback. Review code, design docs and lead small group discussions about technical problems Drive incident response and facilitate blameless postmortems Plan and execute complex technical projects, coordinating work with engineering teams across the stack.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2523?lang=en-us","last_mod":"2024-01-11T20:44:52+0000","gdpr":false},"update_date":"2024-01-11T20:44:52+0000","create_date":"2023-12-28T19:58:39+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2591","language":"en-us","languages":["en-us"],"req_id":"2591","title":"Applied Researcher","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub Copilot has changed the way software is built, and we have a unique opportunity to look further ahead to identify how software development can be faster, safer, easier, and more accessible. We’re looking for talented and passionate applied scientists to join us in this mission! Our team, GitHub Copilot Applied Science, has a crucial role in advancing the core intelligence solutions within Copilot. Our responsibilities encompass various areas such as LLM fine-tuning generation, prompt engineering, and the development of end-to-end AI features using cutting-edge technologies. In this role, you will collaborate closely with a diverse and highly skilled group of researchers, scientists, and software engineers within our team, while partnering with multiple teams across Github and Microsoft. Together, we are dedicated to shaping the future of software development by continuously enhancing AI-powered capabilities in Copilot. Responsibilities Drive research initiatives for online metrics development to continuously assess and improve the real-time performance of Copilot products Develop and implement methodologies for offline quality measurement, ensuring robust evaluation of large language model outputs in diverse scenarios. Lead the development of tools for automating quality analysis, streamlining the assessment process, and enhancing the efficiency of large-scale model evaluations. Integrate Responsible AI principles into the development lifecycle of Copilot products. Design and execute experiments to evaluate the impact of model changes, ensuring continuous refinement and advancement. Hands-on engagement with model training activities to elevate the performance of the Copilot product. Qualifications Required Qualifications: Bachelor's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 2+ years related experience (e.g., statistics, predictive analytics, research) OR Master's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 1+ year(s) related experience (e.g., statistics, predictive analytics, research) OR Doctorate in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field OR equivalent experience 1+ years experience in applied science, machine learning, deep learning, natural language processing or large-scale data mining. Strong programming skills in languages such as Python, and experience with relevant libraries and frameworks Preferred Qualifications: These are more specific abilities we’re looking for . Think of this as a descriptive sketch, not a checklist of requirements. Be comfortable applying even if you don’t have all of them. Ph.D in computer science, machine learning, or a related field. Experience working with LLM and OpenAI models. Understanding of Responsible AI principles and their application in AI product development. Have significant experience with large-scale data analysis and experimentation Expertise in developing tools for automation and familiarity with quality analysis frameworks. Excellent analytical and problem-solving skills with a keen attention to detail Excellent written and verbal communication skills Compensation Range USD $75,000.00 - USD $115,100.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications: Bachelor's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 2+ years related experience (e.g., statistics, predictive analytics, research) OR Master's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 1+ year(s) related experience (e.g., statistics, predictive analytics, research) OR Doctorate in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field OR equivalent experience 1+ years experience in applied science, machine learning, deep learning, natural language processing or large-scale data mining. Strong programming skills in languages such as Python, and experience with relevant libraries and frameworks Preferred Qualifications: These are more specific abilities we’re looking for . Think of this as a descriptive sketch, not a checklist of requirements. Be comfortable applying even if you don’t have all of them. Ph.D in computer science, machine learning, or a related field. Experience working with LLM and OpenAI models. Understanding of Responsible AI principles and their application in AI product development. Have significant experience with large-scale data analysis and experimentation Expertise in developing tools for automation and familiarity with quality analysis frameworks. Excellent analytical and problem-solving skills with a keen attention to detail Excellent written and verbal communication skills","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Drive research initiatives for online metrics development to continuously assess and improve the real-time performance of Copilot products Develop and implement methodologies for offline quality measurement, ensuring robust evaluation of large language model outputs in diverse scenarios. Lead the development of tools for automating quality analysis, streamlining the assessment process, and enhancing the efficiency of large-scale model evaluations. Integrate Responsible AI principles into the development lifecycle of Copilot products. Design and execute experiments to evaluate the impact of model changes, ensuring continuous refinement and advancement. Hands-on engagement with model training activities to elevate the performance of the Copilot product.","posted_date":"December 28, 2023","apply_url":"https://careers-githubinc.icims.com/jobs/2591/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-01-29T14:53:08Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-12-28T19:59:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":5,"uuid":"468dd028-3d83-4309-b10a-3d41be2c2cb8"},"import_id":"9862d529-15a4-4a9a-ab8c-b34d8771a918","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/78255968766304966","jobHash":"6c5ac57e814904744377e6eca63d2249","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":7.17042852578733e-05}]},"jobSummary":"Drive research initiatives for online metrics development to continuously assess and improve the real-time performance of Copilot products Develop and implement methodologies for offline quality measurement, ensuring robust evaluation of large language model outputs in diverse scenarios. Lead the development of tools for automating quality analysis, streamlining the assessment process, and enhancing the efficiency of large-scale model evaluations. Integrate Responsible AI principles into the development lifecycle of Copilot products. Design and execute experiments to evaluate the impact of model changes, ensuring continuous refinement and advancement. Hands-on engagement with model training activities to elevate the performance of the Copilot product.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2591?lang=en-us","last_mod":"2024-01-29T14:53:25+0000","gdpr":false},"update_date":"2024-01-29T14:53:25+0000","create_date":"2023-12-28T20:00:39+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}}],"totalCount":40,"count":40,"filter":{"displayLimit":10,"categories":{"all":[{"category":"Engineering","numJobs":40}],"shortlist":[{"category":"Engineering","numJobs":40}]},"brands":{"all":[],"shortlist":[]},"experienceLevels":{"all":[],"shortlist":[]},"locations":{"all":[{"city":"San Francisco","state":"California","country":"United States","count":1},{"city":"Remote","state":null,"country":"Germany","count":1},{"city":"Remote","state":null,"country":"Spain","count":1},{"city":"Remote","state":null,"country":"United Kingdom","count":8},{"city":"Remote","state":null,"country":"United States","count":29}],"shortlist":[{"city":"San Francisco","state":"California","country":"United States","count":1},{"city":"Remote","state":null,"country":"Germany","count":1},{"city":"Remote","state":null,"country":"Spain","count":1},{"city":"Remote","state":null,"country":"United Kingdom","count":8},{"city":"Remote","state":null,"country":"United States","count":29}]},"facetList":{"tags4":[{"term":"Experienced Professional","count":40}],"tags5":[{"term":"Individual Contributor","count":32},{"term":"Director","count":5},{"term":"Senior Director","count":2},{"term":"Senior Manager","count":1}],"tags6":[{"term":"Yes","count":40}]}},"languageCounts":{"en-us":{"displayName":"English","count":40}},"request_id":false,"locations":[]}