{"jobs":[{"data":{"slug":"4450","language":"en-us","languages":["en-us"],"req_id":"4450","title":"Principal Software Engineer, Copilot Platform","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is looking for a Principal Software Engineer to join its growing Engineering team. This leadership role involves leading system architecture design, coaching engineering teams, and delivering impactful technical solutions. The ideal candidate will have deep expertise in scalable systems and performance engineering, including tuning and optimizing high-throughput services in production environments. They thrive in cross-functional environments and bring creative, pragmatic solutions to complex engineering challenges. As a Principal Software Engineer on the GitHub Copilot Platform, you will collaborate with a distributed, diverse, and passionate team of engineers and product managers across GitHub and other partners. The GitHub Copilot Platform is crucial for ensuring the quality, scale, and global expansion of Copilot features, maintaining its industry-leading status, and empowering other GitHub engineering teams with seamless integration. You will lead through personal contributions and by coaching others, as well as guiding technical strategy, architectural decisions, and performance optimization across teams. Our goal is to continuously enhance AI-powered capabilities within GitHub and beyond, improving and maintaining the platform that integrators depend on in their development cycles. We operate in a culture that values developer empathy, transparency, and inclusive collaboration, where curiosity and impact drive everything we build. Responsibilities Lead and influence system architecture design for complex products and solutions, ensuring they meet security, compliance, and performance requirements. Establish and mentor best practices for testing, performance tuning, and code quality, defining success metrics and ensuring maintainability across dependencies. Provide technical leadership during code reviews to ensure reliability, scalability, and alignment with product goals. Partner with product managers and technical leads to define service requirements and incorporate feedback into future designs. Act as an expert in debugging tools and methods, leading proactive and reactive development to resolve issues across teams. Optimize deployments and runtime performance to meet business objectives, ensuring safe rollouts aligned with GitHub’s standards. Drive improvements in development quality and team performance through tooling, automation, and knowledge sharing. Lead product refinement through telemetry analysis, performance metrics, and experimentation frameworks to inform engineering decisions. Develop strategies to identify and mitigate technical risks, including frameworks for risk assessment and contingency planning. Shape the strategic vision for technology and product development, identifying opportunities for innovation and leading initiatives aligned with GitHub’s long-term goals. Qualifications Required Qualifications: 11+ years' experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 10+ years' experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR Bachelor's Degree in Computer Science or related field AND 9+ years' experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 7+ years' experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years' experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR equivalent experience. Experience contributing technical solutions to high throughput services in production environments, such as systems profiling tools and distributed systems performance tuning. Preferred Qualifications: Proven experience designing and operating high-throughput cloud-native distributed systems in production environments. Deep understanding of performance profiling, observability, and telemetry-driven optimization, especially in Go or similar languages Experience integrating machine learning or generative AI capabilities into production systems. Experience driving cross-functional projects in close partnership with product management, design, and engineering teams. Strong communication and leadership skills, with a track record of mentoring senior engineers and influencing engineering culture. Compensation Range The base salary range for this job is USD $145,600.00 - USD $386,400.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"tags7":["US Careers (External)"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 11+ years' experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 10+ years' experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR Bachelor's Degree in Computer Science or related field AND 9+ years' experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 7+ years' experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years' experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR equivalent experience. Experience contributing technical solutions to high throughput services in production environments, such as systems profiling tools and distributed systems performance tuning. Preferred Qualifications: Proven experience designing and operating high-throughput cloud-native distributed systems in production environments. Deep understanding of performance profiling, observability, and telemetry-driven optimization, especially in Go or similar languages Experience integrating machine learning or generative AI capabilities into production systems. Experience driving cross-functional projects in close partnership with product management, design, and engineering teams. Strong communication and leadership skills, with a track record of mentoring senior engineers and influencing engineering culture.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Lead and influence system architecture design for complex products and solutions, ensuring they meet security, compliance, and performance requirements. Establish and mentor best practices for testing, performance tuning, and code quality, defining success metrics and ensuring maintainability across dependencies. Provide technical leadership during code reviews to ensure reliability, scalability, and alignment with product goals. Partner with product managers and technical leads to define service requirements and incorporate feedback into future designs. Act as an expert in debugging tools and methods, leading proactive and reactive development to resolve issues across teams. Optimize deployments and runtime performance to meet business objectives, ensuring safe rollouts aligned with GitHub’s standards. Drive improvements in development quality and team performance through tooling, automation, and knowledge sharing. Lead product refinement through telemetry analysis, performance metrics, and experimentation frameworks to inform engineering decisions. Develop strategies to identify and mitigate technical risks, including frameworks for risk assessment and contingency planning. Shape the strategic vision for technology and product development, identifying opportunities for innovation and leading initiatives aligned with GitHub’s long-term goals.","posted_date":"2025-09-03T15:29:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/4450/login","internal":false,"external":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/140910098078671558","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"9e0e8010c854f1cfb72c8ebf3d7e835d","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"Lead and influence system architecture design for complex products and solutions, ensuring they meet security, compliance, and performance requirements. Establish and mentor best practices for testing, performance tuning, and code quality, defining success metrics and ensuring maintainability across dependencies. Provide technical leadership during code reviews to ensure reliability, scalability, and alignment with product goals. Partner with product managers and technical leads to define service requirements and incorporate feedback into future designs. Act as an expert in debugging tools and methods, leading proactive and reactive development to resolve issues across teams. Optimize deployments and runtime performance to meet business objectives, ensuring safe rollouts aligned with GitHub’s standards. Drive improvements in development quality and team performance through tooling, automation, and knowledge sharing. Lead product refinement through telemetry analysis, performance metrics, and experimentation frameworks to inform engineering decisions. Develop strategies to identify and mitigate technical risks, including frameworks for risk assessment and contingency planning. Shape the strategic vision for technology and product development, identifying opportunities for innovation and leading initiatives aligned with GitHub’s long-term goals.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2025-09-03T15:46:48Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2025-09-03T15:29:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9"},"revision_int":2,"uuid":"c84e57d0-1432-4c5a-8aba-cb5b249b89eb"},"import_id":"6f0d1690-06eb-4312-ab3f-8082b7a179a8","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/4450?lang=en-us","last_mod":"2025-09-03T15:47:46+0000","gdpr":false},"update_date":"2025-09-03T15:47:46+0000","create_date":"2025-09-03T15:29:47+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"4468","language":"en-us","languages":["en-us"],"req_id":"4468","title":"Software Engineer III, Codespaces \u0026 Actions","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, Germany Overview We’re building the future of cloud development with Codespaces: instant-on, container-based cloud environments tailored to specific projects, enabling developers to focus on writing code rather than managing setups. As a Software Engineer III on the Codespaces team, you’ll design and implement a secure, reliable, and efficient platform that powers Codespaces, Actions and other GitHub tools. Your work will directly impact developers worldwide, ensuring these tools are always available, performant, cost-effective, and delightful to use. At GitHub, you’ll collaborate with a distributed, diverse, and passionate team of engineers and designers, delivering services that millions of developers depend on daily. In this role, you’ll design, prototype, implement, ship, and support highly performant, inspiring experiences that enhance collaboration and productivity for developers everywhere. We’re looking for creative problem solvers and diverse thinkers who value culture as much as customers and features. We believe how we work is just as important as what we deliver. Big vision, shared purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what drive great results. Great products reflect the teams that build them—come join us! Responsibilities Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary. Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code. Qualifications Required Qualifications: 4+ years of experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field OR equivalent experience. Experience in cloud-native development, including designing, building, and deploying scalable applications using microservices architecture, containers (e.g., Docker), and orchestration tools like Kubernetes. Proficiency in leveraging cloud platforms (e.g., AWS, Azure, or GCP) for optimizing application performance and scalability. Experience with on-call rotations, incident response and site reliability, including diagnosing and resolving complex production issues under pressure. Experience automating operational work for hosted services Preferred Qualifications: Proficiency in modern programming languages such as C#, TypeScript, Go, and Rust. Excellent written and verbal communication via async collaboration, documentation, and visibility of work. Experience working with a remote, distributed team. Passionate about fostering effective Engineering practices and processes. Proficiency in Git and GitHub for version control and collaborative development and branching strategies. Experience with CI/CD Tools: Strong knowledge of CI/CD concepts and best practices. Experience with GitHub actions and workflows platform, familiar with other tools like Jenkins Experience implementing and maintaining compliance and security practices in software development, including secure coding, vulnerability management, data privacy, and regulatory standards (e.g., GDPR, SOC 2, HIPAA). Proficiency in designing systems with robust security measures and ensuring adherence to organizational and industry compliance requirements. Contribute to open source software, engage with maintainers, and actively participate in community curation. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. Equal Employment Opportunity GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"Germany Remote","country":"Germany","country_code":"DE","location_type":"ANY","latitude":51.165691,"longitude":10.451526,"categories":[{"name":"Engineering"}],"tags2":["DE-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"tags7":["Global Careers (External)"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 4+ years of experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field OR equivalent experience. Experience in cloud-native development, including designing, building, and deploying scalable applications using microservices architecture, containers (e.g., Docker), and orchestration tools like Kubernetes. Proficiency in leveraging cloud platforms (e.g., AWS, Azure, or GCP) for optimizing application performance and scalability. Experience with on-call rotations, incident response and site reliability, including diagnosing and resolving complex production issues under pressure. Experience automating operational work for hosted services Preferred Qualifications: Proficiency in modern programming languages such as C#, TypeScript, Go, and Rust. Excellent written and verbal communication via async collaboration, documentation, and visibility of work. Experience working with a remote, distributed team. Passionate about fostering effective Engineering practices and processes. Proficiency in Git and GitHub for version control and collaborative development and branching strategies. Experience with CI/CD Tools: Strong knowledge of CI/CD concepts and best practices. Experience with GitHub actions and workflows platform, familiar with other tools like Jenkins Experience implementing and maintaining compliance and security practices in software development, including secure coding, vulnerability management, data privacy, and regulatory standards (e.g., GDPR, SOC 2, HIPAA). Proficiency in designing systems with robust security measures and ensuring adherence to organizational and industry compliance requirements. Contribute to open source software, engage with maintainers, and actively participate in community curation.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary. Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","posted_date":"2025-08-26T18:57:00+0000","apply_url":"https://globalcareers-githubinc.icims.com/jobs/4468/login","internal":false,"external":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/87977037779608262","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"ae9faeb9e1291b9788e237fc50796a4c","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":51.165691,"longitude":10.451526},"locationType":"COUNTRY","postalAddress":{"addressLines":["Germany"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"DE","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.21074204644792707}]},"jobSummary":"Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary. Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2025-08-29T14:31:18Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2025-08-26T18:57:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":3,"uuid":"66e581be-b92d-407a-ac0f-3c225605a0f9"},"import_id":"35fa8139-6d31-436d-a3c5-888b489f14f8","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/4468?lang=en-us","last_mod":"2025-08-29T14:31:47+0000","gdpr":true},"update_date":"2025-08-29T14:31:47+0000","create_date":"2025-08-26T18:58:47+0000","category":[" Engineering"],"full_location":"Germany","short_location":"Germany","multipleLocations":false}},{"data":{"slug":"4425","language":"en-us","languages":["en-us"],"req_id":"4425","title":"Senior Software Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is growing its Engineering team and we're seeking experienced professionals to elevate our Physical Infrastructure efforts. As a Senior Software Engineer, you will design, build, and enhance physical infrastructure frameworks and tools, ensuring scalable and efficient data centers. The ideal candidate will be a key contributor to enhancing GitHub’s physical infrastructure, ensuring scalability and efficiency while gaining valuable experience in data center architecture, hardware innovation, and cross-functional collaboration to support developers globally. As an Infrastructure Engineer, you will report into GitHub's larger Platform organization. Platform is a distributed group that owns internal services, tools, and infrastructure used to build, deploy, and operate the services that make up GitHub. Built in our own data centers with a variety of open source software, our services are used by dozens of engineering teams across the company. We strive to act as a productivity multiplier by offering our customers the tools they need to deliver their services, allowing them to focus more on product. Responsibilities Design, build, and enhance physical infrastructure systems, frameworks, and tools to manage and maintain data centers, ensuring systems are scalable and efficient while automating processes to improve performance. Lead capacity planning and design initiatives, predict growth trends, and ensure infrastructure is properly scaled to handle increasing demands. Implement and maintain robust security measures, conduct vulnerability assessments, and ensure compliance with relevant regulatory standards, focusing on the unique requirements of physical infrastructure. Establish observability and monitoring systems to proactively identify and address performance gaps or outages and execute disaster recovery and failure test scenarios specific to physical infrastructure. Act as a senior point of contact for diagnosing and resolving infrastructure issues promptly to minimize downtime, contribute to incident management processes, and implement preventive measures to avoid future incidents. Collaborate with cross-functional teams, including software engineers and data center vendors, to troubleshoot issues, optimize infrastructure performance, and identify opportunities for new features and improvements in the space. Lead initiatives within the open-source community to enhance existing tools, develop new features, and share best practices, with a focus on physical infrastructure technologies. Lead the design and integration of physical hardware at the rack/chassis level, ensuring compatibility and efficiency in data center deployments Participate in an on-call rotation and quickly respond to issues and work to prevent them in the future Qualifications Required Qualifications: 6+ years’ technical experience in one or more infrastructure domains (e.g., container orchestration engineering, platform engineering, database engineering, software engineering, network engineering, systems administration, or related field), OR bachelor's degree in Computer Science, Information Technology, or related field AND 4+ years’ technical experience in infrastructure domains (e.g., container orchestration engineering, platform engineering, database engineering, software engineering, network engineering, systems administration, or related field), OR equivalent experience. 3+ years' experience with physical hardware design at the rack/chassis level in the context of datacenter deployments. 2+ years' experience deploying infrastructure in a data center. Preferred Qualifications: 1+ year(s) technical leadership experience 3+ years' experience in one or more scripting languages (e.g., Bash, Python, or a similar language) 3+ years' experience using general purpose programming languages (e.g., Go, Ruby, or a similar language) Extensive experience in designing and deploying physical infrastructure in data centers, and proficiency in scripting languages like Bash or Python Compensation Range The base salary range for this job is USD $112,800.00 - USD $299,300.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"tags7":["US Careers (External)"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 6+ years’ technical experience in one or more infrastructure domains (e.g., container orchestration engineering, platform engineering, database engineering, software engineering, network engineering, systems administration, or related field), OR bachelor's degree in Computer Science, Information Technology, or related field AND 4+ years’ technical experience in infrastructure domains (e.g., container orchestration engineering, platform engineering, database engineering, software engineering, network engineering, systems administration, or related field), OR equivalent experience. 3+ years' experience with physical hardware design at the rack/chassis level in the context of datacenter deployments. 2+ years' experience deploying infrastructure in a data center. Preferred Qualifications: 1+ year(s) technical leadership experience 3+ years' experience in one or more scripting languages (e.g., Bash, Python, or a similar language) 3+ years' experience using general purpose programming languages (e.g., Go, Ruby, or a similar language) Extensive experience in designing and deploying physical infrastructure in data centers, and proficiency in scripting languages like Bash or Python","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Design, build, and enhance physical infrastructure systems, frameworks, and tools to manage and maintain data centers, ensuring systems are scalable and efficient while automating processes to improve performance. Lead capacity planning and design initiatives, predict growth trends, and ensure infrastructure is properly scaled to handle increasing demands. Implement and maintain robust security measures, conduct vulnerability assessments, and ensure compliance with relevant regulatory standards, focusing on the unique requirements of physical infrastructure. Establish observability and monitoring systems to proactively identify and address performance gaps or outages and execute disaster recovery and failure test scenarios specific to physical infrastructure. Act as a senior point of contact for diagnosing and resolving infrastructure issues promptly to minimize downtime, contribute to incident management processes, and implement preventive measures to avoid future incidents. Collaborate with cross-functional teams, including software engineers and data center vendors, to troubleshoot issues, optimize infrastructure performance, and identify opportunities for new features and improvements in the space. Lead initiatives within the open-source community to enhance existing tools, develop new features, and share best practices, with a focus on physical infrastructure technologies. Lead the design and integration of physical hardware at the rack/chassis level, ensuring compatibility and efficiency in data center deployments Participate in an on-call rotation and quickly respond to issues and work to prevent them in the future","posted_date":"2025-08-29T20:11:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/4425/login","internal":false,"external":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/94767333829944006","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"1ca20040cb190f4d7637c63200cea54e","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"Design, build, and enhance physical infrastructure systems, frameworks, and tools to manage and maintain data centers, ensuring systems are scalable and efficient while automating processes to improve performance. Lead capacity planning and design initiatives, predict growth trends, and ensure infrastructure is properly scaled to handle increasing demands. Implement and maintain robust security measures, conduct vulnerability assessments, and ensure compliance with relevant regulatory standards, focusing on the unique requirements of physical infrastructure. Establish observability and monitoring systems to proactively identify and address performance gaps or outages and execute disaster recovery and failure test scenarios specific to physical infrastructure. Act as a senior point of contact for diagnosing and resolving infrastructure issues promptly to minimize downtime, contribute to incident management processes, and implement preventive measures to avoid future incidents. Collaborate with cross-functional teams, including software engineers and data center vendors, to troubleshoot issues, optimize infrastructure performance, and identify opportunities for new features and improvements in the space. Lead initiatives within the open-source community to enhance existing tools, develop new features, and share best practices, with a focus on physical infrastructure technologies. Lead the design and integration of physical hardware at the rack/chassis level, ensuring compatibility and efficiency in data center deployments Participate in an on-call rotation and quickly respond to issues and work to prevent them in the future","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2025-09-02T18:11:47Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2025-08-29T20:11:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9"},"revision_int":2,"uuid":"f47ca290-c205-4f1f-824d-e948d6780793"},"import_id":"64b1491b-7cda-440b-a5d1-17b0746b3c46","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/4425?lang=en-us","last_mod":"2025-09-02T18:12:46+0000","gdpr":false},"update_date":"2025-09-02T18:12:46+0000","create_date":"2025-08-29T20:11:47+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"4448","language":"en-us","languages":["en-us"],"req_id":"4448","title":"Senior Director, Software Engineering, Copilot Platform","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is looking for a Senior Director of Engineering to lead the development of the GitHub Copilot AI inference platform. This role involves overseeing the allocation and deployment of GitHub's AI resources, managing high-throughput service infrastructure for inference workloads, and improving the experiment-to-production pipeline. This includes operating orchestration frameworks that support generative AI workloads at scale. The ideal candidate will possess a strategic vision, technical leadership in distributed systems and generative AI serving architectures, as well as the ability to mentor senior engineering leaders, build empowered high-trust teams, and foster a culture of technical excellence and experimentation. The AI infrastructure at GitHub is crucial for the future of software development. As Senior Director of Engineering, you will lead four service-owning teams responsible for this foundation, ensuring efficient, secure, and business-aligned resource deployment. You will work with a team of architects to guide the platform's evolution through deep technical leadership and organizational stewardship, collaborating with product, infrastructure, and research teams across GitHub and Microsoft to scale, optimize, and safeguard platform integrity. This is a unique opportunity to shape the systems powering Copilot and other AI-driven experiences globally. We foster a culture that prioritizes developer empathy, transparency, and inclusive collaboration, where curiosity and impact drive our development efforts. Responsibilities Lead strategic alignment across teams to define and evolve the architecture of GitHub’s GPU infrastructure and AI serving platform. Oversee capacity planning, dynamic traffic shaping, and abuse mitigation systems to ensure performance, reliability, and compliance. Guide teams in designing scalable, secure, and observable systems that meet business and technical requirements. Champion experimentation and telemetry-driven development, enabling rapid iteration and data-informed decisions. Drive engineering excellence through automation, tooling, and standardization across deployment, testing, and operations. Foster cross-functional collaboration with product, design, and engineering leadership to align technical strategy with business goals. Mentor senior engineering leaders and cultivate a high-trust, high-performance culture across distributed teams. Own incident response and reliability practices, ensuring live services meet SLOs and postmortems drive systemic improvements. Work with architects to shape GitHub’s long-term vision for AI infrastructure, identifying opportunities for innovation and leading initiatives that scale globally. Qualifications Required/Minimum Qualifications 11+ years' experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 10+ years' experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR Bachelor's Degree in Computer Science or related field AND 9+ years' experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 7+ years' experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years' experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR equivalent experience. 5+ years people management experience. Preferred Qualifications Deep understanding of distributed systems performance, including autoscaling, load balancing, and traffic shaping for inference workloads. Proven track record of building and scaling engineering organizations in high-growth or ambiguous environments. Experience collaborating across product, design, and engineering to align technical strategy with business outcomes. Compensation Range The base salary range for this job is USD $145,600.00 - USD $386,400.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Senior Director"],"tags6":["Yes"],"tags7":["US Careers (External)"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required/Minimum Qualifications 11+ years' experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 10+ years' experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR Bachelor's Degree in Computer Science or related field AND 9+ years' experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 7+ years' experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years' experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python, OR equivalent experience. 5+ years people management experience. Preferred Qualifications Deep understanding of distributed systems performance, including autoscaling, load balancing, and traffic shaping for inference workloads. Proven track record of building and scaling engineering organizations in high-growth or ambiguous environments. Experience collaborating across product, design, and engineering to align technical strategy with business outcomes.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Lead strategic alignment across teams to define and evolve the architecture of GitHub’s GPU infrastructure and AI serving platform. Oversee capacity planning, dynamic traffic shaping, and abuse mitigation systems to ensure performance, reliability, and compliance. Guide teams in designing scalable, secure, and observable systems that meet business and technical requirements. Champion experimentation and telemetry-driven development, enabling rapid iteration and data-informed decisions. Drive engineering excellence through automation, tooling, and standardization across deployment, testing, and operations. Foster cross-functional collaboration with product, design, and engineering leadership to align technical strategy with business goals. Mentor senior engineering leaders and cultivate a high-trust, high-performance culture across distributed teams. Own incident response and reliability practices, ensuring live services meet SLOs and postmortems drive systemic improvements. Work with architects to shape GitHub’s long-term vision for AI infrastructure, identifying opportunities for innovation and leading initiatives that scale globally.","posted_date":"2025-09-03T17:15:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/4448/login","internal":false,"external":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/121723645943784134","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"8f1d1ed0e4fb1421e857348f7ccb32e1","derivedInfo":{"jobCategories":["COMPUTER_AND_IT","MANAGEMENT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"Lead strategic alignment across teams to define and evolve the architecture of GitHub’s GPU infrastructure and AI serving platform. Oversee capacity planning, dynamic traffic shaping, and abuse mitigation systems to ensure performance, reliability, and compliance. Guide teams in designing scalable, secure, and observable systems that meet business and technical requirements. Champion experimentation and telemetry-driven development, enabling rapid iteration and data-informed decisions. Drive engineering excellence through automation, tooling, and standardization across deployment, testing, and operations. Foster cross-functional collaboration with product, design, and engineering leadership to align technical strategy with business goals. Mentor senior engineering leaders and cultivate a high-trust, high-performance culture across distributed teams. Own incident response and reliability practices, ensuring live services meet SLOs and postmortems drive systemic improvements. Work with architects to shape GitHub’s long-term vision for AI infrastructure, identifying opportunities for innovation and leading initiatives that scale globally.","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":null,"date_updated":"2025-09-05T13:35:28Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2025-09-03T17:15:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9"},"revision_int":2,"uuid":"660b9d17-0703-4005-8ab1-d0e72902b105"},"import_id":"5c750663-0078-47e8-a4ca-f4bd637365af","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/4448?lang=en-us","last_mod":"2025-09-05T13:35:46+0000","gdpr":false},"update_date":"2025-09-05T13:35:46+0000","create_date":"2025-09-03T17:15:47+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"4409","language":"en-us","languages":["en-us"],"req_id":"4409","title":"Software Engineer III, Runtime Platform","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is changing the way the world builds software, and we want you to help. At GitHub, we constantly strive to create an environment that allows our employees to do the best work of their lives. GitHub is looking for a talented Software Engineer III to join our Platform Team in the Development Experience department. Our team is working on multiple products all aimed to enable GitHub’s engineers to deliver value in a faster and secure way. We work on the entire delivery stack from chatops infra to PR linting and up to the actual deployments of Github’s services both to kubernetes and virtual machine environments. On this team, you’ll collaborate across functions and across teams to deliver the best possible developer experience for all engineers here at GitHub. In this role, you will be having the opportunity to work as an engineer with a globally distributed, diverse and passionate team where you will be expected to demonstrate independence and a drive to deliver. You will design, implement, rollout and support a highly performant, highly scalable and highly available host of services alongside a team of fellow software engineering professionals. This team and its parent Development Experience department are highly distributed across the globe and span a variety of diverse backgrounds. We recognize the value this diversity brings to our teams and our products, so creating and maintaining an environment where every individual feels safe to bring their unique perspective to the challenges we're solving is important to us. Responsibilities Demonstrate a strong commitment to high quality software development practices Actively design, develop, document and maintain our deployment infrastructure services with a product mindset Provide compassionate technical mentorship, pairing opportunities, and code reviews to encourage professional and technical growth of those around you Build tools and systems that empathetically and pragmatically meet real operability needs of GitHub developers Develop and maintain scalable infrastructure Use data to understand the availability, reliability, and sustainability of our infrastructure Work closely with other teams from around the organization Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary Qualifications Required Qualifications: 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field OR equivalent experience 2+ years experience with running, operating, and maintaining production systems 2+ years experience designing, building and running large scale and highly available cloud services or distributed systems Preferred Qualifications: Solid understanding of testing principles and high quality software Experience with Kubernetes or other container orchestration systems Experience building infrastructure automation Experience working with the Linux operating system Experience running, monitoring and troubleshooting issues in a production always-on service Excellent analytical skills and communication skills. Fluent in English both verbal and written. We are a global cross-countries team so we’re extra mindful about communication. Compensation Range The base salary range for this job is USD $97,900.00 - USD $259,900.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"tags7":["US Careers (External)"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 4+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience OR Bachelor's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 2+ years experience in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field OR equivalent experience 2+ years experience with running, operating, and maintaining production systems 2+ years experience designing, building and running large scale and highly available cloud services or distributed systems Preferred Qualifications: Solid understanding of testing principles and high quality software Experience with Kubernetes or other container orchestration systems Experience building infrastructure automation Experience working with the Linux operating system Experience running, monitoring and troubleshooting issues in a production always-on service Excellent analytical skills and communication skills. Fluent in English both verbal and written. We are a global cross-countries team so we’re extra mindful about communication.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Demonstrate a strong commitment to high quality software development practices Actively design, develop, document and maintain our deployment infrastructure services with a product mindset Provide compassionate technical mentorship, pairing opportunities, and code reviews to encourage professional and technical growth of those around you Build tools and systems that empathetically and pragmatically meet real operability needs of GitHub developers Develop and maintain scalable infrastructure Use data to understand the availability, reliability, and sustainability of our infrastructure Work closely with other teams from around the organization Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary","posted_date":"2025-08-13T19:25:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/4409/login","internal":false,"external":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","googlejobs":{"jobName":"projects/helpful-passage-853/jobs/121606789547336390","companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobHash":"7c65421cd42b1a0b4301f7ad75417c75","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"Demonstrate a strong commitment to high quality software development practices Actively design, develop, document and maintain our deployment infrastructure services with a product mindset Provide compassionate technical mentorship, pairing opportunities, and code reviews to encourage professional and technical growth of those around you Build tools and systems that empathetically and pragmatically meet real operability needs of GitHub developers Develop and maintain scalable infrastructure Use data to understand the availability, reliability, and sustainability of our infrastructure Work closely with other teams from around the organization Own and advocate for the health and quality of the systems that the team builds, including participating in on-call rotations and responding to incidents as necessary","jobTitleSnippet":"","searchTextSnippet":""},"icims":{"config_keys":{"ccc.attract.portal.url":"https://www.github.careers","icims.config.web.indeed.easy.apply":"0","icims.external.xml.feeds":"icims.indeed.xml.enabled,icims.resume-library.xml.enabled,icims.direct-employers.xml.enabled,icims.monster.xml.enabled,icims.adzuna.xml.enabled,icims.careerbuilder.xml.enabled,icims.ziprecruiter.xml.enabled,icims.craigslist.xml.enabled,icims.itjobscafe.xml.enabled,icims.recruitnet.xml.enabled,icims.upward.xml.enabled,icims.jobbio.xml.enabled,icims.propellum.xml.enabled,icims.snagajob.xml.enabled,icims.inhersight.xml.enabled,icims.pallet-labs.xml.enabled,icims.qkly.xml.enabled,icims.cv-library.xml.enabled,icims.linkedin.xml.enabled,icims.zippia.xml.enabled,icims.puck.xml.enabled,icims.offerup.xml.enabled,icims.jobted.xml.enabled,icims.edtech.xml.enabled,icims.jobgether.xml.enabled,icims.referio.xml.enabled,icims.careerjet.xml.enabled,icims.advantageai.xml.enabled,icims.unpostedjobs.xml.enabled,icims.allyenergy.xml.enabled,icims.stealthstartup.xml.enabled,icims.hiringcafe.xml.enabled,icims.retailappointment.xml.enabled,icims.jobget.xml.enabled,icims.hirebase.xml.enabled,icims.shaker.xml.enabled,icims.tariangroup.xml.enabled,icims.flatworld.xml.enabled,icims.nexxt.xml.enabled,icims.intelycare.xml.enabled,icims.calibersourcing.xml.enabled,icims.almazlabs.xml.enabled,icims.dentalpost.xml.enabled,icims.nejoflexco.xml.enabled,icims.skillsire.xml.enabled","jobposting.external.company.name":"GitHub, Inc.","portal.id":"17"},"date_updated":"2025-08-13T19:25:20Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2025-08-13T19:25:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9","siteType":"ATTRACT","tenantId":"13865"},"revision_int":1,"uuid":"e5d7b708-2be7-4e2a-9748-06c99fc139f9"},"import_id":"9306d2fc-fe25-4cc4-b959-f0ea1bf17b13","import_source":"ImporterService","redirectOnApply":true,"canonical_url":"https://githubinc.jibeapply.com/jobs/4409?lang=en-us","last_mod":"2025-08-15T12:26:48+0000","gdpr":false},"update_date":"2025-08-15T12:26:48+0000","create_date":"2025-08-13T19:26:09+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}},{"data":{"slug":"4417","language":"en-us","languages":["en-us"],"req_id":"4417","title":"Staff Software Engineer, Compute Platform","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States | Remote, United States Overview GitHub is looking for a Staff Software Engineer to join the Compute Platform team within our Developer Experience organization. You will focus on the systems and tools that enable our engineers to operate and scale the world's largest code hosting platform. You will plan, deploy, and maintain our Kubernetes clusters with a focus on making the Developer Experience the best it can be for our engineering and infrastructure teams. The Developer Experience team is highly distributed and you will thrive in an environment of remote work and asynchronous communication. You're expected to have strong written communication skills and be able to develop working relationships with coworkers in locations around the globe. As an engineer at GitHub you'll always be challenged to solve interesting and novel problems that have real impact on how the world builds software. Responsibilities Build and improve the frameworks and tools we use to build, test, configure our Kubernetes clusters. Ensure a reliable Kubernetes platform across bare-metal, virtual machines, and cloud environments. Cultivate open source projects developed by GitHub and build things you are proud to share. Work closely with other engineering and infrastructure teams to design solutions and support Kubernetes workloads. Qualifications Required Qualifications: 9+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 8+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science or related field AND 7+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR equivalent experience. 2+ years technical leadership experience. 9+ years of technical engineering experience in infrastructure domains 4+ years of experience with Kubernetes platform architecture, primitives, and experience with AWS or Azure cloud environments Preferred Qualifications: Experience operating Kubernetes in a high scale, production environment. Specific experience in managing/configuring AKS or EKS environments highly preferred. Competent in one or more scripting languages (e.g., Bash, Python, or a similar language). Knowledge of Hashicorp’s Terraform, Consul, and Vault products Experience with virtualization, bare metal deployment, or network engineering Experience with diagnosing and automating large, complex distributed systems with an eye toward reliability Compensation Range The base salary range for this job is USD $127,600.00 - USD $338,500.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"additional_locations":[{"location_name":"US Remote","country":"United States","country_code":"US","latitude":38.7945952,"longitude":-106.5348379}],"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"tags7":["US Careers (External)"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 9+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Associate’s Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 8+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Bachelor's Degree in Computer Science or related field AND 7+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python OR Master's Degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR Doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years experience in Software Engineering, Computer Science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, Go, Ruby, Rust, or Python. OR equivalent experience. 2+ years technical leadership experience. 9+ years of technical engineering experience in infrastructure domains 4+ years of experience with Kubernetes platform architecture, primitives, and experience with AWS or Azure cloud environments Preferred Qualifications: Experience operating Kubernetes in a high scale, production environment. Specific experience in managing/configuring AKS or EKS environments highly preferred. Competent in one or more scripting languages (e.g., Bash, Python, or a similar language). Knowledge of Hashicorp’s Terraform, Consul, and Vault products Experience with virtualization, bare metal deployment, or network engineering Experience with diagnosing and automating large, complex distributed systems with an eye toward reliability","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Build and improve the frameworks and tools we use to build, test, configure our Kubernetes clusters. Ensure a reliable Kubernetes platform across bare-metal, virtual machines, and cloud environments. Cultivate open source projects developed by GitHub and build things you are proud to share. Work closely with other engineering and infrastructure teams to design solutions and support Kubernetes workloads.","posted_date":"2025-08-29T18:03:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/4417/login","internal":false,"external":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2025-08-29T18:04:00Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2025-08-29T18:03:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9"},"revision_int":1,"uuid":"0c672e4c-13db-494a-9d55-cf084be56095"},"import_id":"e1278182-c93f-49ef-9904-a0aaa2e1ca55","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/jobs/119856952225211078","jobHash":"05136aa644bf40598938fce4333ce165","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546},{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"Build and improve the frameworks and tools we use to build, test, configure our Kubernetes clusters. Ensure a reliable Kubernetes platform across bare-metal, virtual machines, and cloud environments. Cultivate open source projects developed by GitHub and build things you are proud to share. Work closely with other engineering and infrastructure teams to design solutions and support Kubernetes workloads.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/4417?lang=en-us","last_mod":"2025-08-29T18:04:46+0000","gdpr":false},"update_date":"2025-08-29T18:04:46+0000","create_date":"2025-08-29T18:04:46+0000","category":[" Engineering"],"full_location":"United States; United States","short_location":"United States","multipleLocations":true}},{"data":{"slug":"4429","language":"en-us","languages":["en-us"],"req_id":"4429","title":"Staff Software Engineer, Data","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 150+ million developers, including more than 90% of the Fortune 100 companies, use GitHub to collaborate and experiment across 420+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview As a software engineer at GitHub, you will enhance the collaboration experience at GitHub by working closely with a community of engineers and designers with a distributed, diverse and passionate team delivering the services that millions of developers depend on. In this role you will design, prototype, implement, ship and support highly performant and inspiring user experiences with your team. We are looking for creative problem solvers and diverse thinkers, people who care about culture as well as customers and features. We believe that how we do things is as important as what we do. Big vision, a common purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what lead to great results. Great products reflect the teams that build them. Responsibilities Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services and become intimately familiar with the systems you build and take pride in writing maintainable code. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others; support teams in producing extensible and maintainable code, ensuring integration with downstream dependencies and adherence to quality standards. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call for first responder rotations and live incidents. Write architecture briefs and proposals and carry out code experiments. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Collaborate with cross-functional teams and partner with stakeholders and lead discussions for technical solutions, including design and cost considerations. Create and guide others in 1) developing clear testing plans to assure solution quality, reliability, and performance; 2) defining success metrics; and 3) integrating customer feedback for continuous improvement - all while ensuring system architecture meets security and compliance standards. Maintain executional and operational excellence within and potentially across teams/organizations. Apply debugging tools and telemetry to verify assumptions, proactively resolve issues, and optimize code performance and maintainability. Drive and support technical roadmap that aligns with product goals, ensuring that engineering efforts are strategically prioritized and incorporating the adoption of new technologies and methodologies where applicable. Qualifications Required Qualifications: 9+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, Rust, Python, JavaScript, C, C++, C#, Java, OR associate’s degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 8+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, Rust, Python, JavaScript, C, C++, C#, Java, OR bachelor's degree in Computer Science or related field AND 7+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, Rust, Python, JavaScript, C, C++, C#, Java, OR master's degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, Rust, Python, JavaScript, C, C++, C#, Java, OR doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, Rust, Python, JavaScript, C, C++, C#, Java, OR equivalent experience. Preferred Qualifications: Demonstrated experience with large-scale system architecture and design, particularly in cloud-based environments, with a strong understanding of distributed systems and microservices. Experience working closely with product management, design, and other engineering teams to drive cross-functional projects and deliver high-quality products Experience in one or more scripting languages (e.g., Bash, Python, or a similar language) Experience with cloud environments and/or Cloud Native Compute Foundation (CNCF) concepts Experience working with both relational (e.g. mysql) and most importantly non-relational datastores (e.g. Cosmos) Experience working with Azure resource such as Azure Storage (blob and table particularly), Azure Redis Cache, Azure Data Explorer Clusters. Experience operating Cosmos DB clusters at scale. Compensation Range The base salary range for this job is USD $127,600.00 - USD $338,500.00 /Yr. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 150 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":38.7945952,"longitude":-106.5348379,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"tags7":["US Careers (External)"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 9+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, Rust, Python, JavaScript, C, C++, C#, Java, OR associate’s degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 8+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, Rust, Python, JavaScript, C, C++, C#, Java, OR bachelor's degree in Computer Science or related field AND 7+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, Rust, Python, JavaScript, C, C++, C#, Java, OR master's degree in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 5+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, Rust, Python, JavaScript, C, C++, C#, Java, OR doctorate in Computer Science, Electrical Engineering, Electronics Engineering, Math, Physics, Computer Engineering, Computer Science, or related field AND 3+ years' experience in software engineering, computer science, or related technical discipline with proven experience maintaining and delivering production software coding in languages including, but not limited to, Go, Ruby, Rust, Python, JavaScript, C, C++, C#, Java, OR equivalent experience. Preferred Qualifications: Demonstrated experience with large-scale system architecture and design, particularly in cloud-based environments, with a strong understanding of distributed systems and microservices. Experience working closely with product management, design, and other engineering teams to drive cross-functional projects and deliver high-quality products Experience in one or more scripting languages (e.g., Bash, Python, or a similar language) Experience with cloud environments and/or Cloud Native Compute Foundation (CNCF) concepts Experience working with both relational (e.g. mysql) and most importantly non-relational datastores (e.g. Cosmos) Experience working with Azure resource such as Azure Storage (blob and table particularly), Azure Redis Cache, Azure Data Explorer Clusters. Experience operating Cosmos DB clusters at scale.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services and become intimately familiar with the systems you build and take pride in writing maintainable code. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others; support teams in producing extensible and maintainable code, ensuring integration with downstream dependencies and adherence to quality standards. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call for first responder rotations and live incidents. Write architecture briefs and proposals and carry out code experiments. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Collaborate with cross-functional teams and partner with stakeholders and lead discussions for technical solutions, including design and cost considerations. Create and guide others in 1) developing clear testing plans to assure solution quality, reliability, and performance; 2) defining success metrics; and 3) integrating customer feedback for continuous improvement - all while ensuring system architecture meets security and compliance standards. Maintain executional and operational excellence within and potentially across teams/organizations. Apply debugging tools and telemetry to verify assumptions, proactively resolve issues, and optimize code performance and maintainability. Drive and support technical roadmap that aligns with product goals, ensuring that engineering efforts are strategically prioritized and incorporating the adoption of new technologies and methodologies where applicable.","posted_date":"2025-09-04T19:36:00+0000","apply_url":"https://careers-githubinc.icims.com/jobs/4429/login","internal":false,"external":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2025-09-04T23:27:36Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2025-09-04T19:36:00+0000","site":"careers-githubinc","siteId":"7b8b35d9-a49c-4724-a527-04dfa39eb3c9"},"revision_int":1,"uuid":"9fb8b554-5032-4530-9a3f-9de13c2bfa0b"},"import_id":"4bd0ef94-a84d-4a46-9d51-9d3491657cab","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/jobs/104969253399995078","jobHash":"ae7e50d2de4440aadc92a51240781882","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":38.7945952,"longitude":-106.5348379},"locationType":"COUNTRY","postalAddress":{"addressLines":["United States"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":2.6691467883166546}]},"jobSummary":"Design, develop, test and ship high-quality technical solutions that scale across multiple GitHub services and become intimately familiar with the systems you build and take pride in writing maintainable code. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others; support teams in producing extensible and maintainable code, ensuring integration with downstream dependencies and adherence to quality standards. Own and advocate for the health and quality of the systems that the team builds, including participating in on-call for first responder rotations and live incidents. Write architecture briefs and proposals and carry out code experiments. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Collaborate with cross-functional teams and partner with stakeholders and lead discussions for technical solutions, including design and cost considerations. Create and guide others in 1) developing clear testing plans to assure solution quality, reliability, and performance; 2) defining success metrics; and 3) integrating customer feedback for continuous improvement - all while ensuring system architecture meets security and compliance standards. Maintain executional and operational excellence within and potentially across teams/organizations. Apply debugging tools and telemetry to verify assumptions, proactively resolve issues, and optimize code performance and maintainability. Drive and support technical roadmap that aligns with product goals, ensuring that engineering efforts are strategically prioritized and incorporating the adoption of new technologies and methodologies where applicable.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/4429?lang=en-us","last_mod":"2025-09-04T23:27:46+0000","gdpr":false},"update_date":"2025-09-04T23:27:46+0000","create_date":"2025-09-04T23:27:46+0000","category":[" Engineering"],"full_location":"United States","short_location":"United States","multipleLocations":false}}],"locations":[],"totalCount":7,"request_id":false,"count":7,"languageCounts":{"en-us":{"displayName":"English","count":7}},"filter":{"facetList":{"tags4":[{"term":"Experienced Professional","count":7}],"tags5":[{"term":"Individual Contributor","count":6},{"term":"Senior Director","count":1}],"tags6":[{"term":"Yes","count":7}]},"displayLimit":10,"brands":{"all":[],"shortlist":[]},"categories":{"all":[{"category":"Engineering","numJobs":7}],"shortlist":[{"category":"Engineering","numJobs":7}]},"locations":{"all":[{"city":null,"state":null,"country":"Germany","count":1},{"city":null,"state":null,"country":"United States","count":6}],"shortlist":[{"city":null,"state":null,"country":"Germany","count":1},{"city":null,"state":null,"country":"United States","count":6}]},"experienceLevels":{"all":[],"shortlist":[]}}}