{"jobs":[{"data":{"slug":"2543","language":"en-us","languages":["en-us"],"req_id":"2543","title":"Enterprise Advocate","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from San Francisco, California United States Overview GitHub is uniquely positioned to help enterprises and start-ups grow as well as help the world of software development and open source collaboration be better, safer and more welcoming to people of all backgrounds. We are looking for an experienced developer and communicator who is based in the Bay Area of the United States to join our well established and growing global Developer Relations team working closely with product, engineering, marketing and sales leaders across the company. What does Developer Relations at GitHub do? Whether the person is brand new to coding, a maker, a hobbyist, someone working on a personal project, someone contributing to open source, a team launching their first startup or someone working as part of a group in a large enterprise - they are a developer and we want to be there to support them and help them make awesome things. You can check out some of our recent work on keynotes, with the GitHub Stars, short-form video, live-streams, hackathons, social media, animated-gif goodness and more. Be on the ground, serving developers in regions around the world from our position in the core of the product team at GitHub Spark creativity and excitement around GitHub, and are always finding new ways to connect with developers Help IT professionals see how new features can make them faster, collaborate better, be more efficient, and more creative Connect product teams with the people they need to learn from to make GitHub work better for them - and help the engineering org learn from our customers Keep open source communities up to speed with the latest changes they can take advantage of and help maintainers be even more awesome than they already are. Success? That's based on happiness of developers, success of open source, ability to influence product direction and enabling the creativity of our super fans and the community around GitHub. Responsibilities What would you do? Learn: Everything about GitHub and what problems developers are trying to solve so you know how best to communicate with them and advocate for their needs with-in the wider product team. You are not alone in this, you will be joining an established team who are there to share ideas and work together but we also have access to the amazing engineering, support and professional services teams at GitHub along with our wonderful community. Share: Your industry knowledge and details about how GitHub build products and organize teams with peers and C-Levels at our customer and partner companies in the Bay Area and beyond. You will drive briefings with customer executives, run workshops with our customers and partners as well as create public facing content particularly focused on the needs of startups and enterprise developers. Nurture: Communities of engineers in the Bay Area and across the world that are using GitHub for their collaboration along with helping to grow the DevRel teams and helping the wider company improve how they communicate with other engineers outside of GitHub Teach: Define, create and execute on technical content creation programs across the company, helping our team in creating content but also helping others in the company ensure that content is appealing to our community. Communicate: Represent the company speaking at technical events and in interviews with press and analysts. You are a subject matter expert on all things dev and you help bring nerd cred to other teams in GitHub, such as the PR and social media teams. You help build channels that identify and share community content as well as measure how much that content is resonating Relationship management: Build a wide and diverse network amongst the developer community so they know someone they trust inside GitHub to advocate for their needs and you have a diverse network to seek out advice from and to connect to product teams when they are looking for people to give feedback on ideas and plans. Create Events: Organize and participate in online or virtual events, hackathons and manage Q&As. You will be a core contributor to the team creating keynote and launch content (both stage delivered and pre-recorded produced video formats) Qualifications Required Qualifications: 8+ years of experience in a developer relations, consulting, or facilitation roles within software engineering 5+ years experience leading technical conversations with engineers and their leaders around the end to end DevOps workflows including planning, source control, CI/CD and deployment to a variety of cloud providers 5+ years experience communicating with a range of audiences including C-Level Executives about topics related to software development. 1+ experience with Git and GitHub and an understanding of their position in the marketplace Preferred Qualifications: Past experience working with GitHub and an array of our partners in the cloud platforms space. Significant knowledge and experience of current trends in software development Experience with applying DevOps principles in engineering teams. Experience as a technical meet-up leader or community builder. Compensation Range USD $104,400.00 - USD $276,900.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"San Francisco California","city":"San Francisco","state":"California","country":"United States","country_code":"US","location_type":"ANY","latitude":37.7749295,"longitude":-122.4194155,"categories":[{"name":"Engineering"}],"tags2":["US-CA-San Francisco"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Senior Manager"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 8+ years of experience in a developer relations, consulting, or facilitation roles within software engineering 5+ years experience leading technical conversations with engineers and their leaders around the end to end DevOps workflows including planning, source control, CI/CD and deployment to a variety of cloud providers 5+ years experience communicating with a range of audiences including C-Level Executives about topics related to software development. 1+ experience with Git and GitHub and an understanding of their position in the marketplace Preferred Qualifications: Past experience working with GitHub and an array of our partners in the cloud platforms space. Significant knowledge and experience of current trends in software development Experience with applying DevOps principles in engineering teams. Experience as a technical meet-up leader or community builder.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542","responsibilities":"What would you do? Learn: Everything about GitHub and what problems developers are trying to solve so you know how best to communicate with them and advocate for their needs with-in the wider product team. You are not alone in this, you will be joining an established team who are there to share ideas and work together but we also have access to the amazing engineering, support and professional services teams at GitHub along with our wonderful community. Share: Your industry knowledge and details about how GitHub build products and organize teams with peers and C-Levels at our customer and partner companies in the Bay Area and beyond. You will drive briefings with customer executives, run workshops with our customers and partners as well as create public facing content particularly focused on the needs of startups and enterprise developers. Nurture: Communities of engineers in the Bay Area and across the world that are using GitHub for their collaboration along with helping to grow the DevRel teams and helping the wider company improve how they communicate with other engineers outside of GitHub Teach: Define, create and execute on technical content creation programs across the company, helping our team in creating content but also helping others in the company ensure that content is appealing to our community. Communicate: Represent the company speaking at technical events and in interviews with press and analysts. You are a subject matter expert on all things dev and you help bring nerd cred to other teams in GitHub, such as the PR and social media teams. You help build channels that identify and share community content as well as measure how much that content is resonating Relationship management: Build a wide and diverse network amongst the developer community so they know someone they trust inside GitHub to advocate for their needs and you have a diverse network to seek out advice from and to connect to product teams when they are looking for people to give feedback on ideas and plans. Create Events: Organize and participate in online or virtual events, hackathons and manage Q&As. You will be a core contributor to the team creating keynote and launch content (both stage delivered and pre-recorded produced video formats)","posted_date":"December 29, 2023","apply_url":"https://careers-githubinc.icims.com/jobs/2543/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2023-12-29T15:50:27Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-12-29T15:49:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":1,"uuid":"93be1b79-2d48-4a2d-b861-683b1fd85215"},"import_id":"c411a153-0338-45df-b672-231bd8a5c457","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/117954440603804358","jobHash":"fcbe557b0c7b533902560fe5177c8b30","derivedInfo":{"jobCategories":["SOCIAL_SERVICES_AND_NON_PROFIT","COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":37.7749295,"longitude":-122.4194155},"locationType":"LOCALITY","postalAddress":{"addressLines":["San Francisco, CA, USA"],"administrativeArea":"CA","languageCode":"","locality":"San Francisco","organization":"","postalCode":"","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.00476906649485292}]},"jobSummary":"What would you do? Learn: Everything about GitHub and what problems developers are trying to solve so you know how best to communicate with them and advocate for their needs with-in the wider product team. You are not alone in this, you will be joining an established team who are there to share ideas and work together but we also have access to the amazing engineering, support and professional services teams at GitHub along with our wonderful community. Share: Your industry knowledge and details about how GitHub build products and organize teams with peers and C-Levels at our customer and partner companies in the Bay Area and beyond. You will drive briefings with customer executives, run workshops with our customers and partners as well as create public facing content particularly focused on the needs of startups and enterprise developers. Nurture: Communities of engineers in the Bay Area and across the world that are using GitHub for their collaboration along with helping to grow the DevRel teams and helping the wider company improve how they communicate with other engineers outside of GitHub Teach: Define, create and execute on technical content creation programs across the company, helping our team in creating content but also helping others in the company ensure that content is appealing to our community. Communicate: Represent the company speaking at technical events and in interviews with press and analysts. You are a subject matter expert on all things dev and you help bring nerd cred to other teams in GitHub, such as the PR and social media teams. You help build channels that identify and share community content as well as measure how much that content is resonating Relationship management: Build a wide and diverse network amongst the developer community so they know someone they trust inside GitHub to advocate for their needs and you have a diverse network to seek out advice from and to connect to product teams when they are looking for people to give feedback on ideas and plans. Create Events: Organize and participate in online or virtual events, hackathons and manage Q&As. You will be a core contributor to the team creating keynote and launch content (both stage delivered and pre-recorded produced video formats)","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2543?lang=en-us","last_mod":"2023-12-29T15:50:39+0000","gdpr":false},"create_date":"2023-12-29T15:50:39+0000","category":[" Engineering"],"full_location":"San Francisco, California","short_location":"San Francisco, California"}},{"data":{"slug":"2542","language":"en-us","languages":["en-us"],"req_id":"2542","title":"Director of Enterprise Advocacy","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview Join our team to help the world of software development and open source collaboration be better, safer and welcoming to people of all backgrounds. GitHub is uniquely positioned to help developers grow and also help grow the next generation of people becoming developers. We are looking for a highly experienced Director of Developer Advocacy to join our well established and growing global Developer Relations team. What does Developer Relations at GitHub do? Whether the person is brand new to coding, a maker, a hobbyist, someone working on a personal project, someone contributing to open source, a team launching their first startup or someone working as part of a group in a large enterprise - they are a developer and we want to be there to support them and help them make awesome things. You can check out some of our recent work on keynotes, with the GitHub Stars, short-form video, live-streams, hackathons, social media, animated-gif goodness and more. Help IT professionals see how new features can make them faster, collaborate better, be more efficient, and more creative Be on the ground, serving developers in regions around the world from our position in the core of the product team at GitHub Spark creativity and excitement around GitHub, and are always finding new ways to connect with developers Connect product teams with the people they need to learn from to make GitHub work better for them - and help the engineering org learn from our customers Keep open source communities up to speed with the latest changes they can take advantage of and help maintainers be even more awesome than they already are. Success? That's based on the happiness of developers, success of open source, ability to influence product direction and enabling the creativity of our super fans and the community around GitHub Responsibilities What would you do? Lead: Provide the direction, guidance and mentoring for a growing team of developer advocates based around the globe. Define the strategies, targets, tactics the team will use and define how we will measure the impact that the team will undoubtedly have on our business goals Nurture: Your team and through them nurture communities of engineers across the world that are using GitHub for their collaboration - especially focused on communities with-in the Enterprise and Start-up space. Learn: Everything about GitHub and what problems developers are trying to solve so you know how best to communicate with them and advocate for their needs with-in the wider product team. You are not alone in this, you will be joining an established team who are there to share ideas and work together but we also work very closely with the amazing engineering, support and professional services teams at GitHub along with our wonderful community. Teach: Define, create and execute on technical content creation programs across the company, helping your team in creating content but also helping others in the company ensure that content is appealing to developers by developing appropriate systems to measure and improve content targeting and improve the feedback loops to help focus future content. Communicate: Represent the company speaking at technical events and in interviews with press and analysts. You are a subject matter expert on all things dev and you help other teams in GitHub, such as the PR and social media teams. You help build channels that identify and share community content as well as help us measure how much that content is resonating. Relationship management: Build a wide and diverse network amongst the developer community so they know someone they trust inside GitHub to advocate for their needs and you have a diverse network to seek out advice from and to connect to product teams when they are looking for people to give feedback on ideas and plans. Qualifications Required Qualifications: 5+ years of overall team management experience 2+ years experience leading Developer Advocates / Developer Evangelists for a company focused on developer products and services 7+ years experience in having technical conversations with developer & technical communities focused on DevOps (source control, CI/CD, deployment to a variety of cloud providers, etc.) Experience working with Git / GitHub including deploying applications and services to one or more key cloud platforms such as AWS, Azure or GCP. 10+ years of experience creating and delivering technical presentations, demos and keynotes to a range of audiences Preferred Qualifications: Existing relationships with technical leaders in the industry. Past experience as a technical meet-up leader or community builder. Experience working in a remote team spread across global time zones. Compensation Range USD $118,100.00 - USD $313,300.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Director"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 5+ years of overall team management experience 2+ years experience leading Developer Advocates / Developer Evangelists for a company focused on developer products and services 7+ years experience in having technical conversations with developer & technical communities focused on DevOps (source control, CI/CD, deployment to a variety of cloud providers, etc.) Experience working with Git / GitHub including deploying applications and services to one or more key cloud platforms such as AWS, Azure or GCP. 10+ years of experience creating and delivering technical presentations, demos and keynotes to a range of audiences Preferred Qualifications: Existing relationships with technical leaders in the industry. Past experience as a technical meet-up leader or community builder. Experience working in a remote team spread across global time zones.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542","responsibilities":"What would you do? Lead: Provide the direction, guidance and mentoring for a growing team of developer advocates based around the globe. Define the strategies, targets, tactics the team will use and define how we will measure the impact that the team will undoubtedly have on our business goals Nurture: Your team and through them nurture communities of engineers across the world that are using GitHub for their collaboration - especially focused on communities with-in the Enterprise and Start-up space. Learn: Everything about GitHub and what problems developers are trying to solve so you know how best to communicate with them and advocate for their needs with-in the wider product team. You are not alone in this, you will be joining an established team who are there to share ideas and work together but we also work very closely with the amazing engineering, support and professional services teams at GitHub along with our wonderful community. Teach: Define, create and execute on technical content creation programs across the company, helping your team in creating content but also helping others in the company ensure that content is appealing to developers by developing appropriate systems to measure and improve content targeting and improve the feedback loops to help focus future content. Communicate: Represent the company speaking at technical events and in interviews with press and analysts. You are a subject matter expert on all things dev and you help other teams in GitHub, such as the PR and social media teams. You help build channels that identify and share community content as well as help us measure how much that content is resonating. Relationship management: Build a wide and diverse network amongst the developer community so they know someone they trust inside GitHub to advocate for their needs and you have a diverse network to seek out advice from and to connect to product teams when they are looking for people to give feedback on ideas and plans.","posted_date":"December 28, 2023","apply_url":"https://careers-githubinc.icims.com/jobs/2542/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2023-12-28T21:35:54Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-12-28T21:33:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":6,"uuid":"3e386e49-14ee-4be4-82ec-81d5d871129e"},"import_id":"5f92f3af-73d8-4a17-b299-0a775b506933","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/114566872122172102","jobHash":"b3235fc577d3616e9efe30f34a4898e7","derivedInfo":{"jobCategories":["MANAGEMENT","COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.0000717042852578733}]},"jobSummary":"What would you do? Lead: Provide the direction, guidance and mentoring for a growing team of developer advocates based around the globe. Define the strategies, targets, tactics the team will use and define how we will measure the impact that the team will undoubtedly have on our business goals Nurture: Your team and through them nurture communities of engineers across the world that are using GitHub for their collaboration - especially focused on communities with-in the Enterprise and Start-up space. Learn: Everything about GitHub and what problems developers are trying to solve so you know how best to communicate with them and advocate for their needs with-in the wider product team. You are not alone in this, you will be joining an established team who are there to share ideas and work together but we also work very closely with the amazing engineering, support and professional services teams at GitHub along with our wonderful community. Teach: Define, create and execute on technical content creation programs across the company, helping your team in creating content but also helping others in the company ensure that content is appealing to developers by developing appropriate systems to measure and improve content targeting and improve the feedback loops to help focus future content. Communicate: Represent the company speaking at technical events and in interviews with press and analysts. You are a subject matter expert on all things dev and you help other teams in GitHub, such as the PR and social media teams. You help build channels that identify and share community content as well as help us measure how much that content is resonating. Relationship management: Build a wide and diverse network amongst the developer community so they know someone they trust inside GitHub to advocate for their needs and you have a diverse network to seek out advice from and to connect to product teams when they are looking for people to give feedback on ideas and plans.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2542?lang=en-us","last_mod":"2023-12-28T21:36:40+0000","gdpr":false},"update_date":"2023-12-28T21:36:40+0000","create_date":"2023-12-27T23:29:39+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2523","language":"en-us","languages":["en-us"],"req_id":"2523","title":"Staff Software Engineering Manager - Database Infrastructure","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview Database Infrastructure is responsible for managing, scaling and operating a fleet of data stores. We build tools and microservices to operate our databases and create self-service platforms for developers at GitHub. We're looking for an experienced engineering manager to help lead a distributed team of Platform Engineers. This role is not about dictating or managing a team member’s work directly, but rather guiding and serving to ensure the happiness and productivity of the team. As a leader and manager, you will directly influence engineering culture, mentor and grow other engineers, engage in long term architectural planning, and partner closely with key partners across the company to help deliver a highly available, resilient and scalable database platform. The engineers are responsible for the scalability, maintainability and performance of our MySQL database and provide robust APIs on top of our data model. For more about our work, read our blog posts on MySQL 8.0 upgrade and partitioning our data. The team is highly distributed and the right candidate can thrive in an environment of asynchronous communication. We expect you to have strong written and verbal communication skills and be able to create working relationships with coworkers in locations around the globe. Responsibilities Scale our database and application across multiple regions and in the Cloud. Oversee and guide a distributed team, guiding the team’s vision, best practices, and priorities. Provide clarity and a shared understanding of decision making, direction, and progress for the team and the company. Meeting 1-1 with team members on a regular basis. Provide career development plans and guided performance feedback. Review code, design docs and lead small group discussions about technical problems Drive incident response and facilitate blameless postmortems Plan and execute complex technical projects, coordinating work with engineering teams across the stack. Qualifications Required Qualifications 6+ years professional experience 2+ years of managing engineering teams 2+ years experience building, scaling and maintaining distributed, highly available systems. Preferred Qualifications Strong written and verbal communication skills. Passionate about resiliency and reliable infrastructure and building for high availability Experience managing and working on distributed teams. Experience with relational databases especially MySQL or Vitess Experience with reliability engineering or experience being oncall for highly available systems Experience designing large scale cloud services and distributed systems Experience maintaining production environments including monitoring, observability, and incident remediation Experience with cloud platforms like Microsoft Azure and Amazon Web Services Strong focus on customer and data driven decision making Excellent analytical skills when proactively identifying risks and balancing priorities Excellent communication skills including experience writing design documents and strategy documents Passionate about creating and fostering good engineering practices and processes Compensation Range USD $118,100.00 - USD $313,300.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Director"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications 6+ years professional experience 2+ years of managing engineering teams 2+ years experience building, scaling and maintaining distributed, highly available systems. Preferred Qualifications Strong written and verbal communication skills. Passionate about resiliency and reliable infrastructure and building for high availability Experience managing and working on distributed teams. Experience with relational databases especially MySQL or Vitess Experience with reliability engineering or experience being oncall for highly available systems Experience designing large scale cloud services and distributed systems Experience maintaining production environments including monitoring, observability, and incident remediation Experience with cloud platforms like Microsoft Azure and Amazon Web Services Strong focus on customer and data driven decision making Excellent analytical skills when proactively identifying risks and balancing priorities Excellent communication skills including experience writing design documents and strategy documents Passionate about creating and fostering good engineering practices and processes","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542","responsibilities":"Scale our database and application across multiple regions and in the Cloud. Oversee and guide a distributed team, guiding the team’s vision, best practices, and priorities. Provide clarity and a shared understanding of decision making, direction, and progress for the team and the company. Meeting 1-1 with team members on a regular basis. Provide career development plans and guided performance feedback. Review code, design docs and lead small group discussions about technical problems Drive incident response and facilitate blameless postmortems Plan and execute complex technical projects, coordinating work with engineering teams across the stack.","posted_date":"December 28, 2023","apply_url":"https://careers-githubinc.icims.com/jobs/2523/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2023-12-28T19:57:52Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-12-28T19:57:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":1,"uuid":"fb4dac38-a7b3-4436-94a9-c6d5bec1a534"},"import_id":"764da104-c650-4c9e-b659-9d4fe32915bd","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/80520962719523526","jobHash":"50bcd60a86031c88e1cc9a40ea290f08","derivedInfo":{"jobCategories":["MANAGEMENT","COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.0000717042852578733}]},"jobSummary":"Scale our database and application across multiple regions and in the Cloud. Oversee and guide a distributed team, guiding the team’s vision, best practices, and priorities. Provide clarity and a shared understanding of decision making, direction, and progress for the team and the company. Meeting 1-1 with team members on a regular basis. Provide career development plans and guided performance feedback. Review code, design docs and lead small group discussions about technical problems Drive incident response and facilitate blameless postmortems Plan and execute complex technical projects, coordinating work with engineering teams across the stack.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2523?lang=en-us","last_mod":"2023-12-28T19:58:39+0000","gdpr":false},"create_date":"2023-12-28T19:58:39+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2591","language":"en-us","languages":["en-us"],"req_id":"2591","title":"Applied Researcher","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub Copilot has changed the way software is built, and we have a unique opportunity to look further ahead to identify how software development can be faster, safer, easier, and more accessible. We’re looking for talented and passionate applied scientists to join us in this mission! Our team, GitHub Copilot Applied Science, has a crucial role in advancing the core intelligence solutions within Copilot. Our responsibilities encompass various areas such as LLM fine-tuning generation, prompt engineering, and the development of end-to-end AI features using cutting-edge technologies. In this role, you will collaborate closely with a diverse and highly skilled group of researchers, scientists, and software engineers within our team, while partnering with multiple teams across Github and Microsoft. Together, we are dedicated to shaping the future of software development by continuously enhancing AI-powered capabilities in Copilot. Responsibilities Drive research initiatives for online metrics development to continuously assess and improve the real-time performance of Copilot products Develop and implement methodologies for offline quality measurement, ensuring robust evaluation of large language model outputs in diverse scenarios. Lead the development of tools for automating quality analysis, streamlining the assessment process, and enhancing the efficiency of large-scale model evaluations. Integrate Responsible AI principles into the development lifecycle of Copilot products. Design and execute experiments to evaluate the impact of model changes, ensuring continuous refinement and advancement. Hands-on engagement with model training activities to elevate the performance of the Copilot product. Qualifications Required Qualifications: Bachelor's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 2+ years related experience (e.g., statistics, predictive analytics, research) OR Master's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 1+ year(s) related experience (e.g., statistics, predictive analytics, research) OR Doctorate in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field OR equivalent experience 1+ years experience in applied science, machine learning, deep learning, natural language processing or large-scale data mining. Strong programming skills in languages such as Python, and experience with relevant libraries and frameworks Preferred Qualifications: These are more specific abilities we’re looking for . Think of this as a descriptive sketch, not a checklist of requirements. Be comfortable applying even if you don’t have all of them. Ph.D in computer science, machine learning, or a related field. Experience working with LLM and OpenAI models. Understanding of Responsible AI principles and their application in AI product development. Have significant experience with large-scale data analysis and experimentation Expertise in developing tools for automation and familiarity with quality analysis frameworks. Excellent analytical and problem-solving skills with a keen attention to detail Excellent written and verbal communication skills Compensation Range USD $75,000.00 - USD $115,100.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications: Bachelor's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 2+ years related experience (e.g., statistics, predictive analytics, research) OR Master's Degree in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field AND 1+ year(s) related experience (e.g., statistics, predictive analytics, research) OR Doctorate in Statistics, Econometrics, Computer Science, Electrical or Computer Engineering, or related field OR equivalent experience 1+ years experience in applied science, machine learning, deep learning, natural language processing or large-scale data mining. Strong programming skills in languages such as Python, and experience with relevant libraries and frameworks Preferred Qualifications: These are more specific abilities we’re looking for . Think of this as a descriptive sketch, not a checklist of requirements. Be comfortable applying even if you don’t have all of them. Ph.D in computer science, machine learning, or a related field. Experience working with LLM and OpenAI models. Understanding of Responsible AI principles and their application in AI product development. Have significant experience with large-scale data analysis and experimentation Expertise in developing tools for automation and familiarity with quality analysis frameworks. Excellent analytical and problem-solving skills with a keen attention to detail Excellent written and verbal communication skills","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542","responsibilities":"Drive research initiatives for online metrics development to continuously assess and improve the real-time performance of Copilot products Develop and implement methodologies for offline quality measurement, ensuring robust evaluation of large language model outputs in diverse scenarios. Lead the development of tools for automating quality analysis, streamlining the assessment process, and enhancing the efficiency of large-scale model evaluations. Integrate Responsible AI principles into the development lifecycle of Copilot products. Design and execute experiments to evaluate the impact of model changes, ensuring continuous refinement and advancement. Hands-on engagement with model training activities to elevate the performance of the Copilot product.","posted_date":"December 28, 2023","apply_url":"https://careers-githubinc.icims.com/jobs/2591/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2023-12-28T19:59:08Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-12-28T19:59:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":1,"uuid":"468dd028-3d83-4309-b10a-3d41be2c2cb8"},"import_id":"f1dc92f4-5c2e-4874-8ea7-62729b8a09e8","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/78255968766304966","jobHash":"42fa3e6b7f8345516ca0d56728f04a5e","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.0000717042852578733}]},"jobSummary":"Drive research initiatives for online metrics development to continuously assess and improve the real-time performance of Copilot products Develop and implement methodologies for offline quality measurement, ensuring robust evaluation of large language model outputs in diverse scenarios. Lead the development of tools for automating quality analysis, streamlining the assessment process, and enhancing the efficiency of large-scale model evaluations. Integrate Responsible AI principles into the development lifecycle of Copilot products. Design and execute experiments to evaluate the impact of model changes, ensuring continuous refinement and advancement. Hands-on engagement with model training activities to elevate the performance of the Copilot product.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2591?lang=en-us","last_mod":"2023-12-28T20:00:39+0000","gdpr":false},"create_date":"2023-12-28T20:00:39+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2524","language":"en-us","languages":["en-us"],"req_id":"2524","title":"Staff Software Engineering Manager - Enterprise Server","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview The Enterprise Server team is responsible for the Platform and Operator Experience of GitHub’s on-premise product. We're looking for an experienced engineering manager to help lead a distributed team of Platform and Infrastructure Engineers. As a leader and manager, you will directly influence engineering culture, mentor and grow other engineers, engage in long term architectural planning, and partner closely with key partners across the company to help deliver a highly available, resilient and scalable Enterprise product. The team is highly distributed and the right candidate can thrive in an environment of asynchronous communication. We expect you to have strong written and verbal communication skills and be able to create working relationships with coworkers in locations around the globe. Responsibilities Guiding the development team’s vision, best practices, and priorities. Provide clarity and a shared understanding of decision making, direction, and progress for the team and the company. Meeting 1-1 with team members on a regular basis. Planning and supporting career development. Giving guided performance feedback. Reviewing code, design docs and leading small group discussions about engineering issues Drive incident response and facilitate blameless postmortems Coordinating work with engineering teams across the stack. Qualifications Required Qualifications 10+ years software engineering experience 5+ years of experience managing engineering teams Experience designing, building, scaling and maintaining distributed, highly available systems. Preferred Qualifications Passionate about creating and fostering good engineering practices and processes Passionate about resiliency and reliable infrastructure and building for high availability Strong written and verbal communication skills. Have experience managing/working on distributed teams. Experience with building or managing on-premise products. Experience with reliability engineering or experience being oncall for highly available systems Compensation Range USD $118,100.00 - USD $313,300.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Director"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications 10+ years software engineering experience 5+ years of experience managing engineering teams Experience designing, building, scaling and maintaining distributed, highly available systems. Preferred Qualifications Passionate about creating and fostering good engineering practices and processes Passionate about resiliency and reliable infrastructure and building for high availability Strong written and verbal communication skills. Have experience managing/working on distributed teams. Experience with building or managing on-premise products. Experience with reliability engineering or experience being oncall for highly available systems","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542","responsibilities":"Guiding the development team’s vision, best practices, and priorities. Provide clarity and a shared understanding of decision making, direction, and progress for the team and the company. Meeting 1-1 with team members on a regular basis. Planning and supporting career development. Giving guided performance feedback. Reviewing code, design docs and leading small group discussions about engineering issues Drive incident response and facilitate blameless postmortems Coordinating work with engineering teams across the stack.","posted_date":"December 28, 2023","apply_url":"https://careers-githubinc.icims.com/jobs/2524/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2023-12-28T19:57:28Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-12-28T19:57:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":1,"uuid":"acbd4133-958a-4a18-b277-85dd1354a6ee"},"import_id":"c8d12b34-10fe-4262-9070-93c011912355","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/122940121319121606","jobHash":"741b6269fac97c6f70cf2610d53ea6d6","derivedInfo":{"jobCategories":["MANAGEMENT","COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.0000717042852578733}]},"jobSummary":"Guiding the development team’s vision, best practices, and priorities. Provide clarity and a shared understanding of decision making, direction, and progress for the team and the company. Meeting 1-1 with team members on a regular basis. Planning and supporting career development. Giving guided performance feedback. Reviewing code, design docs and leading small group discussions about engineering issues Drive incident response and facilitate blameless postmortems Coordinating work with engineering teams across the stack.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2524?lang=en-us","last_mod":"2023-12-28T19:57:39+0000","gdpr":false},"create_date":"2023-12-28T19:57:39+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2459","language":"en-us","languages":["en-us"],"req_id":"2459","title":"Senior Software Engineer , Copilot Prompt","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub Copilot has changed the way software is built, and we have a unique opportunity to look further ahead to identify how software development can be faster, safer, easier, and more accessible. We’re looking for a talented and experienced Software Engineer to join us in this mission! Our organization, GitHub Copilot Applied Science, has a crucial role in advancing the core intelligence solutions within Copilot. Our responsibilities encompass various areas such as LLM fine-tuning generation, prompt engineering, and the development of end-to-end AI features using cutting-edge technologies. In this role, you will play a crucial role in developing and refining our prompt generation framework to drive the quality of the Copilot product forward. You will collaborate closely with a diverse and highly skilled group of researchers, scientists, and software engineers within our team, while partnering with multiple teams across GitHub and Microsoft. Together, we are dedicated to shaping the future of software development by continuously enhancing AI-powered capabilities in Copilot. Responsibilities Problem Solving: Blend engineering and science capabilities to provide creative and innovative solutions to complex problems in the prompt engineering space Collaboration: Collaborate and effectively communicate with cross-functional teams, including engineers, data scientists, researchers, and product managers Innovation: Drive innovation within the team by exploring new methodologies, tools, and technologies that can enhance research capabilities and outcomes Quality Assurance: Conduct rigorous testing to identify and rectify issues with our prompt generation framework Leadership: Lead technical decision-making and architecture Maintainability: Write, review, and maintain code primarily in Typescript Qualifications Required Qualifications: 8+ years experience building and shipping software using a variety of technology stacks, or equivalent experience. 2+ years of experience in large data handling and telemetry systems. 2+ years of experience working with ML scientists or ML powered products. Preferred Qualifications: These are more specific abilities we’re looking for.Think of this as a descriptive sketch, not a checklist of requirements. Be comfortable applying even if you don’t have all of them. Significant experience with machine learning, LLMs, and the rapidly-evolving landscape of techniques and tools used to build intelligence into products. Full-stack experience in complex AI-powered systems. Proficiency in Typescript Experience working with a remote, distributed team Experience designing prompts for LLMs Significant experience with one or more backend technologies: server-side environments, compute, datastores, networking, infrastructure, devops, security, and programming languages. Significant experience with open-source software, communities, and the systems these communities use to self-organize and ship software for others. Master’s degree in computer science or a related engineering field. Compensation Range USD $104,400.00 - USD $276,900.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 8+ years experience building and shipping software using a variety of technology stacks, or equivalent experience. 2+ years of experience in large data handling and telemetry systems. 2+ years of experience working with ML scientists or ML powered products. Preferred Qualifications: These are more specific abilities we’re looking for.Think of this as a descriptive sketch, not a checklist of requirements. Be comfortable applying even if you don’t have all of them. Significant experience with machine learning, LLMs, and the rapidly-evolving landscape of techniques and tools used to build intelligence into products. Full-stack experience in complex AI-powered systems. Proficiency in Typescript Experience working with a remote, distributed team Experience designing prompts for LLMs Significant experience with one or more backend technologies: server-side environments, compute, datastores, networking, infrastructure, devops, security, and programming languages. Significant experience with open-source software, communities, and the systems these communities use to self-organize and ship software for others. Master’s degree in computer science or a related engineering field.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542","responsibilities":"Problem Solving: Blend engineering and science capabilities to provide creative and innovative solutions to complex problems in the prompt engineering space Collaboration: Collaborate and effectively communicate with cross-functional teams, including engineers, data scientists, researchers, and product managers Innovation: Drive innovation within the team by exploring new methodologies, tools, and technologies that can enhance research capabilities and outcomes Quality Assurance: Conduct rigorous testing to identify and rectify issues with our prompt generation framework Leadership: Lead technical decision-making and architecture Maintainability: Write, review, and maintain code primarily in Typescript","posted_date":"December 28, 2023","apply_url":"https://careers-githubinc.icims.com/jobs/2459/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2023-12-28T18:49:35Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-12-28T18:49:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":1,"uuid":"69d96576-9615-43af-87a3-23306517aed9"},"import_id":"95d592d4-7edd-441c-8db5-86b0cd101e6b","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/90829708863644358","jobHash":"944f5084c120b6b5294444b6ec179914","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.0000717042852578733}]},"jobSummary":"Problem Solving: Blend engineering and science capabilities to provide creative and innovative solutions to complex problems in the prompt engineering space Collaboration: Collaborate and effectively communicate with cross-functional teams, including engineers, data scientists, researchers, and product managers Innovation: Drive innovation within the team by exploring new methodologies, tools, and technologies that can enhance research capabilities and outcomes Quality Assurance: Conduct rigorous testing to identify and rectify issues with our prompt generation framework Leadership: Lead technical decision-making and architecture Maintainability: Write, review, and maintain code primarily in Typescript","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2459?lang=en-us","last_mod":"2023-12-28T18:49:39+0000","gdpr":false},"create_date":"2023-12-28T18:49:39+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2589","language":"en-us","languages":["en-us"],"req_id":"2589","title":"Software Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview As a software engineer at GitHub, you will enhance the collaboration experience at GitHub by working closely with a community of engineers and designers with a distributed, diverse and passionate team delivering the services that millions of developers depend on. In this role you will design, prototype, implement, ship and support highly performant and inspiring user experiences with your team. We are looking for creative problem solvers and diverse thinkers, people who care about culture as well as customers and features. We believe that how we do things is as important as what we do. Big vision, a common purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what lead to great results. Great products reflect the teams that build them. Responsibilities Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code. Qualifications Required Qualifications Many years of experience as a software engineer or related field Bachelor's degree in Computer Science, Software Engineering or equivalent work experience Experience delivering high availability, enterprise grade services, including monitoring, observability and diagnosing problems Many years of experience in two or more of the following skill sets: Ruby (Rails) Go and related tooling JavaScript (React, TypeScript, Relay) MySQL and database management NodeJS development Design and build REST and/or GraphQL APIs Experience with CI/CD tools and automated pipelines Preferred Qualifications Experience with Git, GitHub , Actions & workflow platform for version control and collaborative development. Internals of web development frameworks, tools, and client performance optimization. Building developer tools and pipelines that streamline and automate software lifecycle, including development, testing and releasing, with focus on speed, reliability and scalability. Excellent written and verbal communication via async collaboration, documentation, and visibility of work Hands-on experience with distributed systems at global scale. Experience working with a remote, distributed team. Familiarity with SQL, Kusto Query Language, general database knowledge, Kubernetes, and/or cloud-native concepts Passionate about fostering effective Engineering practices and processes and contribute to open source software, engage with maintainers, and actively participate in community curation. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"United Kingdom Remote","city":"Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications Many years of experience as a software engineer or related field Bachelor's degree in Computer Science, Software Engineering or equivalent work experience Experience delivering high availability, enterprise grade services, including monitoring, observability and diagnosing problems Many years of experience in two or more of the following skill sets: Ruby (Rails) Go and related tooling JavaScript (React, TypeScript, Relay) MySQL and database management NodeJS development Design and build REST and/or GraphQL APIs Experience with CI/CD tools and automated pipelines Preferred Qualifications Experience with Git, GitHub , Actions & workflow platform for version control and collaborative development. Internals of web development frameworks, tools, and client performance optimization. Building developer tools and pipelines that streamline and automate software lifecycle, including development, testing and releasing, with focus on speed, reliability and scalability. Excellent written and verbal communication via async collaboration, documentation, and visibility of work Hands-on experience with distributed systems at global scale. Experience working with a remote, distributed team. Familiarity with SQL, Kusto Query Language, general database knowledge, Kubernetes, and/or cloud-native concepts Passionate about fostering effective Engineering practices and processes and contribute to open source software, engage with maintainers, and actively participate in community curation.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542","responsibilities":"Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","posted_date":"December 28, 2023","apply_url":"https://globalcareers-githubinc.icims.com/jobs/2589/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":{"ccc.attract.portal.url":"","icims.config.web.indeed.easy.apply":"0","icims.external.xml.feeds":"icims.indeed.xml.enabled,icims.resume-library.xml.enabled,icims.direct-employers.xml.enabled,icims.monster.xml.enabled,icims.adzuna.xml.enabled,icims.careerbuilder.xml.enabled,icims.ziprecruiter.xml.enabled,icims.craigslist.xml.enabled,icims.itjobscafe.xml.enabled,icims.recruitnet.xml.enabled,icims.upward.xml.enabled,icims.jobbio.xml.enabled,icims.propellum.xml.enabled,icims.snagajob.xml.enabled,icims.inhersight.xml.enabled,icims.pallet-labs.xml.enabled,icims.qkly.xml.enabled,icims.cv-library.xml.enabled,icims.linkedin.xml.enabled,icims.zippia.xml.enabled,icims.puck.xml.enabled","jobposting.external.company.name":"GitHub, Inc.","jobposting.external.company.url":"github.com","portal.id":"108"},"date_updated":"2023-12-28T01:42:23Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-12-28T01:42:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750","siteType":"ATTRACT","tenantId":"13865"},"revision_int":1,"uuid":"62bb0f47-3070-432e-ab37-036a80b8028e"},"import_id":"f7973ae6-728f-4143-b212-b8fe6e97c517","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/140952849086325446","jobHash":"75dc5a8b5caa67db58dfeff555d1c098","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2589?lang=en-us","last_mod":"2023-12-28T14:00:00+0000","gdpr":true},"update_date":"2023-12-28T14:00:00+0000","create_date":"2023-12-28T01:42:39+0000","category":[" Engineering"],"full_location":"Remote, United Kingdom","short_location":"Remote, United Kingdom"}},{"data":{"slug":"2572","language":"en-us","languages":["en-us"],"req_id":"2572","title":"Software Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview As a software engineer at GitHub, you will enhance the collaboration experience at GitHub by working closely with a community of engineers and designers with a distributed, diverse and passionate team delivering the services that millions of developers depend on. In this role you will design, prototype, implement, ship and support highly performant and inspiring user experiences with your team. We are looking for creative problem solvers and diverse thinkers, people who care about culture as well as customers and features. We believe that how we do things is as important as what we do. Big vision, a common purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what lead to great results. Great products reflect the teams that build them. Responsibilities Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code. Qualifications Required Qualifications Four or more years of experience as a software engineer or related field Bachelor's degree in Computer Science, Software Engineering or equivalent work experience 2+ years of experience delivering high availability, enterprise grade services, including monitoring, observability and diagnosing problems Four or more years of experience in two or more of the following skill sets: Ruby (Rails) Go and related tooling JavaScript (React, TypeScript, Relay) MySQL and database management NodeJS development Design and build REST and/or GraphQL APIs Experience with CI/CD tools and automated pipelines Preferred Qualifications Experience with Git, GitHub , Actions & workflow platform for version control and collaborative development. Internals of web development frameworks, tools, and client performance optimization. Building developer tools and pipelines that streamline and automate software lifecycle, including development, testing and releasing, with focus on speed, reliability and scalability. Excellent written and verbal communication via async collaboration, documentation, and visibility of work Hands-on experience with distributed systems at global scale. Experience working with a remote, distributed team. Familiarity with SQL, Kusto Query Language, general database knowledge, Kubernetes, and/or cloud-native concepts Passionate about fostering effective Engineering practices and processes and contribute to open source software, engage with maintainers, and actively participate in community curation. Compensation Range USD $104,400.00 - USD $276,900.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications Four or more years of experience as a software engineer or related field Bachelor's degree in Computer Science, Software Engineering or equivalent work experience 2+ years of experience delivering high availability, enterprise grade services, including monitoring, observability and diagnosing problems Four or more years of experience in two or more of the following skill sets: Ruby (Rails) Go and related tooling JavaScript (React, TypeScript, Relay) MySQL and database management NodeJS development Design and build REST and/or GraphQL APIs Experience with CI/CD tools and automated pipelines Preferred Qualifications Experience with Git, GitHub , Actions & workflow platform for version control and collaborative development. Internals of web development frameworks, tools, and client performance optimization. Building developer tools and pipelines that streamline and automate software lifecycle, including development, testing and releasing, with focus on speed, reliability and scalability. Excellent written and verbal communication via async collaboration, documentation, and visibility of work Hands-on experience with distributed systems at global scale. Experience working with a remote, distributed team. Familiarity with SQL, Kusto Query Language, general database knowledge, Kubernetes, and/or cloud-native concepts Passionate about fostering effective Engineering practices and processes and contribute to open source software, engage with maintainers, and actively participate in community curation.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542","responsibilities":"Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","posted_date":"December 27, 2023","apply_url":"https://careers-githubinc.icims.com/jobs/2572/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":{"ccc.attract.portal.url":"https://www.github.careers","icims.config.web.indeed.easy.apply":"0","icims.external.xml.feeds":"icims.indeed.xml.enabled,icims.resume-library.xml.enabled,icims.direct-employers.xml.enabled,icims.monster.xml.enabled,icims.adzuna.xml.enabled,icims.careerbuilder.xml.enabled,icims.ziprecruiter.xml.enabled,icims.craigslist.xml.enabled,icims.itjobscafe.xml.enabled,icims.recruitnet.xml.enabled,icims.upward.xml.enabled,icims.jobbio.xml.enabled,icims.propellum.xml.enabled,icims.snagajob.xml.enabled,icims.inhersight.xml.enabled,icims.pallet-labs.xml.enabled,icims.qkly.xml.enabled,icims.cv-library.xml.enabled,icims.linkedin.xml.enabled,icims.zippia.xml.enabled,icims.puck.xml.enabled","jobposting.external.company.name":"GitHub, Inc.","jobposting.external.company.url":"github.com","portal.id":"17"},"date_updated":"2023-12-28T02:56:45Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-12-27T19:54:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb","siteType":"ATTRACT","tenantId":"13865"},"revision_int":4,"uuid":"0b111ea0-7593-4afa-afd1-5073e45c86d9"},"import_id":"f7973ae6-728f-4143-b212-b8fe6e97c517","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/108465475941212870","jobHash":"57976724563c96a32c30a045b9e3d6d6","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.0000717042852578733}]},"jobSummary":"Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2572?lang=en-us","last_mod":"2023-12-28T13:59:50+0000","gdpr":false},"update_date":"2023-12-28T13:59:50+0000","create_date":"2023-12-27T19:54:39+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2504","language":"en-us","languages":["en-us"],"req_id":"2504","title":"Staff Manager , Software Engineering , Accessibility","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview At GitHub, our goal is to provide a welcoming environment for all developers. With over one billion people living with disabilities worldwide, we are committed to creating an inclusive platform. We are seeking a skilled and experienced Software Engineering Manager to join our team in this mission. Our Accessibility Engineering team plays a critical role in ensuring that GitHub meets and exceeds accessibility standards, while also delivering an enjoyable user experience to all users. We prioritize accessibility as a core principle in all of our frontend frameworks. As a member of our team, you will collaborate with a passionate and distributed group to enhance our frontend platforms and make our products and services accessible to all users. You will collaborate closely with a group of product managers, designers, researchers, and software engineers within our team, while partnering with many other teams across GitHub and Microsoft. Together, we are committed to building a future where accessibility is a fundamental aspect of how we create technology, and where every developer can contribute and thrive on GitHub. Responsibilities Meeting 1-1 with all your team members on a regular basis Planning and supporting career development Giving guided performance feedback Serving as a coach and mentor Fostering a supportive environment that will allow engineers to do their best work Guiding the development of the team’s vision, best practices, and priorities Initiating group discussions on engineering topics and facilitating team decision making that’s inclusive of perspectives from team members, partner teams, stakeholders, and the leadership team Effectively communicating status, findings, insights, and recommendations to the leadership team. Driving innovation within the team by exploring new methodologies, tools, and technologies that can enhance our ability to build a more accessible GitHub. Qualifications Required Qualifications: 8+ years experience building and shipping software using a variety of technology stacks, building large scale systems, or equivalent experience. 5+ years of engineering team management experience. 3+ years of experience in frontend development. Preferred Qualifications: These are more specific abilities we’re looking for . Think of this as a descriptive sketch, not a checklist of requirements. We encourage you to apply even if you don’t have all of them. 2+ years of experience working with accessibility guidelines and standards, including WCAG 2.1 and Section 508 2+ years of experience analyzing or auditing code for accessibility issues 2+ years of experience working remote as a software engineer or engineering manager. Have significant experience in the frontend development space with working knowledge of web standards, major UI development frameworks and libraries (e.g. Ruby on Rails, React), and patterns and best practices around building accessible user experiences. Have significant experience with open-source software development and communities. Compensation Range USD $118,100.00 - USD $313,300.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Director"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 8+ years experience building and shipping software using a variety of technology stacks, building large scale systems, or equivalent experience. 5+ years of engineering team management experience. 3+ years of experience in frontend development. Preferred Qualifications: These are more specific abilities we’re looking for . Think of this as a descriptive sketch, not a checklist of requirements. We encourage you to apply even if you don’t have all of them. 2+ years of experience working with accessibility guidelines and standards, including WCAG 2.1 and Section 508 2+ years of experience analyzing or auditing code for accessibility issues 2+ years of experience working remote as a software engineer or engineering manager. Have significant experience in the frontend development space with working knowledge of web standards, major UI development frameworks and libraries (e.g. Ruby on Rails, React), and patterns and best practices around building accessible user experiences. Have significant experience with open-source software development and communities.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542","responsibilities":"Meeting 1-1 with all your team members on a regular basis Planning and supporting career development Giving guided performance feedback Serving as a coach and mentor Fostering a supportive environment that will allow engineers to do their best work Guiding the development of the team’s vision, best practices, and priorities Initiating group discussions on engineering topics and facilitating team decision making that’s inclusive of perspectives from team members, partner teams, stakeholders, and the leadership team Effectively communicating status, findings, insights, and recommendations to the leadership team. Driving innovation within the team by exploring new methodologies, tools, and technologies that can enhance our ability to build a more accessible GitHub.","posted_date":"December 22, 2023","apply_url":"https://careers-githubinc.icims.com/jobs/2504/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":{"ccc.attract.portal.url":"https://www.github.careers","icims.config.web.indeed.easy.apply":"0","icims.external.xml.feeds":"icims.indeed.xml.enabled,icims.resume-library.xml.enabled,icims.direct-employers.xml.enabled,icims.monster.xml.enabled,icims.adzuna.xml.enabled,icims.careerbuilder.xml.enabled,icims.ziprecruiter.xml.enabled,icims.craigslist.xml.enabled,icims.itjobscafe.xml.enabled,icims.recruitnet.xml.enabled,icims.upward.xml.enabled,icims.jobbio.xml.enabled,icims.propellum.xml.enabled,icims.snagajob.xml.enabled,icims.inhersight.xml.enabled,icims.pallet-labs.xml.enabled,icims.qkly.xml.enabled,icims.cv-library.xml.enabled,icims.linkedin.xml.enabled,icims.zippia.xml.enabled,icims.puck.xml.enabled","jobposting.external.company.name":"GitHub, Inc.","jobposting.external.company.url":"github.com","portal.id":"17"},"date_updated":"2023-12-22T23:54:07Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-12-22T23:54:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb","siteType":"ATTRACT","tenantId":"13865"},"revision_int":1,"uuid":"0240aa7c-eb50-4fd7-a507-e20c6edabdb0"},"import_id":"f7973ae6-728f-4143-b212-b8fe6e97c517","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/90538855020536518","jobHash":"62c7598e924484bc697fe65293f66726","derivedInfo":{"jobCategories":["MANAGEMENT","COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.0000717042852578733}]},"jobSummary":"Meeting 1-1 with all your team members on a regular basis Planning and supporting career development Giving guided performance feedback Serving as a coach and mentor Fostering a supportive environment that will allow engineers to do their best work Guiding the development of the team’s vision, best practices, and priorities Initiating group discussions on engineering topics and facilitating team decision making that’s inclusive of perspectives from team members, partner teams, stakeholders, and the leadership team Effectively communicating status, findings, insights, and recommendations to the leadership team. Driving innovation within the team by exploring new methodologies, tools, and technologies that can enhance our ability to build a more accessible GitHub.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2504?lang=en-us","last_mod":"2023-12-28T13:59:43+0000","gdpr":false},"update_date":"2023-12-28T13:59:43+0000","create_date":"2023-12-22T23:54:39+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2568","language":"en-us","languages":["en-us"],"req_id":"2568","title":"Staff Engineering Manager","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview We’re looking for a Software Engineering Manager to help build foundational components of the Copilot Platform. This is an exciting role in a fast paced environment with high impact. A manager working on this team needs to have a strong balance of people, project, and technical management - flexing their skill sets to empower the team to create innovative solutions in the AI space. Responsibilities A day in the life: Our team is distributed worldwide which means we work both asynchronously and real-time. Managers at GitHub directly manage engineers and we allow for this track to grow in complexity within the product and technology. We separate this track from our Director roles who manage people managers and tend to focus on breadth. This role is for a platform team within the Copilot organization. Your typical week would include: Collaborating with internal and external engineering teams, product management, platform customers, and engineering leadership to align on and understand the problems we want to solve Working with the team to explore and coach how we can solve them, often via real-time conversations in Slack or Zoom, and with asynchronous communication in GitHub Issues, PRs, Discussions, and Projects Communicating effectively to support internal users, and inform stakeholders of progress as well as system status and team health Conducting 1:1s with direct reports to provide regular feedback and ensure career growth and progression, coordinating work within the team and stakeholders, building relationships, and identifying opportunities and areas of improvement Ensuring the team produces good architectural design outcomes, resilient systems, and quality code Ensuring the team iteratively ships features and bug fixes; balancing speed to market with future velocity Qualifications We care more about hiring people that have a track record of caring deeply about shipping software that helps people with their work than checking all of the qualifications off. So whether you meet all the qualifications or a partial set, we want to hear from you. Required qualifications 8+ years experience building and shipping software using a variety of technology stacks, building large scale systems, or equivalent experience. 5+ years of experience managing engineering teams in complex systems Experience developing a strategy and roadmap in partnership with your team and stakeholders Experience communicating with high-level stakeholders and executing large initiatives in an iterative fashion Preferred qualifications Excellent written and verbal communication skills Passionate about fostering good engineering practices and processes Experience managing platform teams Experience with delivering products in the artificial intelligence space Experience working with research or applied scientists Compensation Range USD $118,100.00 - USD $313,300.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub Leadership Principles Customer Obsessed - Trust by Default - Ship to Learn - Own the Outcome - Growth Mindset - Global Product, Global Team - Anything is Possible - Practice Kindness Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Director"],"tags6":["Yes"],"promotion_value":0,"qualifications":"We care more about hiring people that have a track record of caring deeply about shipping software that helps people with their work than checking all of the qualifications off. So whether you meet all the qualifications or a partial set, we want to hear from you. Required qualifications 8+ years experience building and shipping software using a variety of technology stacks, building large scale systems, or equivalent experience. 5+ years of experience managing engineering teams in complex systems Experience developing a strategy and roadmap in partnership with your team and stakeholders Experience communicating with high-level stakeholders and executing large initiatives in an iterative fashion Preferred qualifications Excellent written and verbal communication skills Passionate about fostering good engineering practices and processes Experience managing platform teams Experience with delivering products in the artificial intelligence space Experience working with research or applied scientists","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert&action=download&id=59&hashed=-1914625542","responsibilities":"A day in the life: Our team is distributed worldwide which means we work both asynchronously and real-time. Managers at GitHub directly manage engineers and we allow for this track to grow in complexity within the product and technology. We separate this track from our Director roles who manage people managers and tend to focus on breadth. This role is for a platform team within the Copilot organization. Your typical week would include: Collaborating with internal and external engineering teams, product management, platform customers, and engineering leadership to align on and understand the problems we want to solve Working with the team to explore and coach how we can solve them, often via real-time conversations in Slack or Zoom, and with asynchronous communication in GitHub Issues, PRs, Discussions, and Projects Communicating effectively to support internal users, and inform stakeholders of progress as well as system status and team health Conducting 1:1s with direct reports to provide regular feedback and ensure career growth and progression, coordinating work within the team and stakeholders, building relationships, and identifying opportunities and areas of improvement Ensuring the team produces good architectural design outcomes, resilient systems, and quality code Ensuring the team iteratively ships features and bug fixes; balancing speed to market with future velocity","posted_date":"December 22, 2023","apply_url":"https://careers-githubinc.icims.com/jobs/2568/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":{"ccc.attract.portal.url":"https://www.github.careers","icims.config.web.indeed.easy.apply":"0","icims.external.xml.feeds":"icims.indeed.xml.enabled,icims.resume-library.xml.enabled,icims.direct-employers.xml.enabled,icims.monster.xml.enabled,icims.adzuna.xml.enabled,icims.careerbuilder.xml.enabled,icims.ziprecruiter.xml.enabled,icims.craigslist.xml.enabled,icims.itjobscafe.xml.enabled,icims.recruitnet.xml.enabled,icims.upward.xml.enabled,icims.jobbio.xml.enabled,icims.propellum.xml.enabled,icims.snagajob.xml.enabled,icims.inhersight.xml.enabled,icims.pallet-labs.xml.enabled,icims.qkly.xml.enabled,icims.cv-library.xml.enabled,icims.linkedin.xml.enabled,icims.zippia.xml.enabled,icims.puck.xml.enabled","jobposting.external.company.name":"GitHub, Inc.","jobposting.external.company.url":"github.com","portal.id":"17"},"date_updated":"2023-12-28T02:16:45Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2023-12-22T23:55:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb","siteType":"ATTRACT","tenantId":"13865"},"revision_int":2,"uuid":"43b736a2-7a33-4250-9aaa-cb76c0a0c19d"},"import_id":"f7973ae6-728f-4143-b212-b8fe6e97c517","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/82257333440127686","jobHash":"d9acdd9dcdf97ab29cd1fd342f53852c","derivedInfo":{"jobCategories":["MANAGEMENT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.0000717042852578733}]},"jobSummary":"A day in the life: Our team is distributed worldwide which means we work both asynchronously and real-time. Managers at GitHub directly manage engineers and we allow for this track to grow in complexity within the product and technology. We separate this track from our Director roles who manage people managers and tend to focus on breadth. This role is for a platform team within the Copilot organization. Your typical week would include: Collaborating with internal and external engineering teams, product management, platform customers, and engineering leadership to align on and understand the problems we want to solve Working with the team to explore and coach how we can solve them, often via real-time conversations in Slack or Zoom, and with asynchronous communication in GitHub Issues, PRs, Discussions, and Projects Communicating effectively to support internal users, and inform stakeholders of progress as well as system status and team health Conducting 1:1s with direct reports to provide regular feedback and ensure career growth and progression, coordinating work within the team and stakeholders, building relationships, and identifying opportunities and areas of improvement Ensuring the team produces good architectural design outcomes, resilient systems, and quality code Ensuring the team iteratively ships features and bug fixes; balancing speed to market with future velocity","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2568?lang=en-us","last_mod":"2023-12-28T13:59:46+0000","gdpr":false},"update_date":"2023-12-28T13:59:46+0000","create_date":"2023-12-22T23:55:39+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}}],"totalCount":39,"count":39,"filter":{"displayLimit":10,"categories":{"all":[{"category":"Engineering","numJobs":39}],"shortlist":[{"category":"Engineering","numJobs":39}]},"brands":{"all":[],"shortlist":[]},"experienceLevels":{"all":[],"shortlist":[]},"locations":{"all":[{"city":"San Francisco","state":"California","country":"United States","count":1},{"city":"Remote","state":null,"country":"Germany","count":2},{"city":"Remote","state":null,"country":"Spain","count":1},{"city":"Remote","state":null,"country":"United Kingdom","count":6},{"city":"Remote","state":null,"country":"United States","count":29}],"shortlist":[{"city":"San Francisco","state":"California","country":"United States","count":1},{"city":"Remote","state":null,"country":"Germany","count":2},{"city":"Remote","state":null,"country":"Spain","count":1},{"city":"Remote","state":null,"country":"United Kingdom","count":6},{"city":"Remote","state":null,"country":"United States","count":29}]},"facetList":{"tags4":[{"term":"Experienced Professional","count":39}],"tags5":[{"term":"Individual Contributor","count":31},{"term":"Director","count":6},{"term":"Senior Director","count":1},{"term":"Senior Manager","count":1}],"tags6":[{"term":"Yes","count":39}]}},"languageCounts":{"en-us":{"displayName":"English","count":39}},"request_id":false,"meta_data":{"ResponseMetadata":{"requestId":"0939dcf1-2cd7-4485-b3c4-23e51c305768:APAb7IRgRsi+g6+S/AYJuJT9r1gxfbAg/A=="}},"locations":[]}