{"jobs":[{"data":{"slug":"2734","language":"en-us","languages":["en-us"],"req_id":"2734","title":"Senior Engineering Manager","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, Canada Overview GitHub is changing the way the world builds software, and we want you to help build GitHub. We're looking for an experienced software engineering manager to join a passionate, collaborative, distributed group of engineers on our team. The GitHub Mobile team is changing the way that developers across the world collaborate on GitHub through native Android and iOS apps. Launched in March 2020, GitHub Mobile is one of our fastest growing products. The mobile team is part of the Client Apps organization, working alongside the GitHub Desktop and GitHub CLI teams. This role will oversee one of our GitHub Mobile squads with Android, iOS, and server engineers located across the United States. You will partner closely with our other GitHub Mobile squad located primarily in Berlin, Germany. Stack: Our apps are built natively with Kotlin for Android and Swift for iOS. Our apps communicate with GitHub via GraphQL and REST APIs. A day in the life of a Senior Engineering Manager: Our team is distributed worldwide which means we work asynchronously most of the time. Your typical week would include: Work with design, data, and product management to understand the problems we want to solve, then working with engineers to solve them. Solving engineering and product problems with engineering collaborators via GitHub, Slack, and Zoom Planning with partner teams and stakeholders Create and foster a high-performance culture amongst your team Conducting 1:1s with direct reports to provide regular feedback and ensure career growth and progression Working with your manager in your 1:1 meetings to grow yourself and career Talking with users to get feedback and data about the apps Responsibilities Cultivate an environment where team members are empowered and demonstrate a strong sense of ownership Meet with team members 1:1 on a regular basis Help the team ships products, features, and bug-fixes regularly Ensure that individuals on the team are learning, growing, and advancing in their careers Effectively communicate directions and decisions with the team and company Build alignment with engineering, design, and product leadership Guide the team toward building high quality software across multiple platform Qualifications Required Qualifications: Several years of experience designing, developing, and shipping high-quality software at scale Some years of experience in people management or relevant experience in leading technical teams Experience developing a strategy and roadmap for your teams Preferred Qualifications: There are only a handful of folks who meet all qualifications. Is this you? Excellent, please apply. But we care most about managers that have a track record of caring deeply about their teams, management as a craft, and shipping software that helps people with their work. Either way, we want to hear from you. Experience with Android and/or iOS Experience with Ruby on Rails Knowledge of testing, profiling, and debugging practices Experience working asynchronously on a remote, distributed team Passionate about fostering good engineering practices and processes Experience communicating with high-level stakeholders and executing large initiatives in an iterative fashion GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"Canada Remote","city":"Remote","country":"CAN","country_code":"CN","location_type":"ANY","latitude":23.11667,"longitude":113.25,"categories":[{"name":"Engineering"}],"tags2":["CAN-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Senior Manager"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications: Several years of experience designing, developing, and shipping high-quality software at scale Some years of experience in people management or relevant experience in leading technical teams Experience developing a strategy and roadmap for your teams Preferred Qualifications: There are only a handful of folks who meet all qualifications. Is this you? Excellent, please apply. But we care most about managers that have a track record of caring deeply about their teams, management as a craft, and shipping software that helps people with their work. Either way, we want to hear from you. Experience with Android and/or iOS Experience with Ruby on Rails Knowledge of testing, profiling, and debugging practices Experience working asynchronously on a remote, distributed team Passionate about fostering good engineering practices and processes Experience communicating with high-level stakeholders and executing large initiatives in an iterative fashion","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Cultivate an environment where team members are empowered and demonstrate a strong sense of ownership Meet with team members 1:1 on a regular basis Help the team ships products, features, and bug-fixes regularly Ensure that individuals on the team are learning, growing, and advancing in their careers Effectively communicate directions and decisions with the team and company Build alignment with engineering, design, and product leadership Guide the team toward building high quality software across multiple platform","posted_date":"March 6, 2024","apply_url":"https://globalcareers-githubinc.icims.com/jobs/2734/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-03-06T02:42:31Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-03-06T02:42:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":1,"uuid":"9ce9d4c5-775c-4e0e-a0fe-5cf9b5eb6236"},"import_id":"6bfc5411-04a1-49b8-9e1c-224dec259205","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/88346469704049350","jobHash":"5413a3a4cbcaaf599cbfbc0e3f63aab6","derivedInfo":{"jobCategories":["MANAGEMENT","COMPUTER_AND_IT"],"locations":[]},"jobSummary":"Cultivate an environment where team members are empowered and demonstrate a strong sense of ownership Meet with team members 1:1 on a regular basis Help the team ships products, features, and bug-fixes regularly Ensure that individuals on the team are learning, growing, and advancing in their careers Effectively communicate directions and decisions with the team and company Build alignment with engineering, design, and product leadership Guide the team toward building high quality software across multiple platform","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2734?lang=en-us","last_mod":"2024-03-06T02:43:16+0000","gdpr":false},"create_date":"2024-03-06T02:43:16+0000","category":[" Engineering"],"full_location":"Remote, CAN","short_location":"Remote, CAN"}},{"data":{"slug":"2720","language":"en-us","languages":["en-us"],"req_id":"2720","title":"Senior Software Engineer, Authentication Team","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is looking for a Senior Software Engineer to join the Authentication team. This team is part of Identity and Enterprise Administration (IdEA) at GitHub. We are responsible for all things authentication. We build and maintain the account login services for GitHub, protecting the integrity of user credentials, and providing means of account recovery. The ideal candidate is a team player who is comfortable working in the context of both monoliths and micro-services. They don’t shy away from hard problems, and have a strong sense of customer empathy. They are comfortable working closely with engineers at all levels as well as product managers. Responsibilities Leveraging strong OS and cryptography skills, extending existing standards that protect web-facing credentials to the OS and native app side. Work on cross-cutting projects to independently scale authentication services. Implement new and maintain existing authentication flows and management interfaces. Integrate with third party services that support authentication interfaces - Troubleshoot customer authentication issues across our product suite in an on-call rotation. Qualifications Required Qualifications 6+ years of software engineering experience 4+ years experience building high-traffic applications 4+ years experience leading a team of engineers on projects from start to finish 2+ years experience designing and building large-scale services Preferred Qualifications Experience in Go, Ruby/Rails Experience in IAM space Familiarity with 2FA/MFA, WebAuthn, SSH, PAT, Passwordless authentication concepts Familiarity with cryptography systems such as TPMs and iCloud Keychain, OAuth 2 protocols, and native app development Comfortable in delivering large ambitious projects using iterative deliverables. Strong track record of delivering projects Compensation Range USD $104,400.00 - USD $276,900.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications 6+ years of software engineering experience 4+ years experience building high-traffic applications 4+ years experience leading a team of engineers on projects from start to finish 2+ years experience designing and building large-scale services Preferred Qualifications Experience in Go, Ruby/Rails Experience in IAM space Familiarity with 2FA/MFA, WebAuthn, SSH, PAT, Passwordless authentication concepts Familiarity with cryptography systems such as TPMs and iCloud Keychain, OAuth 2 protocols, and native app development Comfortable in delivering large ambitious projects using iterative deliverables. Strong track record of delivering projects","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Leveraging strong OS and cryptography skills, extending existing standards that protect web-facing credentials to the OS and native app side. Work on cross-cutting projects to independently scale authentication services. Implement new and maintain existing authentication flows and management interfaces. Integrate with third party services that support authentication interfaces - Troubleshoot customer authentication issues across our product suite in an on-call rotation.","posted_date":"February 29, 2024","apply_url":"https://careers-githubinc.icims.com/jobs/2720/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-02-29T17:34:41Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-02-29T17:34:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":1,"uuid":"e5410306-ff3e-41ee-b714-fec6044e28fd"},"import_id":"8efd449d-73b6-41d6-8b61-686d86330940","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/86779849244320454","jobHash":"905ef047b3a18a62bb110594a2aaa4ea","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":7.17042852578733e-05}]},"jobSummary":"Leveraging strong OS and cryptography skills, extending existing standards that protect web-facing credentials to the OS and native app side. Work on cross-cutting projects to independently scale authentication services. Implement new and maintain existing authentication flows and management interfaces. Integrate with third party services that support authentication interfaces - Troubleshoot customer authentication issues across our product suite in an on-call rotation.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2720?lang=en-us","last_mod":"2024-02-29T17:35:26+0000","gdpr":false},"create_date":"2024-02-29T17:35:26+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2721","language":"en-us","languages":["en-us"],"req_id":"2721","title":"Staff Software Engineering Manager","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview The Enterprise Server team is responsible for the Platform and Operator Experience of GitHub’s on-premise product. We're looking for an experienced engineering manager to help lead a distributed team of Platform and Infrastructure Engineers. As a leader and manager, you will directly influence engineering culture, mentor and grow other engineers, engage in long term architectural planning, and partner closely with key partners across the company to help deliver a highly available, resilient and scalable Enterprise product. The team is highly distributed and the right candidate can thrive in an environment of asynchronous communication. We expect you to have strong written and verbal communication skills and be able to create working relationships with coworkers in locations around the globe. Responsibilities Guiding the development team’s vision, best practices, and priorities. Provide clarity and a shared understanding of decision making, direction, and progress for the team and the company. Meeting 1-1 with team members on a regular basis. Planning and supporting career development. Giving guided performance feedback. Reviewing code, design docs and leading small group discussions about engineering issues. Drive incident response and facilitate blameless postmortems. Coordinating work with engineering teams across the stack. Qualifications Required Qualifications 10+ years software engineering experience 5+ years of experience managing engineering teams Experience designing, building, scaling and maintaining distributed, highly available systems. Preferred Qualifications Passionate about creating and fostering good engineering practices and processes Passionate about resiliency and reliable infrastructure and building for high availability Strong written and verbal communication skills. Have experience managing/working on distributed teams. Experience with building or managing on-premise products. Experience with reliability engineering or experience being oncall for highly available systems Compensation Range USD $118,100.00 - USD $313,300.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Director"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications 10+ years software engineering experience 5+ years of experience managing engineering teams Experience designing, building, scaling and maintaining distributed, highly available systems. Preferred Qualifications Passionate about creating and fostering good engineering practices and processes Passionate about resiliency and reliable infrastructure and building for high availability Strong written and verbal communication skills. Have experience managing/working on distributed teams. Experience with building or managing on-premise products. Experience with reliability engineering or experience being oncall for highly available systems","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Guiding the development team’s vision, best practices, and priorities. Provide clarity and a shared understanding of decision making, direction, and progress for the team and the company. Meeting 1-1 with team members on a regular basis. Planning and supporting career development. Giving guided performance feedback. Reviewing code, design docs and leading small group discussions about engineering issues. Drive incident response and facilitate blameless postmortems. Coordinating work with engineering teams across the stack.","posted_date":"February 28, 2024","apply_url":"https://careers-githubinc.icims.com/jobs/2721/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-02-28T17:29:28Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-02-28T17:29:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":1,"uuid":"4cf6280f-8e1b-4497-86b3-84643eb81d6b"},"import_id":"d91e054b-e1f6-48a4-a9c3-9cc1de91950a","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/107253175049691846","jobHash":"de250b061e670fe32c0ce0ea3ff23480","derivedInfo":{"jobCategories":["MANAGEMENT","COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":7.17042852578733e-05}]},"jobSummary":"Guiding the development team’s vision, best practices, and priorities. Provide clarity and a shared understanding of decision making, direction, and progress for the team and the company. Meeting 1-1 with team members on a regular basis. Planning and supporting career development. Giving guided performance feedback. Reviewing code, design docs and leading small group discussions about engineering issues. Drive incident response and facilitate blameless postmortems. Coordinating work with engineering teams across the stack.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2721?lang=en-us","last_mod":"2024-02-28T17:30:25+0000","gdpr":false},"create_date":"2024-02-28T17:30:25+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2460","language":"en-us","languages":["en-us"],"req_id":"2460","title":"Staff Software Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview Do you want to be part of the team that builds the future of developer productivity and collaboration at GitHub? Our team enables customers to bring their ideas to life, innovate and collaborate throughout the whole project lifecycle. GitHub Notifications is the heart of developer collaboration, focus and productivity, and we are building a new underlying platform to support the 100M+ notifications we deliver per day to the world’s software developers. Enhance the collaboration experience at GitHub by working closely with a community of engineers and designers with a distributed, diverse and passionate team delivering the services that millions of developers depend on. In this role you will design, prototype, implement, ship and support highly performant and inspiring user experiences with your team. We are looking for creative problem solvers and diverse thinkers, people who care about culture as well as customers and features. We believe that how we do things is as important as what we do. Big vision, a common purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what lead to great results. Great products reflect the teams that build them. #GitHubJobs A day in the life: Our team is distributed worldwide, which means we work asynchronously most of the time. Your typical week would include: Collaborating with design, analytics, support, and product management to understand the problems we want to solve and exploring how we can solve them Discussing and collaboratively solving engineering and product problems with collaborators in Slack or Zoom Opening a Pull Request to implement the next most important feature or fix the most critical bug Trying to reproduce a reported bug and responding to issues we’ve received from the community Reviewing your teammates' Pull Requests and providing helpful feedback Working with your engineering manager in your one-on-one meetings to grow your team and career Responsibilities Scope out and implement technical solutions that scale across multiple GitHub services Become intimately familiar with the systems you build and take pride in writing maintainable code Write, review and maintain code primarily in TypeScript and Ruby Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others Qualifications Required Qualifications: Experience in running services in production at scale with modern web stacks (e.g. Rails, TypeScript(Node.js), mySQL, Kafka...) and proficiency in NodeJS development Experience designing, building and running data-extensive event-driven architectures. Experience in technical leadership that includes driving technical decisions and guiding broader project goals. Excellent in data analytics and data driven decisions. Preferred Qualifications: Experience working remotely as part of a software engineering team. Experience working in Ruby. Effective communicator, be it when you write code, write emails, or explain complex technical issues to non-technical co-workers. Passionate and self-motivated, with a demonstrated ability to work in a fast-paced environment GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"United Kingdom Remote","city":"Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications: Experience in running services in production at scale with modern web stacks (e.g. Rails, TypeScript(Node.js), mySQL, Kafka...) and proficiency in NodeJS development Experience designing, building and running data-extensive event-driven architectures. Experience in technical leadership that includes driving technical decisions and guiding broader project goals. Excellent in data analytics and data driven decisions. Preferred Qualifications: Experience working remotely as part of a software engineering team. Experience working in Ruby. Effective communicator, be it when you write code, write emails, or explain complex technical issues to non-technical co-workers. Passionate and self-motivated, with a demonstrated ability to work in a fast-paced environment","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Scope out and implement technical solutions that scale across multiple GitHub services Become intimately familiar with the systems you build and take pride in writing maintainable code Write, review and maintain code primarily in TypeScript and Ruby Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others","posted_date":"February 28, 2024","apply_url":"https://globalcareers-githubinc.icims.com/jobs/2460/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-03-06T14:57:49Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-02-28T15:37:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":10,"uuid":"7cddad44-79ec-457c-abfa-be275765952d"},"import_id":"cf0f7216-99cd-4537-a19d-b5984d8b2435","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/123845973743936198","jobHash":"921772cc6c35f7e4e4dd111eab5cec6b","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"Scope out and implement technical solutions that scale across multiple GitHub services Become intimately familiar with the systems you build and take pride in writing maintainable code Write, review and maintain code primarily in TypeScript and Ruby Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2460?lang=en-us","last_mod":"2024-03-06T14:58:15+0000","gdpr":true},"update_date":"2024-03-06T14:58:15+0000","create_date":"2024-02-28T15:38:25+0000","category":[" Engineering"],"full_location":"Remote, United Kingdom","short_location":"Remote, United Kingdom"}},{"data":{"slug":"2691","language":"en-us","languages":["en-us"],"req_id":"2691","title":"Customer Reliability Engineer III","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, Australia Overview More and more companies are using GitHub Enterprise, so the support team is growing. When our customers have problems, they contact us and it is our goal to help them as quickly and awesomely as possible. We're growing our team of Customer Reliability Engineers to help ensure the technical success of our largest and most complex customer deployments, comprised of on-premise installations of GitHub Enterprise Server and GitHub Enterprise Cloud. Your main responsibilities will be to: Work with assigned customers via support tickets and/or real-time interaction (phone/screen sharing) to solve technical issues related to their usage of GitHub products. Act as a single point of contact for technical issues with ability to troubleshoot and resolve complex issues independently. Gather metrics around tickets, issues, training needs, and so on for your assigned accounts for quarterly business reviews. Collaborate with the Support and Engineering teams to resolve product issues requiring code changes. Lead incident response for outages affecting assigned customers, followed by delivery of postmortem reports. Tickets are usually opened by customer system administrators, and can include investigating load or networking issues, debugging application errors, and discussing feature requests. You'll also work with our engineering team to prioritize issues and development, and our documentation team to improve customer-facing resources. You don’t need to be a Git expert, but you do need to have technical experience and a passion for helping people. GitHub works remotely and asynchronously as much as possible. While this role does not require you to live near our office, it will require some travel to meet with co-workers or attend company events. This role may require working non-standard working hours, including weekends and holidays on-call as part of a team-wide rotation. Responsibilities Act as a single point of contact for specific enterprise customers to provide performance, and best practice advice and assessment related to GitHub and customer's infrastructure Understand and maintain documentation around the customer infrastructure, workflows, and configuration of GitHub Enterprise Server or GitHub Enterprise Cloud environment Coordinate and collaborate with other teams at GitHub when additional expertise is needed to resolve customer issues Provide guidance and assistance with customer support tickets often involving Linux servers, source code, and web application issues Manage customer incidents and outages, including joining Zoom/screen share sessions for live triage Perform incident postmortems, ticket analysis, and system health checks for Premium Support customers as needed Lead quarterly business reviews for the assigned accounts by presenting metrics, data, and health check summary and recommendations Organize and lead weekly/bi-weekly touchpoints with assigned accounts to review ongoing Support issues and projects Work proactively with customers on activities such as coordinating upgrades and ensuring their installation is running smoothly Set-up and onboard new assigned customers into the program Work with Sales to outline the GitHub Premium Support program and features to potential customers. Provide weekend on-call support as part of the team rotation (8 hour shifts, during normal work hours) Qualifications Required Qualifications: Several years experience in technical support, customer advocacy, technical implementation, systems management or other related fields Demonstrable ability in Linux system administration, with skills in common tools like Docker, Kubernetes, or other similar tools Demonstrable ability in supporting production-level virtualization platforms or cloud providers such VMware ESX, KVM, AWS, Azure or others alike Previous experience with the ability to update code (including CI/CD practices) Preferred Qualifications: Deep knowledge of Git, GitLFS, and GitHub. Familiarity with Ruby on Rails. Proven experience successfully managing customer engagements to completion and customer satisfaction. Worked closely with large complex customer accounts in a technical capacity Demonstrable ability to review and update code with knowledge of modern CI/CD practices GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"Australia Remote","city":"Remote","country":"Australia","country_code":"AU","location_type":"ANY","latitude":-25.274398,"longitude":133.775136,"categories":[{"name":"Engineering"}],"tags2":["AU-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: Several years experience in technical support, customer advocacy, technical implementation, systems management or other related fields Demonstrable ability in Linux system administration, with skills in common tools like Docker, Kubernetes, or other similar tools Demonstrable ability in supporting production-level virtualization platforms or cloud providers such VMware ESX, KVM, AWS, Azure or others alike Previous experience with the ability to update code (including CI/CD practices) Preferred Qualifications: Deep knowledge of Git, GitLFS, and GitHub. Familiarity with Ruby on Rails. Proven experience successfully managing customer engagements to completion and customer satisfaction. Worked closely with large complex customer accounts in a technical capacity Demonstrable ability to review and update code with knowledge of modern CI/CD practices","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Act as a single point of contact for specific enterprise customers to provide performance, and best practice advice and assessment related to GitHub and customer's infrastructure Understand and maintain documentation around the customer infrastructure, workflows, and configuration of GitHub Enterprise Server or GitHub Enterprise Cloud environment Coordinate and collaborate with other teams at GitHub when additional expertise is needed to resolve customer issues Provide guidance and assistance with customer support tickets often involving Linux servers, source code, and web application issues Manage customer incidents and outages, including joining Zoom/screen share sessions for live triage Perform incident postmortems, ticket analysis, and system health checks for Premium Support customers as needed Lead quarterly business reviews for the assigned accounts by presenting metrics, data, and health check summary and recommendations Organize and lead weekly/bi-weekly touchpoints with assigned accounts to review ongoing Support issues and projects Work proactively with customers on activities such as coordinating upgrades and ensuring their installation is running smoothly Set-up and onboard new assigned customers into the program Work with Sales to outline the GitHub Premium Support program and features to potential customers. Provide weekend on-call support as part of the team rotation (8 hour shifts, during normal work hours)","posted_date":"February 23, 2024","apply_url":"https://globalcareers-githubinc.icims.com/jobs/2691/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-02-23T19:55:33Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-02-23T19:52:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":3,"uuid":"4b795949-7cb6-4f4e-8439-33f977cb7c43"},"import_id":"f09a8ed1-e2ab-42a4-a9cf-7a6fb34364dc","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/110297734558163654","jobHash":"40d3229a720e8da8084722b21bf8c1be","derivedInfo":{"jobCategories":["COMPUTER_AND_IT","CUSTOMER_SERVICE"],"locations":[{"latLng":{"latitude":-25.274398,"longitude":133.775136},"locationType":"COUNTRY","postalAddress":{"addressLines":["Australia"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"AU","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":1.7249516216473701}]},"jobSummary":"Act as a single point of contact for specific enterprise customers to provide performance, and best practice advice and assessment related to GitHub and customer's infrastructure Understand and maintain documentation around the customer infrastructure, workflows, and configuration of GitHub Enterprise Server or GitHub Enterprise Cloud environment Coordinate and collaborate with other teams at GitHub when additional expertise is needed to resolve customer issues Provide guidance and assistance with customer support tickets often involving Linux servers, source code, and web application issues Manage customer incidents and outages, including joining Zoom/screen share sessions for live triage Perform incident postmortems, ticket analysis, and system health checks for Premium Support customers as needed Lead quarterly business reviews for the assigned accounts by presenting metrics, data, and health check summary and recommendations Organize and lead weekly/bi-weekly touchpoints with assigned accounts to review ongoing Support issues and projects Work proactively with customers on activities such as coordinating upgrades and ensuring their installation is running smoothly Set-up and onboard new assigned customers into the program Work with Sales to outline the GitHub Premium Support program and features to potential customers. Provide weekend on-call support as part of the team rotation (8 hour shifts, during normal work hours)","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2691?lang=en-us","last_mod":"2024-02-23T19:56:17+0000","gdpr":false},"update_date":"2024-02-23T19:56:17+0000","create_date":"2024-02-23T19:53:17+0000","category":[" Engineering"],"full_location":"Remote, Australia","short_location":"Remote, Australia"}},{"data":{"slug":"2657","language":"en-us","languages":["en-us"],"req_id":"2657","title":"Senior Engineering Manager","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub is changing the way the world builds software, and we want you to help build GitHub. We're looking for an experienced software engineering manager to join a passionate, collaborative, distributed group of engineers on our team. The GitHub Mobile team is changing the way that developers across the world collaborate on GitHub through native Android and iOS apps. Launched in March 2020, GitHub Mobile is one of our fastest growing products. The mobile team is part of the Client Apps organization, working alongside the GitHub Desktop and GitHub CLI teams. This role will oversee one of our GitHub Mobile squads with Android, iOS, and server engineers located across the United States. You will partner closely with our other GitHub Mobile squad located primarily in Berlin, Germany. Stack: Our apps are built natively with Kotlin for Android and Swift for iOS. Our apps communicate with GitHub via GraphQL and REST APIs. A day in the life of a Senior Engineering Manager: Our team is distributed worldwide which means we work asynchronously most of the time. Your typical week would include: Work with design, data, and product management to understand the problems we want to solve, then working with engineers to solve them. Solving engineering and product problems with engineering collaborators via GitHub, Slack, and Zoom Planning with partner teams and stakeholders Create and foster a high-performance culture amongst your team Conducting 1:1s with direct reports to provide regular feedback and ensure career growth and progression Working with your manager in your 1:1 meetings to grow yourself and career Talking with users to get feedback and data about the apps Responsibilities Responsibilities: Cultivate an environment where team members are empowered and demonstrate a strong sense of ownership Meet with team members 1:1 on a regular basis Help the team ships products, features, and bug-fixes regularly Ensure that individuals on the team are learning, growing, and advancing in their careers Effectively communicate directions and decisions with the team and company Build alignment with engineering, design, and product leadership Guide the team toward building high quality software across multiple platforms Qualifications Required Qualifications: 6+ years of experience designing, developing, and shipping high-quality software at scale 2+ years of experience in people management or relevant experience in leading technical teams Experience developing a strategy and roadmap for your teams Preferred Qualifications: There are only a handful of folks who meet all qualifications. Is this you? Excellent, please apply. But we care most about managers that have a track record of caring deeply about their teams, management as a craft, and shipping software that helps people with their work. Either way, we want to hear from you. Experience with Android and/or iOS Experience with Ruby on Rails Knowledge of testing, profiling, and debugging practices Experience working asynchronously on a remote, distributed team Passionate about fostering good engineering practices and processes Experience communicating with high-level stakeholders and executing large initiatives in an iterative fashion Compensation Range USD $104,400.00 - USD $276,900.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Senior Manager"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 6+ years of experience designing, developing, and shipping high-quality software at scale 2+ years of experience in people management or relevant experience in leading technical teams Experience developing a strategy and roadmap for your teams Preferred Qualifications: There are only a handful of folks who meet all qualifications. Is this you? Excellent, please apply. But we care most about managers that have a track record of caring deeply about their teams, management as a craft, and shipping software that helps people with their work. Either way, we want to hear from you. Experience with Android and/or iOS Experience with Ruby on Rails Knowledge of testing, profiling, and debugging practices Experience working asynchronously on a remote, distributed team Passionate about fostering good engineering practices and processes Experience communicating with high-level stakeholders and executing large initiatives in an iterative fashion","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Responsibilities: Cultivate an environment where team members are empowered and demonstrate a strong sense of ownership Meet with team members 1:1 on a regular basis Help the team ships products, features, and bug-fixes regularly Ensure that individuals on the team are learning, growing, and advancing in their careers Effectively communicate directions and decisions with the team and company Build alignment with engineering, design, and product leadership Guide the team toward building high quality software across multiple platforms","posted_date":"February 20, 2024","apply_url":"https://careers-githubinc.icims.com/jobs/2657/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-03-04T03:40:01Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-02-20T16:14:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":9,"uuid":"3eb124f5-b732-45c1-ae16-4c4ad421d0ca"},"import_id":"b9034275-301c-4d0c-9649-cfb29b3dc561","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/113748961769988806","jobHash":"3de35d1c0dbb5128dadc58705689dfd0","derivedInfo":{"jobCategories":["MANAGEMENT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":7.17042852578733e-05}]},"jobSummary":"Responsibilities: Cultivate an environment where team members are empowered and demonstrate a strong sense of ownership Meet with team members 1:1 on a regular basis Help the team ships products, features, and bug-fixes regularly Ensure that individuals on the team are learning, growing, and advancing in their careers Effectively communicate directions and decisions with the team and company Build alignment with engineering, design, and product leadership Guide the team toward building high quality software across multiple platforms","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2657?lang=en-us","last_mod":"2024-03-04T03:40:15+0000","gdpr":false},"update_date":"2024-03-04T03:40:15+0000","create_date":"2024-02-20T16:16:17+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2645","language":"en-us","languages":["en-us"],"req_id":"2645","title":"Senior Software Engineer, Authentication Team","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, Canada Overview GitHub is looking for a Senior Software Engineer to join the Authentication team. This team is part of Identity and Enterprise Administration (IdEA) at GitHub. We are responsible for all things authentication. We build and maintain the account login services for GitHub, protecting the integrity of user credentials, and providing means of account recovery. The ideal candidate is a team player who is comfortable working in the context of both monoliths and micro-services. They don’t shy away from hard problems, and have a strong sense of customer empathy. They are comfortable working closely with engineers at all levels as well as product managers. Responsibilities Leveraging strong OS and cryptography skills, extending existing standards that protect web-facing credentials to the OS and native app side. Work on cross-cutting projects to independently scale authentication services. Implement new and maintain existing authentication flows and management interfaces. Integrate with third party services that support authentication interfaces - Troubleshoot customer authentication issues across our product suite in an on-call rotation. Qualifications Required Qualifications 6+ years of software engineering experience 4+ years experience building high-traffic applications 4+ years experience leading a team of engineers on projects from start to finish 2+ years experience designing and building large-scale services Preferred Qualifications Experience in Go, Ruby/Rails Experience in IAM space Familiarity with 2FA/MFA, WebAuthn, SSH, PAT, Passwordless authentication concepts Familiarity with cryptography systems such as TPMs and iCloud Keychain, OAuth 2 protocols, and native app development Comfortable in delivering large ambitious projects using iterative deliverables. Strong track record of delivering projects GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"Canada Remote","city":"Remote","country":"CAN","country_code":"CN","location_type":"ANY","latitude":23.11667,"longitude":113.25,"categories":[{"name":"Engineering"}],"tags2":["CAN-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications 6+ years of software engineering experience 4+ years experience building high-traffic applications 4+ years experience leading a team of engineers on projects from start to finish 2+ years experience designing and building large-scale services Preferred Qualifications Experience in Go, Ruby/Rails Experience in IAM space Familiarity with 2FA/MFA, WebAuthn, SSH, PAT, Passwordless authentication concepts Familiarity with cryptography systems such as TPMs and iCloud Keychain, OAuth 2 protocols, and native app development Comfortable in delivering large ambitious projects using iterative deliverables. Strong track record of delivering projects","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Leveraging strong OS and cryptography skills, extending existing standards that protect web-facing credentials to the OS and native app side. Work on cross-cutting projects to independently scale authentication services. Implement new and maintain existing authentication flows and management interfaces. Integrate with third party services that support authentication interfaces - Troubleshoot customer authentication issues across our product suite in an on-call rotation.","posted_date":"February 13, 2024","apply_url":"https://globalcareers-githubinc.icims.com/jobs/2645/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-02-27T15:22:32Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-02-13T22:23:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":6,"uuid":"b2269d6b-0452-454c-9eda-45b884db63fc"},"import_id":"1a2d56a7-9d2b-4912-be2c-c773f2702775","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/110840172620194502","jobHash":"61a67837a0650ab1162a550ee2e5e508","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[]},"jobSummary":"Leveraging strong OS and cryptography skills, extending existing standards that protect web-facing credentials to the OS and native app side. Work on cross-cutting projects to independently scale authentication services. Implement new and maintain existing authentication flows and management interfaces. Integrate with third party services that support authentication interfaces - Troubleshoot customer authentication issues across our product suite in an on-call rotation.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2645?lang=en-us","last_mod":"2024-02-27T15:23:25+0000","gdpr":false},"update_date":"2024-02-27T15:23:25+0000","create_date":"2024-02-13T22:24:56+0000","category":[" Engineering"],"full_location":"Remote, CAN","short_location":"Remote, CAN"}},{"data":{"slug":"2649","language":"en-us","languages":["en-us"],"req_id":"2649","title":"Senior Software Engineer, CLI","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United Kingdom Overview The Client Apps organization at GitHub builds best-in-class experiences for our users to interact with Git and GitHub from whatever environment they choose. We are the small but mighty group responsible for the official GitHub CLI, GitHub Desktop, and GitHub Mobile apps. We are a product-driven organization that values building software collaboratively with our users as well as our internal partners. GitHub CLI (also known as gh) is an open source project that allows users to perform their tasks on GitHub without leaving the terminal. It has over 34K stars and is used by hundreds of thousands of developers and in many more automated workflows every day. The team is looking for a Senior Software Engineer to help influence and build the future of GitHub CLI. Stack: GitHub CLI is built in Go and is highly integrated with GitHub's REST and GraphQL APIs. GitHub CLI is built using GitHub products and features such as GitHub Actions and GitHub Pages. Responsibilities Designing and building new features that will simplify developer workflows. Influencing product direction by participating in design and architecture discussions. Triaging community-reported issues and helping your teammates solve problems. Diving into unfamiliar codebases to debug issues. Collaborating with other GitHub teams to provide the best experience for our users Qualifications Required Qualifications: Many years of experience as a software engineer Experience with Go Solid understanding of testing principles and high quality software Strong analytical skills and experience Preferred Qualifications: Excellent communication skills both verbal and written High degree of empathy Experience in building command line tools Experience in being a part of an open source community, especially as a maintainer Experience in working with a remote, distributed team GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together.","location_name":"United Kingdom Remote","city":"Remote","country":"United Kingdom","country_code":"GB","location_type":"ANY","latitude":55.378051,"longitude":-3.435973,"categories":[{"name":"Engineering"}],"tags2":["UK-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: Many years of experience as a software engineer Experience with Go Solid understanding of testing principles and high quality software Strong analytical skills and experience Preferred Qualifications: Excellent communication skills both verbal and written High degree of empathy Experience in building command line tools Experience in being a part of an open source community, especially as a maintainer Experience in working with a remote, distributed team","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Designing and building new features that will simplify developer workflows. Influencing product direction by participating in design and architecture discussions. Triaging community-reported issues and helping your teammates solve problems. Diving into unfamiliar codebases to debug issues. Collaborating with other GitHub teams to provide the best experience for our users","posted_date":"February 7, 2024","apply_url":"https://globalcareers-githubinc.icims.com/jobs/2649/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-03-05T20:19:07Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-02-07T20:54:00+0000","site":"globalcareers-githubinc","siteId":"48855464-2bde-48e1-af86-f8c7872d8750"},"revision_int":4,"uuid":"a6b04d8e-dfac-4b84-87d4-70490ae16f65"},"import_id":"64c45c20-5ef9-4b11-9ad9-eb3225646fd8","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/76132535995638470","jobHash":"3f90c1bbcb33a74a217a42f558a6581b","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":55.378051,"longitude":-3.435973},"locationType":"COUNTRY","postalAddress":{"addressLines":["United Kingdom"],"administrativeArea":"","languageCode":"","locality":"","organization":"","postalCode":"","recipients":[],"regionCode":"GB","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":0.5229118491937161}]},"jobSummary":"Designing and building new features that will simplify developer workflows. Influencing product direction by participating in design and architecture discussions. Triaging community-reported issues and helping your teammates solve problems. Diving into unfamiliar codebases to debug issues. Collaborating with other GitHub teams to provide the best experience for our users","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2649?lang=en-us","last_mod":"2024-03-05T20:19:18+0000","gdpr":true},"update_date":"2024-03-05T20:19:18+0000","create_date":"2024-02-07T20:55:23+0000","category":[" Engineering"],"full_location":"Remote, United Kingdom","short_location":"Remote, United Kingdom"}},{"data":{"slug":"2630","language":"en-us","languages":["en-us"],"req_id":"2630","title":"Senior Software Engineer, Copilot in the CLI ","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview GitHub Copilot has changed the way software is built, and we have a unique opportunity to look further ahead and identify how software development can be faster, safer, easier, and more accessible. We’re looking for a talented, experienced Software Engineer to join the GitHub CLI team on this mission! GitHub CLI (gh) bridges the gap between GitHub primitives and workflows (e.g. Pull Requests, Issues, Repositories) and is a companion of git (not a replacement). With the addition of Copilot in the CLI (gh-copilot), the team is looking for someone who is passionate not only about command line interfaces but also about bringing the power of AI to further boost the productivity straight from the terminal. Come join the team and influence the future of GitHub CLI and Copilot in the CLI! Stack: GitHub CLI is built in Go and is highly integrated with GitHub's REST and GraphQL APIs. GitHub CLI is built using GitHub products and features such as GitHub Actions and GitHub Pages. Responsibilities Designing and building new features that will simplify developer workflows. Influencing product direction by participating in design and architecture discussions. Triaging community-reported issues and helping your teammates solve problems. Diving into unfamiliar codebases to debug issues. Collaborating with other GitHub teams to provide the best experience for our users Qualifications Required Qualifications: 5+ years experience as a software engineer Experience with Go Solid understanding of testing principles and high quality software Strong analytical skills and experience Preferred Qualifications: Excellent communication skills both verbal and written High degree of empathy Experience in building command line tools Experience in being a part of an open source community, especially as a maintainer Experience in working with a remote, distributed team Interest or prior experience in modern AI/machine learning technologies, LLMs, or similar Compensation Range USD $104,400.00 - USD $276,900.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"employment_type":"FULL_TIME","qualifications":"Required Qualifications: 5+ years experience as a software engineer Experience with Go Solid understanding of testing principles and high quality software Strong analytical skills and experience Preferred Qualifications: Excellent communication skills both verbal and written High degree of empathy Experience in building command line tools Experience in being a part of an open source community, especially as a maintainer Experience in working with a remote, distributed team Interest or prior experience in modern AI/machine learning technologies, LLMs, or similar","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Designing and building new features that will simplify developer workflows. Influencing product direction by participating in design and architecture discussions. Triaging community-reported issues and helping your teammates solve problems. Diving into unfamiliar codebases to debug issues. Collaborating with other GitHub teams to provide the best experience for our users","posted_date":"February 7, 2024","apply_url":"https://careers-githubinc.icims.com/jobs/2630/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-03-05T20:18:38Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-02-07T21:04:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":5,"uuid":"82949597-92ba-48c7-b8f9-bf56bfa05ea4"},"import_id":"84237b0b-8f3d-451b-b5d6-df9b1f7fc06b","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/74044563414491846","jobHash":"68578a60a884c003a2b18e8df66d2a24","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":7.17042852578733e-05}]},"jobSummary":"Designing and building new features that will simplify developer workflows. Influencing product direction by participating in design and architecture discussions. Triaging community-reported issues and helping your teammates solve problems. Diving into unfamiliar codebases to debug issues. Collaborating with other GitHub teams to provide the best experience for our users","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2630?lang=en-us","last_mod":"2024-03-05T20:19:15+0000","gdpr":false},"update_date":"2024-03-05T20:19:15+0000","create_date":"2024-02-07T21:05:22+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}},{"data":{"slug":"2665","language":"en-us","languages":["en-us"],"req_id":"2665","title":"Software Engineer","description":"About GitHub As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code. Locations In this role you can work from Remote, United States Overview As a software engineer at GitHub, you will enhance the collaboration experience at GitHub by working closely with a community of engineers and designers with a distributed, diverse and passionate team delivering the services that millions of developers depend on. In this role you will design, prototype, implement, ship and support highly performant and inspiring user experiences with your team. We are looking for creative problem solvers and diverse thinkers, people who care about culture as well as customers and features. We believe that how we do things is as important as what we do. Big vision, a common purpose, passion for quality, curiosity, dedication, and investment in fun and collaboration are what lead to great results. Great products reflect the teams that build them. Responsibilities Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code. Qualifications Required Qualifications Three or more years of experience as a software engineer or related field Bachelor's degree in Computer Science, Software Engineering or equivalent work experience 1+ years of experience delivering high availability, enterprise grade services, including monitoring, observability and diagnosing problems Four or more years of experience in two or more of the following skill sets: Ruby (Rails) Go and related tooling JavaScript (React, TypeScript, Relay) MySQL and database management NodeJS development Design and build REST and/or GraphQL APIs Experience with CI/CD tools and automated pipelines Preferred Qualifications Experience with Git, GitHub , Actions \u0026 workflow platform for version control and collaborative development. Internals of web development frameworks, tools, and client performance optimization. Building developer tools and pipelines that streamline and automate software lifecycle, including development, testing and releasing, with focus on speed, reliability and scalability. Excellent written and verbal communication via async collaboration, documentation, and visibility of work Hands-on experience with distributed systems at global scale. Experience working with a remote, distributed team. Familiarity with SQL, Kusto Query Language, general database knowledge, Kubernetes, and/or cloud-native concepts Passionate about fostering effective Engineering practices and processes and contribute to open source software, engage with maintainers, and actively participate in community curation. Compensation Range USD $75,500.00 - USD $198,900.00 /Yr. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. These pay ranges are intended to cover roles based across the United States. An individual's base pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant. At GitHub certain roles are eligible for benefits and additional rewards, including annual bonus and stock. These rewards are allocated based on individual impact in role. In addition, certain roles also have the opportunity to earn sales incentives based on revenue or utilization, depending on the terms of the plan and the employee's role. GitHub values Customer-obsessed Ship to learn Growth mindset Own the outcome Better together Diverse and inclusive Manager fundamentals Model Coach Care Leadership principles Create clarity Generate energy Deliver success Who We Are GitHub is the world’s leading AI-powered developer platform with 100 million developers and counting. We’re also home to the biggest open-source community on earth (and 99% of the world’s software has open-source code in its DNA). Many of the apps and programs you use every day are built on GitHub. Our teams are dreamers, doers, and pioneers, leading the way in AI, driving humanitarian efforts around the globe, and even sending open source to Mars (and beyond!). At GitHub, our goal is to create the space you need to do your best work. We’re remote-first and offer competitive pay, generous learning and growth opportunities, and excellent benefits to support you, wherever you are—because we know that people flourish when they can work on their own terms. Join us, and let’s change the world, together. EEO Statement GitHub is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and invite applications from people of all walks of life. We don't discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, disability, pregnancy status, veteran status, or any other differences. Also, if you have a disability, please let us know if there's any way we can make the interview process better for you; we're happy to accommodate!","location_name":"US Remote","city":"Remote","country":"United States","country_code":"US","location_type":"ANY","latitude":43.0059455,"longitude":-123.8925908,"categories":[{"name":"Engineering"}],"tags2":["US-Remote"],"tags3":["Engineering"],"tags4":["Experienced Professional"],"tags5":["Individual Contributor"],"tags6":["Yes"],"promotion_value":0,"qualifications":"Required Qualifications Three or more years of experience as a software engineer or related field Bachelor's degree in Computer Science, Software Engineering or equivalent work experience 1+ years of experience delivering high availability, enterprise grade services, including monitoring, observability and diagnosing problems Four or more years of experience in two or more of the following skill sets: Ruby (Rails) Go and related tooling JavaScript (React, TypeScript, Relay) MySQL and database management NodeJS development Design and build REST and/or GraphQL APIs Experience with CI/CD tools and automated pipelines Preferred Qualifications Experience with Git, GitHub , Actions \u0026 workflow platform for version control and collaborative development. Internals of web development frameworks, tools, and client performance optimization. Building developer tools and pipelines that streamline and automate software lifecycle, including development, testing and releasing, with focus on speed, reliability and scalability. Excellent written and verbal communication via async collaboration, documentation, and visibility of work Hands-on experience with distributed systems at global scale. Experience working with a remote, distributed team. Familiarity with SQL, Kusto Query Language, general database knowledge, Kubernetes, and/or cloud-native concepts Passionate about fostering effective Engineering practices and processes and contribute to open source software, engage with maintainers, and actively participate in community curation.","hiring_organization":"GitHub, Inc.","hiring_organization_logo":"https://githubinc.icims.com/icims2/servlet/icims2?module=AppInert\u0026action=download\u0026id=59\u0026hashed=-1914625542","responsibilities":"Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","posted_date":"February 2, 2024","apply_url":"https://careers-githubinc.icims.com/jobs/2665/login","internal":false,"searchable":true,"applyable":true,"li_easy_applyable":true,"ats_code":"icims","meta_data":{"client_code":"githubinc","icims":{"config_keys":null,"date_updated":"2024-02-13T13:48:59Z","jps_is_public":true,"primary_posted_site_object":{"datePosted":"2024-02-02T15:42:00+0000","site":"careers-githubinc","siteId":"20eb6748-fc41-4254-82cb-ee737e5150cb"},"revision_int":5,"uuid":"91444639-840b-49d4-aa7a-ef1767b5a6ec"},"import_id":"6ae73219-d1d2-41d2-b95b-abbc24deefd6","import_source":"ImporterService","redirectOnApply":true,"googlejobs":{"companyName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/companies/b8bb5907-834c-48e1-931c-0cf82e6efc8c","jobName":"projects/helpful-passage-853/tenants/cb22eb5b-7e00-0000-0000-007edad744d3/jobs/127419535046124230","jobHash":"77c20c6c7dceafebc927f142fe3aaf3d","derivedInfo":{"jobCategories":["COMPUTER_AND_IT"],"locations":[{"latLng":{"latitude":43.0059455,"longitude":-123.8925908},"locationType":"POSTAL_CODE","postalAddress":{"addressLines":["Remote, OR 97458, USA"],"administrativeArea":"OR","languageCode":"","locality":"Remote","organization":"","postalCode":"97458","recipients":[],"regionCode":"US","revision":0,"sortingCode":"","sublocality":""},"radiusInMiles":7.17042852578733e-05}]},"jobSummary":"Design, develop and ship high-quality technical solutions that scale across multiple GitHub services. Collaborate with cross-functional teams to define and implement innovative solutions. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others. Write architecture briefs and proposals, carry out code experiments, and build prototypes to learn how we can achieve planetary scale with our systems. Design and implement APIs to facilitate seamless integration between software components. Utilize CI/CD tools to set up automated pipelines for continuous integration and delivery. Become intimately familiar with the systems you build and take pride in writing maintainable code.","jobTitleSnippet":"","searchTextSnippet":""},"canonical_url":"https://githubinc.jibeapply.com/jobs/2665?lang=en-us","last_mod":"2024-02-13T13:49:56+0000","gdpr":false},"update_date":"2024-02-13T13:49:56+0000","create_date":"2024-02-06T12:12:33+0000","category":[" Engineering"],"full_location":"Remote, United States","short_location":"Remote, United States"}}],"totalCount":21,"count":21,"filter":{"displayLimit":10,"categories":{"all":[{"category":"Engineering","numJobs":21}],"shortlist":[{"category":"Engineering","numJobs":21}]},"brands":{"all":[],"shortlist":[]},"experienceLevels":{"all":[],"shortlist":[]},"locations":{"all":[{"city":"Remote","state":null,"country":"Australia","count":1},{"city":"Remote","state":null,"country":"CAN","count":2},{"city":"Remote","state":null,"country":"United Kingdom","count":4},{"city":"Remote","state":null,"country":"United States","count":14}],"shortlist":[{"city":"Remote","state":null,"country":"Australia","count":1},{"city":"Remote","state":null,"country":"CAN","count":2},{"city":"Remote","state":null,"country":"United Kingdom","count":4},{"city":"Remote","state":null,"country":"United States","count":14}]},"facetList":{"tags4":[{"term":"Experienced Professional","count":21}],"tags5":[{"term":"Individual Contributor","count":17},{"term":"Director","count":2},{"term":"Senior Manager","count":2}],"tags6":[{"term":"Yes","count":21}]}},"languageCounts":{"en-us":{"displayName":"English","count":21}},"request_id":false,"locations":[]}